
// ===================== #1.3 ======================================
// В первом подъезде номера квартир от 1 до 20, во втором от 21 до 64, в
// третьем от 65 до 80. Пользователь вводит номер квартиры, необходимо указать в каком
//она подъезде.

var flat = prompt('Введіть номер квартитри');

function isValidNumber(n) { // якщо номер ОК, то повертає false
  return ( isNaN(n) + !isFinite(n) ) + ( Math.ceil(n)-n != 0 ) + ( n == null ); }

if ( isValidNumber(flat) + (flat <= 0) + (flat >= 81) ) { alert('"Ти заблуділся мальчік!"') }

	else if (flat <= 20) { alert('Квартира № ' + flat + ' знаходиться в першому підїзді')  }
	else if (flat <= 64) { alert('Квартира № ' + flat + ' знаходиться в другому підїзді')  }
					else { alert('Квартира № ' + flat + ' знаходиться в третьому підїзді') }