let dataVid = '26.08'
let dataDo = '16.09';
let base = [  

    {pic: "41", desc: `Торт "Творожно-кавовий"$100г`, disc: "40%", priceO: "1600", priceN: "969"},
    {pic: "26", desc: `Торт "Лісова ягода"$100г`, disc: "40%", priceO: "1600", priceN: "969"},
    {pic: "40", desc: `Торт "Добош"$100г`, disc: "40%", priceO: "1600", priceN: "969"},
    {pic: "31", desc: `Круасан "GRAND FOOD"$зі згущеним молоком$100г`, disc: "45%", priceO: "1300", priceN: "700"},
    
    {pic: "30", desc: `Слойка "GRAND FOOD" з вишнею$100г`, disc: "40%", priceO: "1200", priceN: "700"},
    {pic: "39", desc: `Ватрушка$120г`, disc: "45%", priceO: "1100", priceN: "600"},
    {pic: "35", desc: `Булочка "Равлик"$100г`, disc: "45%", priceO: "700", priceN: "390"},
    {pic: "38", desc: `Хліб Бездріжджовий  "Гречаний" подовий 400г`, disc: "35%", priceO: "1990", priceN: "1290"},

    {pic: "36", desc: `Булочка "Сирна Палочка"$90г`, disc: "40%", priceO: "900", priceN: "550"},
    {pic: "37", desc: `Булочка "З кетчупом та сиром"$80г`, disc: "40%", priceO: "700", priceN: "450"},
    {pic: "42", desc: `Cухарі панірувальні 500г`, disc: "45%", priceO: "1599", priceN: "890"},
    {pic: "12a", desc: `Сухарі прісні$100г`, disc: "50%", priceO: "250", priceN: "129"},

    {pic: "21", desc: `Курча Гриль$100г`, disc: "25%", priceO: "1299", priceN: "999"},
    {pic: "27", desc: `Багет "GRAND FOOD"$в асортименті$230г`, disc: "25%", priceO: "2500", priceN: "1900"},
    {pic: "29", desc: `Капуста квашена білокачанна$з морквою/буряком$900г`, disc: "60%", priceO: "2490", priceN: "999"},
    {pic: "14", desc: `Пельмнені свинні кольорові та свинно-яловичі$100г`, disc: "35%", priceO: "1199", priceN: "799"},

    {pic: "18", desc: `Фарш свинний та свинно-яловичий$100г`, disc: "25%", priceO: "1199", priceN: "899"},
    {pic: "17a", desc: `Корейка свинна охолодженна$100г`, disc: "20%", priceO: "1499", priceN: "1199"},
    {pic: "23", desc: `Ребра свинні мясні охолодженні$100г`, disc: "25%", priceO: "1299", priceN: "999"},
    {pic: "16", desc: `Крило куряче охолоджене$100г`, disc: "25%", priceO: "5999", priceN: "449"},

//{pic: "28", desc: `Смалець$500г`, disc: "35%", priceO: "3000", priceN: "1900"},
//{pic: "12", desc: `Сухарі здобні$100г`, disc: "40%", priceO: "299", priceN: "179"},
//{pic: "12c", desc: `Грінки$100г`, disc: "40%", priceO: "299", priceN: "179"},
//{pic: "15", desc: `Пельмені свинно-яловичі$100г`, disc: "35%", priceO: "1199", priceN: "799"},
//{pic: "18", desc: `Фарш свинний$100г`, disc: "20%", priceO: "1099", priceN: "899"},



{pic: "24", desc: `Виноград`, disc: "XIT", priceO: " ", priceN: " "},
{pic: "25", desc: `Яблука`, disc: "XIT", priceO: " ", priceN: " "},
{pic: "32", desc: `Авокадо`, disc: "XIT", priceO: " ", priceN: " "},
{pic: "22", desc: `Масло "Гайсинське"$солод.верш. селянське 72,5%$200г`, disc: "25%", priceO: "3400", priceN: "2590"},

{pic: "19", desc: `Сир "Російський" ДСТУ 50% "Добрі товари"$100г`, disc: "25%", priceO: "1800", priceN: "1379"},
{pic: "9", desc: `Сир "Савушкин продукт" творожний до салату$250г`, disc: "25%", priceO: "4550", priceN: "3490"},
{pic: "7", desc: `Сир кремовий "Тасіаті"$в асортименті$135г`, disc: "20%", priceO: "3200", priceN: "2590"},
{pic: "20", desc: `Сир плавл."Вершковий" TM"Ферма"$90г`, disc: "20%", priceO: "1500", priceN: "1199"},

{pic: "33", desc: `Молоко "Ферма" 2.5%$900г`, disc: "25%", priceO: "2500", priceN: "1890"},
{pic: "43", desc: `Ковбаса "Магурська" ТМ"Світ мяса"$100г`, disc: "25%", priceO: "1290", priceN: "999"},
{pic: "44", desc: `Ковбаса "Салямі Золотиста" нарізка ТМ"Мясна гільдія"$75г`, disc: "30%", priceO: "2800", priceN: "1990"},
{pic: "10", desc: `Ковбаса "Фірмова з телятини"$варена ТМ"Тульчин"$505г`, disc: "30%", priceO: "5200", priceN: "3750"},

{pic: "8", desc: `Кукурудза "Щедра нива" консервована$420г`, disc: "25%", priceO: "1990", priceN: "1490"},
{pic: "5", desc: `Майонез "Чумак" провансаль 67%$300г`, disc: "25%", priceO: "2200", priceN: "1699"},
{pic: "3", desc: `Пиво "ППБ" Закарпатське оригінальне$0,5л`, disc: "25%", priceO: "1650", priceN: "1290"},
{pic: "1", desc: `Напій "БОН Буассон"$в асортименті$2л`, disc: "25%", priceO: "2550", priceN: "1990"},

{pic: "4", desc: `Капучіно "Ла Феста"$в асортименті$10шт`, disc: "15%", priceO: "2600", priceN: "2190"},
{pic: "11", desc: `Печиво "Артемон" ТМ"Конті"$100г`, disc: "30%", priceO: "940", priceN: "649"},
{pic: "13", desc: `Батончик "Нестле" Натс сінгл$42г`, disc: "35%", priceO: "1900", priceN: "1290"},
{pic: "6", desc: `Вафлі "Конті" Батончик Скейт$25г`, disc: "50%", priceO: "500", priceN: "250"},



// {pic: "2", desc: `Мінеральна вода "Плосківська"$1,5л`, disc: "0%", priceO: "000", priceN: "1050"},
// {pic: "34", desc: `Пиво Львівське$0,5л`, disc: "0%", priceO: "1690", priceN: "000"},

]