let dataVid = '31.01'
let dataDo = '21.02';
let base = [

  {pic:'26', desc:`Торт "Снікерс"$100г`,	priceO:'1300',	disc:'40%',	priceN:'780'},
  {pic:'28', desc:`Торт "Іриска"$100г`,	priceO:'1500',	disc:'40%',	priceN:'890'},
  {pic:'4', desc:`Пончики "GRAND FOOD" в шоколаді$60г`,	priceO:'1400',	disc:'35%',	priceN:'900'},
  {pic:'5', desc:`Тістечко "Картошка"$75г`,	priceO:'900',	disc:'45%',	priceN:'490'},
  {pic:'33', desc:`Булочка "Творожно-вишнева"$100г`,	priceO:'900',	disc:'45%',	priceN:'500'},
  {pic:'25', desc:`Булочка "Пампушки з часником"$225г`,	priceO:'1000',	disc:'45%',	priceN:'550'},
  {pic:'24', desc:`Хліб "Кукурудзяний" подовий$450г`,	priceO:'1990',	disc:'35%',	priceN:'1290'},
  {pic:'31', desc:`Снек "GRAND FOOD"$з шинкою та сиром$140г`, priceO:'1800',	disc:'45%',	priceN:'990'},
  {pic:'31a', desc:`Снек "GRAND FOOD"$з грибами та сиром$140г`, priceO:'1600',	disc:'45%',	priceN:'880'},
  {pic:'27', desc:`Круассан "GRAND FOOD"$в ассортименті$200г`,	priceO:'2000',	disc:'35%',	priceN:'1290'},
  {pic:'1', desc:`Пельмені кольорові зі свининою$100г`,	priceO:'900',	disc:'35%',	priceN:'590'},
  {pic:'14', desc:`Шойт$100г`,	priceO:'1400',	disc:'40%',	priceN:'840'},
  {pic:'23', desc:`Ковбаса "Пікниця" сирокопчена$100г`,	priceO:'1600',	disc:'25%',	priceN:'1190'},
  {pic:'2', desc:`Крила курячі охолоджені$100г`,	priceO:'520',	disc:'15%',	priceN:'440'},
  {pic:'22', desc:`Шашлик з курячого стейка охолоджений$100г`,	priceO:'1190',	disc:'25%',	priceN:'890'},

  {pic:'13', desc:`Лимон, кг`,	priceO:'',	disc:'XIT',	priceN:''},
  {pic:'12', desc:`Часник, кг`,	priceO:'',	disc:'XIT',	priceN:''},
  {pic:'11', desc:`Цибуля, кг`,	priceO:'',	disc:'XIT',	priceN:''},
  {pic:'10', desc:`Кефір "Галичина" 2.5%$900мл`,	priceO:'3200',	disc:'20%',	priceN:'2590'},
  {pic:'20', desc:`Йогурт "Млековіта" 2,5%$в асортименті$350г`, priceO:'2500',	disc:'25%',	priceN:'1900'},
  {pic:'18', desc:`Яйця курячі "Квочка"$10шт`,	priceO:'',	disc:'XIT',	priceN:'1790'},
  {pic:'9', desc:`Сосиски "Хот-Дог" ТМ”Глобино”$550г`,	priceO:'5200',	disc:'20%',	priceN:'4200'},
  {pic:'19', desc:`Ковбаса варена яловича$ТМ”Тульчин”$505г`,	priceO:'5900',	disc:'30%',	priceN:'3900'},
  {pic:'32', desc:`Вермішель "Роллтон"$в асортименті$60г`,	priceO:'600',	disc:'35%',	priceN:'400'},
  {pic:'17', desc:`Цукерки "Рошен"$в асортименті$145г`,	priceO:'5900',	disc:'15%',	priceN:'4900'},
  {pic:'6', desc:`Цукерки "Лафінель"$110г`,	priceO:'1700',	disc:'20%',	priceN:'1290'},
  {pic:'16', desc:`Вафельни трубочки "Жорік Обжорік" молочні$100г`,	priceO:'850',	disc:'20%',	priceN:'680'},
  {pic:'8', desc:`Макарони "Чумак" спіральки, вермішель$400г`, 	priceO:'2000',	disc:'25%',	priceN:'1500'},
  {pic:'30', desc:`Напій "Бон-Буассон"$в асортименті$2л`, priceO:'2700',	disc:'35%',	priceN:'1800'},
  {pic:'7', desc:`Суміш "Лімо" Овочева$в асортименті$100г`,	priceO:'730',	disc:'30%',	priceN:'530'},
  {pic:'3', desc:`Тунець "Ріо"$80г`,	priceO:'3700',	disc:'20%',	priceN:'2990'},
  {pic:'15', desc:`Оселедець "Укрриба"$шматочки філе в олії$450г`,	priceO:'4300',	disc:'25%',	priceN:'3300'},
  {pic:'21', desc:`Лаваш "Вірменський"$450г`,	priceO:'3900',	disc:'25%',	priceN:'3000'}
]