let dataVid = '10.08'
let dataDo = '31.08';
let base = [
{
    pic: '1',
    desc: `Торт "Вишнева фантазія"$100г`,
    disc: '35%',
    priceO: '1399',
    priceN: '899'
},
{
    pic: '9',
    desc: `Тістечко "Карамель"$100г`,
    disc: '45%',
    priceO: '1399',
    priceN: '770'
},
{
    pic: '11',
    desc: `Слойка "GRAND FOOD" з  полуницею$100г`,
    disc: '40%',
    priceO: '1099',
    priceN: '659'
},
{
    pic: '12',
    desc: `Рулетик з заварним кремом$90г`,
    disc: '45%',
    priceO: '699',
    priceN: '399'
},
{
    pic: '10',
    desc: `Хлібець "Пшеничний" вищий гатунок$500г`,
    disc: 'XIT',
    priceO: '',
    priceN: '999'
},
{
    pic: '23',
    desc: `Чіабатта$100г`,
    disc: '40%',
    priceO: '599',
    priceN: '359'
},
{
    pic: '13',
    desc: `Фарш свинно-яловичий$100г`,
    disc: '20%',
    priceO: '999',
    priceN: '799'
},
{
    pic: '27',
    desc: `Ошийок свинний охолоджений$100г`,
    disc: '20%',
    priceO: '1599',
    priceN: '1299'
},
{
    pic: '14',
    desc: `Шашлик свинний в маринаді$100г`,
    disc: '20%',
    priceO: '1499',
    priceN: '1199'
},
{
    pic: '20',
    desc: `Кавун`,
    disc: 'XIT',
    priceO: '',
    priceN: ''
},
{
    pic: '21',
    desc: `Виноград закарпатський`,
    disc: 'XIT',
    priceO: '',
    priceN: ''
},
{
    pic: '22',
    desc: `Гриби Шампіньйони`,
    disc: 'XIT',
    priceO: '',
    priceN: ''
},
{
    pic: '15',
    desc: `Морозиво "Ріжок" ТМ"Ласунка"$в асортименті$160г`,
    disc: '30%',
    priceO: '3485',
    priceN: '2435'
},
{
    pic: '17',
    desc: `Морозиво "Главхолод 100%"$ТМ"Три Ведмеді"$70г `,
    disc: '30%',
    priceO: '1219',
    priceN: '825'
},
{
    pic: '32',
    desc: `Сир кисломолочний 18%$ТМ "Ружно-молоко"$100г`,
    disc: '15%',
    priceO: '575',
    priceN: '485'
},
{
    pic: '2',
    desc: `Масло "Гайсинське"$вершкове селянське 73%$200г`,
    disc: 'XIT',
    priceO: '',
    priceN: '2399'
},
{
    pic: '7',
    desc: `Сметана "Ферма" 20%$350г`,
    disc: '15%',
    priceO: '2729',
    priceN: '2290'
},
{
    pic: '29',
    desc: `Ковбаса "Боярська" варена$ТМ "Світ мяса"$100г`,
    disc: '15%',
    priceO: '614',
    priceN: '530'
},
{
    pic: '8',
    desc: `Майонез "Щедро" Провансаль$на яєчних жовтках$350г`,
    disc: '30%',
    priceO: '2390',
    priceN: '1690'
},
{
    pic: '28',
    desc: `Кетчуп "Чумак"$до шашлику та лагідний$270г`,
    disc: '20%',
    priceO: '1399',
    priceN: '1099'
},
{
    pic: '19',
    desc: `Шоколад "Мілленіум"$чорний пористий$100г`,
    disc: '25%',
    priceO: '1999',
    priceN: '1499'
},
{
    pic: '6',
    desc: `Пиво "Туборг Грін"$0,5л`,
    disc: '35%',
    priceO: '2419',
    priceN: '1620'
},
{
    pic: '4',
    desc: `Пиво Крушовіце світле TM"ППБ"$0,5л   `,
    disc: '20%',
    priceO: '1990',
    priceN: '1590'
},
{
    pic: '16',
    desc: `Чіпси "Чіо"$в асортименті$150г`,
    disc: '30%',
    priceO: '4389',
    priceN: '3099'
},
{
    pic: '25',
    desc: `Набір фломастерів "Аналог"$12 кольорів`,
    disc: '20%',
    priceO: '1855',
    priceN: '1455'
},
{
    pic: '26',
    desc: `Зошит 18 аркушів$шт`,
    disc: '25%',
    priceO: '399',
    priceN: '299'
},
{
    pic: '24',
    desc: `Ручка "Cello" масляна$шт`,
    disc: '15%',
    priceO: '575',
    priceN: '475'
}
]