let dataVid='09.11'
let dataDo ='30.11';
let base = [
    {
        pic:"9",
        desc:'Торт "Венера"$100г',
        disc: "40%"	,
        priceO: "1349",
        priceN: "800",
        size: "1"
    },
    {
        pic:"10",
        desc:'Рулет "Творожний"$100г',
        disc: "40%"	,
        priceO: "1049",
        priceN: "650",
        size: "1"
    },
    {
        pic:"25",
        desc:'Тістечко "Кокосове"$1 шт',
        disc: "35%",
        priceO: "1599",
        priceN: "1050",
        size: "1"
    },
    {
        pic:"30",
        desc:'Пиріг$"Домашній з творогом"$500г',
        disc: "40%",
        priceO: "3999",
        priceN: "2500",
        size: "1"
    },
    {
        pic:"27",
        desc:'Пиріг$"Домашній з яблуком"$500г',
        disc: "35%",
        priceO: "2999",
        priceN: "1950",
        size: "1"
    },
    {
        pic:"40",
        desc:'Круасан "GRAND FOOD"$з шоколадною начинкою$100г',
        disc: "40%",
        priceO: "1099",
        priceN: "699",
        size: "1"
    },
    {
        pic:"26",
        desc:'Булочка$"Творожно-вишнева"$100г',
        disc: "40%",
        priceO: "649",
        priceN: "399",
        size: "1"
    },
    {
        pic:"28a",
        desc:'Булочка$"З висівками"$100г',
        disc: "40%",
        priceO: "499",
        priceN: "299",
        size: "1"
    },
    {
        pic:"8",
        desc:'Лангош$"GRAND FOOD"$250г',
        disc: "35%",
        priceO: "2999",
        priceN: "1990",
        size: "1"
    },
    {
        pic:"39",
        desc:'Лимони$кг',
        disc: "XIT",
        priceO: " ",
        priceN: " ",
        size: "1"
    },
    {
        pic:"38",
        desc:'Хурма$кг',
        disc: "XIT",
        priceO: " ",
        priceN: " ",
        size: "1"
    },
    {
        pic:"37",
        desc:'Ківі$кг',
        disc: "XIT",
        priceO: " ",
        priceN: " ",
        size: "1"
    },
    {
        pic:"35",
        desc:'Йогурт "Селянський" 2,5%$в асортименті$400мл',
        disc: "20%",
        priceO: "1794",
        priceN: "1394",        
        size: "1"
    },
    {
        pic:"45",
        desc:'Кефір "Ферма" 2,5%$900г',
        disc: "20%",
        priceO: "2754",
        priceN: "2254",
        size: "1"
    },
    {
        pic:"46",
        desc:'Сир "Російський" 50%$ТМ "Калинка"$100г',
        disc: "30%",
        priceO: "1570",
        priceN: "1070",
        size: "1"
    },
    {
        pic:"13",
        desc:'Масло селянське 73%$TM "Румо"$180г',
        disc: "15%",
        priceO: "3249",
        priceN: "2749",
        size: "1"
    },
    {
        pic:"31",
        desc:'Трубочки для молока$в асортименті$30г',
        disc: "20%",
        priceO: "1500",
        priceN: "1199",
        size: "1"
    },
    {
        pic:"33",
        desc:'Сирок "Малюк-ам"$глазурований$55г',
        disc: "25%",
        priceO: "1220",
        priceN: "920",
        size: "1"
    },
    {
        pic:"47",
        desc:'Сардельки "Бородинські"$TM "Бащинський"$100г',
        disc: "25%",
        priceO: "794",
        priceN: "580",
        size: "1"
    },
    {
        pic:"48",
        desc:'Ковбаса "Боярська" варена$ТМ "Світ мʼяса"$100г',
        disc: "15%",
        priceO: "609",
        priceN: "529",
        size: "1"
    },
    {
        pic:"49",
        desc:'Ковбаса "Салямі Банкетна"$ТМ "Глобино"$100г',
        disc: "30%",
        priceO: "1250",
        priceN: "890",
        size: "1"
    },
    {
        pic:"50",
        desc:`Ковбаса "М'ясна з шинкою"$ТМ "Глобино"$100г`,
        disc: "30%",
        priceO: "1259",
        priceN: "890",
        size: "1"
    },
    {
        pic:"44",
        desc:'Кілька "Балтійська"$пряного посолу$100г',
        disc: "20%",
        priceO: "520",
        priceN: "420",
        size: "1"
    },
    {
        pic:"18",
        desc:'Майонез "Чумак" апетитний$350г',
        disc: "25%",
        priceO: "1844",
        priceN: "1344",
        size: "1"
    },    
    {
        pic:"20",
        desc:'Вода мінеральна "Заповітна"$ТМ "Шаянська"$1,5л',
        disc: "25%",
        priceO: "1149",
        priceN: "849",
        size: "1"
    },    
    {
        pic:"15",
        desc:'Пиво "Туборг Грін"$0,5л',
        disc: "30%",
        priceO: "1964",
        priceN: "1364",
        size: "1"
    },
    {
        pic:"16",
        desc:'Пиво "Полтава"$ТМ "Ячмінний колос"$0,5л',
        disc: "30%",
        priceO: "1799",
        priceN: "1299",
        size: "1"
    },
    {
        pic:"42",
        desc:'Зефір "Біло-рожевий"$TM "Родина"$100г',
        disc: "20%",
        priceO: "579",
        priceN: "449",
        size: "1"
    },
    {
        pic:"32",
        desc:'Шоколад "Мілленіум" пористий$100г',
        disc: "35%",
        priceO: "1999",
        priceN: "1299",
        size: "1"
    },    
    {
        pic:"24",
        desc:'Печиво "Біскотті"$кіфлики пісочні$100г',
        disc: "20%",
        priceO: "846",
        priceN: "669",
        size: "1"
    },
    {
        pic:"14",
        desc:'Паштет "Пріват"$105г',
        disc: "20%",
        priceO: "1654",
        priceN: "1349",
        size: "1"
    },
    {
        pic:"19",
        desc:'Чай "Ловаре" в пакетиках$1,5гx24шт',
        disc: "25%",
        priceO: "4299",
        priceN: "3299",
        size: "1"
    },
    {
        pic:"41",
        desc:'Крупа гречана "Хатинка"$100г',
        disc: "25%",
        priceO: "164",
        priceN: "124",
        size: "1"
    },
    {
        pic: "43",
        desc: 'Каша "АХА" вівсяна$в асортименті$40г',
        disc: "30%",
        priceO: "1019",
        priceN: "719",
        size: "1"
    },
    {
        pic:"36",
        desc:'Суміш "Лімо" Весняна$100г',
        disc: "25%",
        priceO: "656",
        priceN: "486",
        size: "1"
    },
    {
        pic:"22",
        desc:'Бальзам кінський для тіла$TM"Лорін" в асортименті$500мл',
        disc: "15%",
        priceO: "5699",
        priceN: "4799",
        size: "1"
    },
    {
        pic:"21",
        desc:'Губки кухонні$TM "Гаряча господарочка"$упаковка (5шт)',
        disc: "25%",
        priceO: "1487",
        priceN: "1087",
        size: "1"
    },
    {
        pic:"23",
        desc:'Серветки віскозні 30х36$TM "Гаряча господарочка"$упаковка (3шт)',
        disc: "25%",
        priceO: "1487",
        priceN: "1087",
        size: "1"
    },
    {
        pic:"34",
        desc:'Пакети для сміття 35л$ТМ "Гаряча господарочка"$упаковка (30шт)',
        disc: "25%",
        priceO: "1579",
        priceN: "1179",
        size: "1"
    },
    {
        pic:"7",
        desc:'Ковбаса свинна охолоджена$100г',
        disc: "25%"	,
        priceO: "1240",
        priceN: "949",
        size: "1"
    },
    {
        pic:"5",
        desc:'Ковбаса свинна запечена$100г',
        disc: "40%"	,
        priceO: "2149",
        priceN: "1289",
        size: "1"
    },
    {
        pic:"6",
        desc:'Ковбаса "Пікниця" свинна сирокопчена$100г',
        disc: "20%"	,
        priceO: "1599",
        priceN: "1249",
        size: "1"
    },
    {
        pic:"11",
        desc:'Лопатка свинна охолоджена$100г',
        disc: "20%"	,
        priceO: "1399",
        priceN: "1099",
        size: "1"
    },
    {
        pic:"4",
        desc:'Крило куряче гриль$100г',
        disc: "25%"	,
        priceO: "1299",
        priceN: "999",
        size: "1"
    },
    {
        pic:"12",
        desc:'Фарш асорті (свинно-яловичий) охолоджений$100г',
        disc: "15%",
        priceO: "999",
        priceN: "849",
        size: "1"
    },
    {
        pic:"3",
        desc:'Салат "По-Мукачівськи"$100г',
        disc: "40%"	,
        priceO: "1149",
        priceN: "699",
        size: "1"
    },
    {
        pic:"1",
        desc:'Хек смажений$100г',
        disc: "40%"	,
        priceO: "1499",
        priceN: "899",
        size: "1"
    },
    {
        pic:"2",
        desc:'Салат "Буряк маринований з хріном"$100г',
        disc: "40%",
        priceO: "599",
        priceN: "349",
        size: "1"
    }
]