let dataVid = '15.11'
let dataDo = '05.12';
let base = [
    
    {pic:"24", desc: `Торт "Баунті"$100г`, disc:'50%', priceO :'1600', priceN:'800'},
    {pic:"20", desc: `Пиріг яблучний пісний$100г`, disc:'50%', priceO :'1000', priceN:'500'},
    {pic:"9", desc: `Круасан "GRAND FOOD" з повидлом$100г`, disc: `50%`, priceO :'1100', priceN:'550'},
    {pic:"23", desc: `Булочка з сливою;$90г`, disc:'50%', priceO :'600', priceN:'300'},
    {pic:"22", desc: `Булочка сезамова$80г`, disc:'50%', priceO :'550', priceN:'275'},    
    {pic:"21", desc: `Печиво з арахісом$100г`, disc:'50%', priceO :'900', priceN:'450'},
    {pic:"25", desc: `Пиріжки з квашеною капустою$150г`, disc:'50%', priceO :'1000', priceN:'500'},   
    {pic:"19", desc: `Паніні "GRAND FOOD"$в асортименті$200г`, disc:'45%', priceO :'2500', priceN:'1400'},
    {pic:"5", desc: `Гурка$100г`, disc:'40%', priceO :'1100', priceN:'660'},
    {pic:"8", desc: `Салат "Вінігрет овочевий"$100г`, disc:'50%', priceO :'800', priceN:'400'},
    {pic:"6", desc: `Курча гриль$100г`, disc:'35%', priceO :'1300', priceN:'850'},
    {pic:"4", desc: `Фарш асорті (свинно-яловичий) охолоджений$100г`, disc:'20%', priceO :'1000', priceN:'800'},
  {pic:"14", desc: `Яблука`, disc:'XIT', priceO :' ', priceN:' '},
  {pic:"27", desc: `Капуста`, disc:'XIT', priceO :'  ', priceN:'  '},
  {pic:"26", desc: `Картопля`, disc:'XIT', priceO :'  ', priceN:'  '},
  {pic:"13", desc: `Сир "Голландський"$ТМ "Канів"$100г`, disc:'20%', priceO :'2400', priceN:'1890'},
  {pic:"17", desc: `Сметанка ТМ"Моліка" 25%$400г`, disc:'15%', priceO :'1500', priceN: '1300'},
  {pic:"15", desc: `Йогурт "Растішка" 2%$ТМ "Данон"$115г`, disc:'30%', priceO :'700', priceN:'1300'},
  {pic:"12", desc: `Ковбаса "Фірмова з телятини" варена TM"Тульчин"$505г`, disc:'25%', priceO :'4800', priceN:'3500'},
  {pic:"16", desc: `Ковбаса "Боярська" варена$TM "Світ Мяса"$100г `, disc:'10%', priceO :'640', priceN:'570'},
  {pic:"30", desc: `Оселедець "Балтійський"$100г`, disc:'15%', priceO :'650', priceN:'540'},
  {pic:"1", desc: `Кава "Форт" Еліт мелена$225г`, disc:'10%', priceO :'3300', priceN:'2900'},
  {pic:"7", desc: `Жувальні цукерки-асорті МАМВА$79,5г`, disc:'25%', priceO :'2800', priceN:'1800'},
  {pic:"3b", desc: `Печиво здобне збивне "Деліція"$зі смаком вишні$100г`, disc:'25%', priceO :'900', priceN:'690'},
  {pic:"29", desc: `Цукерки глазуровані "Біла ромашка" TM "ЖЛ"$100г`, disc:'20%', priceO :'1100', priceN:'690'},
  {pic:"18", desc: `Приправа універсальна "12 овочів і трав" в гранулах Деко 170г`, disc:'20%', priceO :'3000', priceN:'2000'},
  {pic:"10", desc: `Каша "АХА" вівсяна$в асортиментi$40г`, disc:'15%', priceO :'1100', priceN:'800'},
  {pic:"28", desc: `Пиво Туборг "Грін"$0,5л`, disc:'30%', priceO :'2000', priceN:'1400'},
  {pic:"11", desc: `Сік "Соки України"$виногр/ябл./мультивітамін$1л`, disc:'30%', priceO :'2000', priceN:'1400'},
  {pic:"2", desc: `Hапій "Оболонь" Живчик$Яблуко, Апельсин$2л`, disc:'25%', priceO :'2600', priceN:'1900'}
  
    
]