let dataVid = '18.12'
let dataDo = '10.01';
let base = [
    // {size:"rozd", pic:'0', desc: ` `, disc: " " priceO: " ", priceN: " "},
    // {pic: '14', desc:`Корейка свинна$100г`, disc:'20%' priceO:'1390', priceN:'1120'},

{pic:'55a', desc: `Торт "Іриска"$100г`, disc:'35%', priceO:'1550', priceN:'1000'},
{pic:'32', desc: `Рулет "Шоколадне поліно"$100г`, disc:'30%', priceO:'1400', priceN:'1000'},
{pic:'31', desc: `Торт "Графський"$100г`, disc:'35%', priceO:'1650', priceN:'1000'},

{pic:'48', desc: `Круасан "GRAND FOOD" з шоколадною начинкою$100г`, disc:'35%', priceO:'1200', priceN:'800'},
{pic:'52a', desc: `Слойка "GRAND FOOD" з полуницею$100г`, disc:'35%', priceO:'1100', priceN:'700'},
{pic:'57', desc: `Багет$250г`, disc:'30%', priceO:'790', priceN:'590'},

{pic:'56', desc: `Хлібець "Заварний"$400г`, disc:'30%', priceO:'1800', priceN:'1200'},
{pic:'58', desc: `Хлібець "Пшеничний"$400г`, disc:'30%', priceO:'1400', priceN:'1000'},
{pic:'50', desc: `Круасан "GRAND FOOD" гурман$200г`, disc:'20%', priceO:'2000', priceN:'1600'},

{pic:'36', desc: `Пельмені$100г`, disc:'40%', priceO:'799', priceN:'479'},
{pic:'1', desc: `Ікра "Сахалінская" лососева зерниста$140г`, disc:'25%', priceO:'10000', priceN:'7500'},
{pic:'59', desc: `Hапій "Кока-кола"$2л`, disc:'25%', priceO:'3300', priceN:'2500'},


{size:"rozd", pic:'0', desc: ` `, disc: " ", priceO: " ", priceN: " "},


{pic:'42', desc: `Мандарин`, disc:'XIT', priceO:'', priceN:''},
{pic:'39', desc: `Апельсин`, disc:'XIT', priceO:'', priceN:''},
{pic:'29', desc: `Масло "Галичина" селянське 72,6% 200г`, disc:'20%', priceO:'5200', priceN:'4200'},
{pic:'41', desc: `Сир кисломолочний ТМ"Ружин-молоко" 18%$100г`, disc:'20%', priceO:'650', priceN:'545'},

{pic:'40', desc: `Сир плавлений "Ферма"$в асортименті$90г`, disc:'25%', priceO:'1600', priceN:'1190'},
{pic:'28', desc: `Сир "Брест-Литовськ" класичний,голландський 45%$200г`, disc:'25%', priceO:'5900', priceN:'4500'},
{pic:'38', desc: `Сир "Королівський" (Польща)$100г`, disc:'30%', priceO:'2360', priceN:'1920'},
{pic:'37', desc: `Сир "Голландський","Російський" ТМ"Охтирка"$100г`, disc:'25%', priceO:'1390', priceN:'1090'},

{pic:'24', desc: `Сметана "Президент" 20%$350г`, disc:'25%', priceO:'3790', priceN:'2990'},
{pic:'23', desc: `Приправа "Деко" 12 овочів$170г`, disc:'30%', priceO:'3290', priceN:'2290'},
{pic:'22', desc: `Перець "Любисток" пекельний$мелений, горошок$20г`, disc:'30%', priceO:'800', priceN:'550'},
{pic:'13', desc: `Грінки "Герчак" міні тости святкові$140г`, disc:'25%', priceO:'2000', priceN:'1490'},

{pic:'19', desc: `Майонез "Щедро" Провансаль Преміум 72%$350г`, disc:'30%', priceO:'2790', priceN:'1990'},
{pic:'20', desc: `Гірчиця, Хрін "Верес"$в асортименті$130г`, disc:'30%', priceO:'1250', priceN:'850'},
{pic:'3', desc: `Кукурудза "Все Світ" цукрова$425г`, disc:'20%', priceO:'1690', priceN:'1390'},
{pic:'5', desc: `Асорті овочеве "Давтона"$510г`, disc:'25%', priceO:'3990', priceN:'3090'},
{pic:'4', desc: `Гриби "Еко Світ" шампіньйони $480мл`, disc:'25%', priceO:'4500', priceN:'3490'},
{pic:'30', desc: `Крабові палочки "Санта Бремор" салатні морожені$200г`, disc:'30%', priceO:'2390', priceN:'1690'},

{pic:'27', desc: `Сьомга "Флотилія" філе шматок$130г`, disc:'30%', priceO:'9000', priceN:'6500'},
{pic:'26', desc: `М"ясо креветки "Веладіс"$$400г`, disc:'25%', priceO:'19000', priceN:'14300'},
{pic:'33', desc: `Оселедець "Океан" в олії$450г`, disc:'25%', priceO:'5700', priceN:'4350'},
{pic:'61', desc: `Ковбаса "Боярська" ТМ"Світ мяса"$100г`, disc:'20%', priceO:'600', priceN:'480'},
{pic:'62', desc: `Ковбаса "Баварська" ТМ"Ходорів МК"$100г`, disc:'25%', priceO:'1790', priceN:'1390'},
{pic:'63', desc: `Грудинка "Українська"$ТМ"Бащинка"$100г`, disc:'20%', priceO:'2230', priceN:'1790'},

{pic:'2', desc: `Мінеральна вода "Маргіт" Лужанська-7$1,5л`, disc:'25%', priceO:'1290', priceN:'990'},
{pic:'6', desc: `Сік "Сандора" Садочок$виноградно-яблучний, мультифрукт$1л`, disc:'25%', priceO:'2790', priceN:'2090'},
{pic:'7', desc: `Вино "Вілла Крім" Мускат рожеве$0,75л`, disc:'25%', priceO:'6900', priceN:'5300'},
{pic:'8', desc: `Шампанське "Болград" классік біле$0,75л`, disc:'20%', priceO:'11000', priceN:'8900'},

{pic:'10', desc: `Коньяк "Закарпатський" 4*$0.5л `, disc:'15%', priceO:'19200', priceN:'16200'},
{pic:'60', desc: `Віскі "Джемесон" ірландський$0,7л`, disc:'20%', priceO:'59000', priceN:'46900'},
{pic:'9', desc: `Горілка "Гетьман"$0,5л `, disc:'20%', priceO:'11200', priceN:'8990'},
{pic:'11', desc: `Горілкака "Абсолют"$0,5л`, disc:'20%', priceO:'23000', priceN:'18400'},

{pic:'15', desc: `Пудинг "Др Еткер"$ванільний, вершковий$40г`, disc:'35%', priceO:'1190', priceN:'790'},
{pic:'14', desc: `Цукерки "Тоффіфе"$125г`, disc:'25%', priceO:'7990', priceN:'5990'},
{pic:'25', desc: `Цукерки ТМ"Аметист" Прометей, Метеорит$100г`, disc:'30%', priceO:'1500', priceN:'1100'},
{pic:'21', desc: `Шоколад "Студентска"$180г`, disc:'20%', priceO:'4550', priceN:'3650'},

{pic:'12', desc: `Серветки "Рута" новорічні$20шт`, disc:'25%', priceO:'2300', priceN:'1750'},
{pic:'17', desc: `Рукав "ФрекенБок" для запікання$3м`, disc:'35%', priceO:'2390', priceN:'1590'},
{pic:'18', desc: `Пергамент "ФрекенБок" для випікання$5м`, disc:'30%', priceO:'2990', priceN:'2090'},
{pic:'16', desc: `Фольга "ФрекенБок" алюмінієва універсальна$10м`, disc:'30%', priceO:'4190', priceN:'2990'},

{size:"rozd", pic:'0', desc: ` `, disc: " ", priceO: " ", priceN: " "},

{pic:'45a', desc: `Рулет курячий рублений$100г`, disc:'20%', priceO:'1599', priceN:'1279'},
{pic:'47', desc: `Cтегно куряче запечене$100г`, disc:'20%', priceO:'1299', priceN:'1039'},
{pic:'51', desc: `Четвертина куряча запечена$100г`, disc:'20%', priceO:'1299', priceN:'1039'},

{pic:'54', desc: `Лопатка свинна охолодженна$100г`, disc:'15%', priceO:'1099', priceN:'929'},
{pic:'53', desc: `Фарш асорті (свинно-яловичий) охолоджений$100г`, disc:'20%', priceO:'1199', priceN:'959'},
{pic:'46a', desc: `Ошийок свинний$100г`, disc:'10%', priceO:'1399', priceN:'1259'},

{pic:'49', desc: `Стегно куряче охолоджене$100г`, disc:'15%', priceO:'799', priceN:'679'},
{pic:'44', desc: `Крило куряче охолоджене$100г`, disc:'20%', priceO:'599', priceN:'480'},
{pic:'64', desc: `Шлунок телячий (рубець)$100г`, disc:'15%', priceO:'799', priceN:'679'},

{pic:'35', desc: `Салат "Буряк маринований з хріном"$450г`, disc:'20%', priceO:'2990', priceN:'2400'},
{pic:'34', desc: `Салат "Морква по корейськи"$450г`, disc:'20%', priceO:'2490', priceN:'2000'},
{pic:'65', desc: `Тісто "GRAND FOOD" листкове прісне$500г`, disc:'25%', priceO:'3000', priceN:'2300'},

]