let dataVid = '09.03'
let dataDo = '30.03';
let base = [
    //     {    
    //         pic: "19",
    //         desc: `Печиво "З арахісом"$пісне$100г`,
    //         disc: "40%",
    //         priceO: "949",
    //         priceN: "599"
    //     },
    // {    
    //     pic: "14",
    //     desc: `Пряник "Деліція"$Ворзельский пісний$100г`,
    //     disc: "25%",
    //     priceO: "685",
    //     priceN: "519"
    // },
    // {    
    //     pic: "13",
    //     desc: `Халва "Дружківська"$ванільна$200г`,
    //     disc: "25%",
    //     priceO: "1549",
    //     priceN: "1159"
    // },
    // {    
    //     pic: "15",
    //     desc: `Цукерки желейні$"Шалена бджілка"$100г`,
    //     disc: "20%",
    //     priceO: "820",
    //     priceN: "655"
    // },

    //     {
    //     pic: "20",
    //     desc: `Майонез "Чумак" пісний$160г`,
    //     disc: "30%",
    //     priceO: "945",
    //     priceN: "679"}
    //     ,
    // {    
    //     pic: "12",
    //     desc: `Сардина "ІРФ"$натурадьна$230г`,
    //     disc: "20%",
    //     priceO: "2499",
    //     priceN: "1999"
    // },
    // {    
    //     pic: "22a",
    //     desc: `Оселедець "Океан"$філе в олії$200г`,
    //     disc: "25%",
    //     priceO: "2499",
    //     priceN: "1899"
    // },
    // {    
    //     pic: "22",
    //     desc: `Хек тушка$заморожений$100г`,
    //     disc: "20%",
    //     priceO: "840",
    //     priceN: "680"
    // },
    // {    
    //     pic: "23",
    //     desc: `Кефір "Галичина" 2.5%$900мл`,
    //     disc: "XIT",
    //     priceO: " ",
    //     priceN: "2399"
    // },
    // {
    //     pic: "28",
    //     desc: `Йогурт "Локо-Моко" 1,5%$в асортименті$115г`,
    //     disc: "25%",
    //     priceO: "899",
    //     priceN: "699"}
    //     ,
    // {    
    //     pic: "7",
    //     desc: `Нагетси "Легко" фігурні$100г`,
    //     disc: "20%",
    //     priceO: "565",
    //     priceN: "465"
    // },
    // {    
    //     pic: "5",
    //     desc: `Пиво "Гараж" антикомпот$0,5л`,
    //     disc: "30%",
    //     priceO: "2259",
    //     priceN: "1649"
    // },

    // {    
    //     pic: "11",
    //     desc: `Шампіньйони "Щедрий фермер" цілі$314мл`,
    //     disc: "20%",
    //     priceO: "3500",
    //     priceN: "2800"
    // },
    // {    
    //     pic: "16",
    //     desc: `Крупа "Красуня" булгур$400г`,
    //     disc: "20%",
    //     priceO: "1849",
    //     priceN: "1449"
    // },
    //     {
    //     pic: "24",
    //     desc: `Морква`,
    //     disc: "XIT",
    //     priceO: " ",
    //     priceN: " "
    // },
    //     {
    //     pic: "25",
    //     desc: `Буряк`,
    //     disc: "XIT",
    //     priceO: "",
    //     priceN: ""
    // }
    //,   
    {
        pic: "26",
        desc: `Торт "Снікерс"$100г`,
        disc: "30%",
        priceO: "1199",
        priceN: "849"
    },
    {
        pic: "6",
        desc: `Торт "Квіточка"$100г`,
        disc: "35%",
        priceO: "1549",
        priceN: "999"
    },
    {
        pic: "10",
        desc: `Пиріг "Яблучний" пісний$100г`,
        disc: "25%",
        priceO: "799",
        priceN: "599"
    },
    {
        pic: "8",
        desc: `Булочка "Бананова"$90г`,
        disc: "35%",
        priceO: "599",
        priceN: "399"
    },
    {
        pic: "9",
        desc: `Слойка "GRAND FOOD"$з сливою та горіхом"$110г`,
        disc: "35%",
        priceO: "1199",
        priceN: "799"
    },
    {
        pic: "17",
        desc: `Тіcnечко "Картошка"$75г`,
        disc: "40%",
        priceO: "799",
        priceN: "499"
    },
    {
        pic: "3",
        desc: `Салат "Вінегрет овочевий"$100г`,
        disc: "45%",
        priceO: "699",
        priceN: "385"
    },
    {
        pic: "27",
        desc: `Хек тушений в овочах$100г`,
        disc: "40%",
        priceO: "999",
        priceN: "599"
    },
    {
        pic: "2",
        desc: `Квасоля "По-Закарпатськи"$100г`,
        disc: "40%",
        priceO: "649",
        priceN: "389"
    },
    {
        pic: "4",
        desc: `Фарш асорті (свинно-яловичий) охолоджений$100г`,
        disc: "XIT",
        priceO: "",
        priceN: "849"
    },
    {
        pic: "18",
        desc: `Багет "GRAND FOOD"$з мисливською ковбасою$230г`,
        disc: "40%",
        priceO: "2499",
        priceN: "1499"
    },
    {
        pic: "1",
        desc: `Четвертина куряча охолоджена$100г`,
        disc: "20%",
        priceO: "519",
        priceN: "415"
    }

]