    let dataVid = '10.04'
    let dataDo = '31.04';
    let base = [{
            desc: `Сир "Російський"$"Голландський" /Охтирка/$100г`,
            pic: "50",
            disc: "25%",
            priceO: "1244",
            priceN: "940"
        },
        {
            desc: `Сир "Королівський"$100г`,
            pic: "50",
            disc: "15%",
            priceO: "2129",
            priceN: "1800"
        },
        {
            desc: `Сир "Фета" Преміаль$250г`,
            pic: "45",
            disc: "20%",
            priceO: "4599",
            priceN: "3599"
        },
        {
            desc: `Сир кисломолочний$"Ружин-молоко" 18%$100г`,
            pic: "32",
            disc: "15%",
            priceO: "590",
            priceN: "490"
        },
        {
            desc: `Сир плавлений "Ферма"$в асортименті$90г`,
            pic: "39",
            disc: "20%",
            priceO: "1449",
            priceN: "1149"
        },
        {
            desc: `Сметана "Президент" 20%$350г`,
            pic: "37",
            disc: "25%",
            priceO: "3599",
            priceN: "2700"
        },
        {
            desc: `Масло "Гайсинське"$солодковершкове 73%$200г`,
            pic: "22",
            disc: "20%",
            priceO: "2790",
            priceN: "2290"
        },
        {
            desc: `Шоколад "Кіндер-сюрприз"$20г`,
            pic: "16",
            disc: "XIT",
            priceO: "3024",
            priceN: "000"
        },
        {
            desc: `Цукерки "Конті" Амур$205г`,
            pic: "38",
            disc: "20%",
            priceO: "6875",
            priceN: "5575"
        },
        {
            desc: `Цукерки "АВК" Флоренс$в асортименті$100г`,
            pic: "31",
            disc: "25%",
            priceO: "10300",
            priceN: "7900"
        },
        {
            desc: `Шоколад "Альпінелла"$в асортименті$90г `,
            pic: "17",
            disc: "15%",
            priceO: "1674",
            priceN: "1399"
        },
        {
            desc: `Печиво"Трой" сендвіч$в асортименті$240г  `,
            pic: "20",
            disc: "20%",
            priceO: "3199",
            priceN: "2599"
        },
        {
            desc: `Окорок "Святковий"$TM "Світ мяса"$100г`,
            pic: "0",
            disc: "20%",
            priceO: "1450",
            priceN: "1150"
        },
        {
            desc: `Ковбаса "Салямі варена"$ТM"Глобино"$???г`,
            pic: "0",
            disc: "25%",
            priceO: "4300",
            priceN: "3300"
        },
        {
            desc: `Ковбаса "?????"$100г`,
            pic: "0",
            disc: "15%",
            priceO: "1430",
            priceN: "1190"
        },
        {
            desc: `Ковбаса "Баварська"$TM"Родина"$100г`,
            pic: "0",
            disc: "15%",
            priceO: "1199",
            priceN: "990"
        },
        {
            desc: `Крабові палочки "Економ"$200г`,
            pic: "44",
            disc: "20%",
            priceO: "1799",
            priceN: "1399"
        },
        {
            desc: `Окорок "Світ м'яса" 100г`,
            pic: "0",
            disc: "??%",
            priceO: "??,??",
            priceN : "??,??"
        },
        {
            desc: `Філе оселедця "Матіас"$оригінальне п/у$250г`,
            pic: "19",
            disc: "20%",
            priceO: "4890",
            priceN: "3890"
        },
        {
            desc: `Скумбрія$холодного копчення$100г`,
            pic: "33",
            disc: "15%",
            priceO: "1550",
            priceN: "1320"
        },
        {
            desc: `Кукурудза "Екоол" цукрова$340г`,
            pic: "13",
            disc: "20%",
            priceO: "1799",
            priceN: "1450"
        },
        {
            desc: `Асорті овочеве "Ямар"$(морква, горошок,кукурудза)$470г`,
            pic: "11",
            disc: "20%",
            priceO: "3400",
            priceN: "2799"
        },
        {
            desc: `Гірчиця "Верес"$в асортименті$140г`,
            pic: "4",
            disc: "25%",
            priceO: "1140",
            priceN: "840"
        },
        {
            desc: `Хрін "Верес"$в асортименті$190г`,
            pic: "12",
            disc: "20%",
            priceO: "1645",
            priceN: "1285"
        },
        {
            desc: `Кетчуп "Чумак"$лагідний та до шашлику$270г`,
            pic: "42",
            disc: "30%",
            priceO: "1445",
            priceN: "1045"
        },
        {
            desc: `Майонез "Щедро"$Провансаль Преміум 72%$350г            `,
            pic: "18",
            disc: "20%",
            priceO: "1899",
            priceN: "1499"
        },
        {
            desc: `Вода мінеральна"Свалявська"$1,5л`,
            pic: "14",
            disc: "25%",
            priceO: "934",
            priceN: "700"
        },
        {
            desc: `Hапій "Пепсі"$2л`,
            pic: "15",
            disc: "25%",
            priceO: "3100",
            priceN: "2400"
        },
        {
            desc: `Сік "Драгун"$Осінній смак 100%$3л`,
            pic: "46",
            disc: "15%",
            priceO: "6900",
            priceN: "5900"
        },
        {
            desc: `Коньяк "Закарпатський" 4*$0.5л`,
            pic: "2",
            disc: "XIT",
            priceO: "17094",
            priceN: "14994"
        },
        {
            desc: `Вино "Вілла Крім"$Мускат рожеве$0,75л`,
            pic: "3",
            disc: "20%",
            priceO: "6800",
            priceN: "5300"
        },
        {
            desc: `Горілка "Президент" 40%$в асортименті$0,5л`,
            pic: "30",
            disc: "??%",
            priceO: "8949",
            priceN: "8949"
        },
        {
            desc: `Пиво "Гамбрінус" оригінал$0,5л`,
            pic: "41",
            disc: "20%",
            priceO: "2499",
            priceN: "1999"
        },
        {
            desc: `Пиво "Карлсберг"$0.5л`,
            pic: "42",
            disc: "20%",
            priceO: "2124",
            priceN: "1649"
        },
        {
            desc: `Фольга "Фрекен Бок"$стандарт алюмінієва$10м`,
            pic: "21",
            disc: "25%",
            priceO: "3729",
            priceN: "2729"
        },
        {
            desc: `Серветки "Рута" Пасхальні$40шт`,
            pic: "43",
            disc: "25%",
            priceO: "1899",
            priceN: "1399"
        },
        {
            desc: `Засіб д/миття посуду "Джаст"$в асортименті$500мл`,
            pic: "6",
            disc: "15%",
            priceO: "2399",
            priceN: "1999"
        },
        {
            desc: `Паска$400г`,
            pic: "23",
            disc: "ХІТ",
            priceO:"",
            priceN:"4999"
        },
        {
            desc: `Пиріг "Домашній з творогом"$500г`,
            pic: "7",
            disc: "30%",
            priceO: "4999",
            priceN: "3499"
        },
        {
            desc: `Слойка "GRAND FOOD"$з творогом та родзинками"$100г`,
            pic: "24",
            disc: "35%",
            priceO: "1099",
            priceN: "749"
        },
        {
            desc: `Торт"Лимонно-маковий"$100г`,
            pic: "35",
            disc: "30%",
            priceO: "1299",
            priceN: "899"
        },
        {
            desc: `Торт"Марленка"$100г`,
            pic: "36",
            disc: "30%",
            priceO: "1249",
            priceN: "899"
        },
        {
            desc: `Рулет "З курагою"$100г`,
            pic: "34",
            disc: "30%",
            priceO: "1199",
            priceN: "849"
        },
        {
            desc: `Салат "Увертюра" пісний$100г`,
            pic: "10",
            disc: "40%",
            priceO: "999",
            priceN: "599"
        },
        {
            desc: `Картопля по селянськи$100г`,
            pic: "9",
            disc: "30%",
            priceO: "499",
            priceN: "349"
        },
        {
            desc: `Шашлик "По-селянськи" свинний$100г`,
            pic: "8",
            disc: "15%",
            priceO: "1499",
            priceN: "1299"
        },
        {
            desc: `Гомілки курячі запечені$100г`,
            pic: "25",
            disc: "40%",
            priceO: "1699",
            priceN: "999"
        },
        {
            desc: `Папрікашка$100г`,
            pic: "28",
            disc: "40%",
            priceO: "1649",
            priceN: "999"
        },
        {
            desc: `Ковбаса Пікниця свинна сирокопчена$100г`,
            pic: "27",
            disc: "25%",
            priceO: "1499",
            priceN: "1099"
        },
        {
            desc: `Фарш свинний охолоджений$100г`,
            pic: "1",
            disc: "15%",
            priceO: "1049",
            priceN: "899"
        },
        {
            desc: `Гомілка курячат бройлерів охолоджена$100г`,
            pic: "29",
            disc: "хіт",
            priceO: "549",
            priceN: "499"
        },
        {
            desc: `Корейка свинна охолоджена$100г`,
            pic: "26",
            disc: "15%",
            priceO: "1499",
            priceN: "1249"
        }
    ]