let dataVid = '17.09'
let dataDo = '05.10';
let base = [  

    {pic:"29", desc: `Слойка "GRAND FOOD" з вишнею 100г`, disc: "40%", priceO: "1200", priceN: "700"},
    {pic:"12", desc: `Круасан "GRAND FOOD" зі згущеним молоком/з повидлом$100г`, disc: "45%", priceO: "1300", priceN: "700"},
    {pic:"10", desc: `Торт "Тіраміссу"$100г`, disc: "40%", priceO: "1600", priceN: "960"},
    {pic:"11", desc: `Торт "Марленка"$100г`, disc: "30%", priceO: "1400", priceN: "990"},

    {pic:"9", desc: `Печиво "Медовая пахлава"$100г`, disc: "30%", priceO: "1300", priceN: "990"},
    {pic:"38", desc: `Булочка "Творожно-вишнева"$100г`, disc: "40%", priceO: "900", priceN: "540"},
    {pic:"30", desc: `Булочка "З кетчупом та сиром"$80г`, disc: "40%", priceO: "700", priceN: "450"},
    {pic:"31", desc: `Міні багет "По домашньому"$200г`, disc: "40%", priceO: "1500", priceN: "900"}, 

    {pic:"32", desc: `Хліб Бездріжджовий "Гречаний" подовий$400г`, disc: "35%", priceO: "1990", priceN: "1290"},
    {pic:"34", desc: `Cухарі панірувальні$500г`, disc: "45%", priceO: "1599", priceN: "890"},
    {pic:"36", desc: `Сухарі здобні$100г`, disc: "40%", priceO: "299", priceN: "179"},
    {pic:"35", desc: `Сухарі прісні$100г`, disc: "50%", priceO: "250", priceN: "129"},

    {pic:"33", desc: `Багет "GRAND FOOD" в асортименті 230г`, disc: "25%", priceO: "2500", priceN: "1900"},
    {pic:"14", desc: `Капуста квашена білокачанна з морквою$100г`, disc: "50%", priceO: "199", priceN: "099"},    
    {pic:"39", desc: `Гомілка/cтегенце/крило/четвертина куряча запечена 100г`, disc: "35%", priceO: "1299", priceN: "844"},
    {pic:"16", desc: `Ковбаса "Пікниця" сирокопчена 100г`, disc: "45%", priceO: "1799", priceN: "999"},
    
    {pic:"19", desc: `Фарш свинний/свинно-яловичий$100г`, disc: "25%", priceO: "1199", priceN: "899"},
    {pic:"8", desc: `Рагу свинне охолоджене$100г`, disc: "45%", priceO: "299", priceN: "165"},
    {pic:"18", desc: `Гомілка куряча охолоджена$100г`, disc: "25%", priceO: "599", priceN: "449"},
    {pic:"7", desc: `Гомілка індича охолоджена$100г`, disc: "25%", priceO: "599", priceN: "449"},
    {pic:"37", desc: `Грінки$100г`, disc: "40%", priceO: "2999", priceN: "1790"},

    {size:"rozd", pic:"0", desc: ` `, disc: " ", priceO: " ", priceN: " "},
    
    {pic:"15", desc: `Морква, кг`, disc: "XIT", priceO: " ", priceN: " "},
    {pic:"21", desc: `Картопля, кг`, disc: "XIT", priceO: " ", priceN: " "},
    {pic:"13", desc: `Цибуля, кг`, disc: "XIT", priceO: " ", priceN: " "},
    {pic:"1", desc: `Морозиво "Ескімо" TM"Ласка"$65г`, disc: "45%", priceO: "1400", priceN: "890"},
    {pic:"3", desc: `Йогурт "Савушкин Продукт" Оптималь в асортименті 2%$415г`, disc: "30%", priceO: "2750", priceN: "1990"},
    {pic:"23", desc: `Кефір "Ферма" 2.5%$840г`, disc: "25%", priceO: "3200", priceN: "2400"},
    {pic:"5", desc: `Сир "Млекпол" Ліліпут$350г`, disc: "15%", priceO: "7500", priceN: "6190"},
    {pic:"0", desc: `Закуска "Тульчинка" Смаколики з сиром шашлична$90г`, disc: "25%", priceO: "1290", priceN: "990"},
    {pic:"24", desc: `Гумка жувальна Ментос PUREFRESH тутті-фруті, мята$15,57г`, disc: "25%", priceO: "1290", priceN: "990"},
    {pic:"20", desc: `Зефір "Біло-рожевий" TM"Родина"$100г`, disc: "20%", priceO: "599", priceN: "480"},
    {pic:"22", desc: `Цукерки "Ромашка" ТМ"Рошен"$100г`, disc: "20%", priceO: "1150", priceN: "899"},
    {pic:"6", desc: `Крупа "Хатинка" рис круглозернистий$750г`, disc: "20%", priceO: "2900", priceN: "2390"},
    {pic:"25", desc: `Пельмені "Смаком" свинина$800г`, disc: "35%", priceO: "7000", priceN: "4500"},
    {pic:"17", desc: `Ковбаса "Боярська" TM"Світ мяса"$100г`, disc: "25%", priceO: "649", priceN: "495"},
    {pic:"26", desc: `Оселедець "Нептун" Матьє в олії з овочами$500г`, disc: "30%", priceO: "5500", priceN: "3990"},
    {pic:"4", desc: `Пиво "Полтава" Рігас світле с/б 0,5л`, disc: "25%", priceO: "1800", priceN:"1390"},
    {pic:"0", desc: `Сік "Соки України"$мультивінамін/виноград яблуко$1л`, disc: "25%", priceO: "1950", priceN: "1490"},
    {pic:"27", desc: `Мінеральна вода "Моршинська"$крижане серце,щенячий патруль$0,33л`, disc: "25%", priceO: "1250", priceN: "950"},
    {pic:"28", desc: `Шкарпетки жіночі,чоловічі$в асортименті`, disc: "45%", priceO: "1550", priceN: "850"},
    {pic:"2", desc: `Гелеві капсули "Савекс" 2в1$14шт`, disc: "25%", priceO: "11900", priceN: "8900"},


    

]