let dataVid = '10.07'
let dataDo = '31.07';
let base = [
    {
        pic: '25',
        desc: `Торт "Малиновий"$100г`,
        disc: '35%',
        priceO: '1549',	
        priceN: '999'
    },
    {
        pic: '16',
        desc: `Торт "Павлова"$100г`,
        disc: '30%',
        priceO: '1699',	
        priceN: '1199'
    },
    {
        pic: '13',
        desc: `Пончик "GRAND FOOD"$в шоколаді$60г`,
        disc: '30%',
        priceO: '1299',	
        priceN: '899'
    },
    {
        pic: '3',
        desc: `Слойка "GRAND FOOD"$з маком$100г`,
        disc: '40%',
        priceO: '1099',	
        priceN: '659'
    },
    {
        pic: '24',
        desc: `Булочка "Калач з маком"$350г`,
        disc: '40%',
        priceO: '1499',	
        priceN: '899'
    },
    {
        pic: '22',
        desc: `Булочка "Сосиска в тісті"$100г`,
        disc: '40%',
        priceO: '999',	
        priceN: '599'
    },
    {
        pic: '5',
        desc: `Хліб "Кукурудзяний" подовий$450г`,
        disc: '35%',
        priceO: '1699',	
        priceN: '1099'
    },
    {
        pic: '23',
        desc: `Багет пшеничний$вищий гатунок$250г`,
        disc: '45%',
        priceO: '899',	
        priceN: '490'
    },   
    {
        pic: '4',
        desc: `Палочки "GRAND FOOD" слоєні$в асортименті$200г`,
        disc: '50%',
        priceO: '1999',	
        priceN: '999'
    },    
    {
        pic: '21',
        desc: `Багет "GRAND FOOD"$в асотименті$230г                              `,
        disc: '40%',
        priceO: '2499',	
        priceN: '1499'
    },

    {
        pic: '1',
        desc: `Шашлик "Класичний" свинний$з шовдиря охолоджений$100г`,
        disc: '20%',
        priceO: '1649',	
        priceN: '1299'
    },
    {
        pic: '2',
        desc: `Ребра "Арізона" барбекю$охолоджені$100г`,
        disc: '20%',
        priceO: '1499',	
        priceN: '1199'
    },
    {
        pic: '19',
        desc: `Огірки`,
        disc: 'XIT',
        priceO: '',	
        priceN: ''
    },
    {
        pic: '17',
        desc: `Перець салатний`,
        disc: 'XIT',
        priceO: '',	
        priceN: ''
    },    
    {
        pic: '18',
        desc: `Помідори`,  
        disc: 'XIT',
        priceO: '',	
        priceN: ''
    },
    {
        pic: '20',
        desc: `Сир "Бринза" балканська" 35%$у розсолі TM"Королівський смак"$100г`,
        disc: '25%',
        priceO: '1530',	
        priceN: '1170'
    },
    {
        pic: '9',
        desc: `Сир "Сулугуні" косичка копчена$TM "Бімол"$100г`,
        disc: '30%',
        priceO: '1630',	
        priceN: '1150'
    },
    {
        pic: '14',
        desc: `Ковбаса "Фермерська"$ТМ"Світ мяса"$100г`,
        disc: '20%',
        priceO: '1350',	
        priceN: '1050'
    },
    {
        pic: '7',
        desc: `Ковбаски "Баварські" варені$для смаження TM"Глобино"$100г`,
        disc: '25%',
        priceO: '1559',	
        priceN: '1250'
    },
    {
        pic: '15',
        desc: `Морозиво "Лев"$TM "Ласунка"$85г`,
        disc: '25%',
        priceO: '1899',	
        priceN: '1399'
    },
    {
        pic: '26',
        desc: `Морозиво Пролісок TM"Рудь"$в асортименті$60г`,
        disc: '20%',
        priceO: '649',	
        priceN: '425'
    },
    {
        pic: '8',
        desc: `Соус "Канія"$700мл                              `,
        disc: '15%',
        priceO: '6590',	
        priceN: '5490'
    },
    {
        pic: '12',
        desc: `Напій "Фрутелла" Мохіто$в асортименті$1,3л                         `,
        disc: '25%',
        priceO: '1299',	
        priceN: '999'
    },
    {
        pic: '27',
        desc: `Вода мінер."Моршинська"$в асортименті$1.5л`,
        disc: '30%',
        priceO: '1477',	
        priceN: '1059'
    },
    {
        pic: '6',
        desc: `Сухарики "Хрустім"$в асортименті$60г`,
        disc: '30%',
        priceO: '849',	
        priceN: '599'
    },
    {
        pic: '10',
        desc: `Пиво "Гамбрінус" оригінал$0,5л`,
        disc: '25%',
        priceO: '2499',	
        priceN: '1850'
    },
    {
        pic: '11',
        desc: `Пиво "Львівське" 1715$0.45л                      `,
        disc: '25%',
        priceO: '1664',	
        priceN: '1259'
    }
]