let dataVid = '10.06'
let dataDo = '01.07';
let base = [

    // {
    //     pic: `22`,
    //     desc: `Торт "Ягідна спокуса"$100г`,
    //     disc: `40%`,
    //     priceO: `1299`,
    //     priceN: `799`
    // },
    // {
    //     pic: `21`,
    //     desc: `Торт "Мрія"$100г`,
    //     disc: `40%`,
    //     priceO: `1349`,
    //     priceN: `799`
    // },
    // {
    //     pic: `34`,
    //     desc: `Тістечко "Картошка"$75г`,
    //     disc: `40%`,
    //     priceO: `799`,
    //     priceN: `479`
    // },
    // {
    //     pic: `36`,
    //     desc: `Булочка "Кавова"$90г`,
    //     disc: `40%`,
    //     priceO: `999`,
    //     priceN: `599`
    // },
    // {
    //     pic: `32`,
    //     desc: `Круасан "GRAND FOOD"$з шинкою та сиром$100г`,
    //     disc: `40%`,
    //     priceO: `1599`,
    //     priceN: `999`
    // },
    // {
    //     pic: `38`,
    //     desc: `Круасан "GRAND FOOD"$з пломбіром$100г`,
    //     disc: `40%`,
    //     priceO: `999`,
    //     priceN: `599`
    // },
    // {
    //     pic: `37`,
    //     desc: `Міні багет" По домашньому"$200г`,
    //     disc: `35%`,
    //     priceO: `1399`,
    //     priceN: `899`
    // },
    // {
    //     pic: `20`,
    //     desc: `Хліб "Кукурудзяний"$400г`,
    //     disc: `25%`,
    //     priceO: `1299`,
    //     priceN: `999`
    // },  
    // {
    //     pic: `35`,
    //     desc: `Хот-дог "GRAND FOOD"$в асортименті$180г`,
    //     disc: `40%`,
    //     priceO: `1599`,
    //     priceN: `959`
    // },
    {
        pic: `1`,
        desc: `Йогурт Данон "Активія" питний в асортименті$290г`,
        disc: `30%`,
        priceO: `2149`,
        priceN: `1549`
    },
    {
        pic: `28`,
        desc: `Кефір "Ферма" 2.5%$900г`,
        disc: `20%`,
        priceO: `2789`,
        priceN: `2189`
    },
    {
        pic: `19`,
        desc: `Сметанка "Моліка" 20%$450г`,
        disc: `20%`,
        priceO: `1449`,
        priceN: `1149`
    },    
    {
        pic: `18`,
        desc: `Сир "Млековіта" Фета Фаворіта$270г`,
        disc: `20%`,
        priceO: `3699`,
        priceN: `2899`
    },
    {
        pic: `44`,
        desc: `Сир "Російський", "Голандський"$100г`,
        disc: `25%`,
        priceO: `1359`,
        priceN: `1049`
    },
    {
        pic: `49`,
        desc: `Ковбаса "Мисливська"$ТМ "Глобино"$100г`,
        disc: `25%`,
        priceO: `1250`,
        priceN: `950`
    },
    {
        pic: `48`,
        desc: `Ковбаски "Угорські"$ТМ"Тисменські ковбаси"$100г`,
        disc: `25%`,
        priceO: `1150`,
        priceN: `850`
    },
    {
        pic: `47`,
        desc: `Ковбаски "Для смаження Шашличні" ТМ"Глобино"$100г`,
        disc: `25%`,
        priceO: `1650`,
        priceN: `1230`
    },
    {
        pic: `16`,
        desc: `Соус "Торчин" Барбекю$200г `,
        disc: `20%`,
        priceO: `2189`,
        priceN: `1749`
    },
    {
        pic: `15`,
        desc: `Кетчуп "Кухар Рішельє"$до шашлику та лагідний$300г`,
        disc: `30%`,
        priceO: `1250`,
        priceN: `850`
    },
    {
        pic: `3`,
        desc: `Маринади "Верес"$в асортименті$140г`,
        disc: `25%`,
        priceO: `2099`,
        priceN: `1599`
    },
    {
        pic: `10`,
        desc: `Чай "ФЮЗ ТІ" холодний$в асортименті$1л`,
        disc: `25%`,
        priceO: `1800`,
        priceN: `1390`
    },
    {
        pic: `11`,
        desc: `Пиво "ППБ" Свіжий розлив$0,65л`,
        disc: `25%`,
        priceO: `1749`,
        priceN: `1349`
    },
    {
        pic: `2`,
        desc: `Пиво "Велкопоповицький Козел"$0,5л`,
        disc: `20%`,
        priceO: `2349`,
        priceN: `1945`
    },
    {
        pic: `12`,
        desc: `Пиво "Карлсберг"$0,5л    	`,
        disc: `25%`,
        priceO: `2124`,
        priceN: `1599`
    },
    // {
    //     pic: `13`,
    //     desc: `Сухі сніданки "Старт"$в асортименті$280г`,
    //     disc: `30%`,
    //     priceO: `3499`,
    //     priceN: `2499`
    // },
    // {
    //     pic: `51`,
    //     desc: `Чіпси "Люкс"$в асортименті$ 183г`,
    //     disc: `25%`,
    //     priceO: `3769`,
    //     priceN: `2590`
    // },
    // {
    //     pic: `53`,
    //     desc: `Батончик "АХА" з наповнювачем$в асортименті$25г`,
    //     disc: `35%`,
    //     priceO: `1124`,
    //     priceN: `724`
    // },
    // {
    //     pic: `31`,
    //     desc: `Горіх Арахіс солений$100г`,
    //     disc: `20%`,
    //     priceO: `895`,
    //     priceN: `715`
    // },
    // {
    //     pic: `7`,
    //     desc: `Янтарна з перцем$ТМ "Теплі моря"$100г`,
    //     disc: `20%`,
    //     priceO: `3120`,
    //     priceN: `2520`
    // },
    // {
    //     pic: `29`,
    //     desc: `Вафлі бісквітні Віденські$зі згущеним молоком$135г`,
    //     disc: `25%`,
    //     priceO: `1714`,
    //     priceN: `1290`
    // },
    // {
    //     pic: `52`,
    //     desc: `Зефір "Лісова казка" жувальний$в асортименті$200г`,
    //     disc: `20%`,
    //     priceO: `2534`,
    //     priceN: `1990`
    // },
    // {
    //     pic: `8`,
    //     desc: `Морозиво "Пломбір" 100%$ТМ "Рудь"$65г`,
    //     disc: `45%`,
    //     priceO: `1284`,
    //     priceN: `725`
    // },
    // {
    //     pic: `50`,
    //     desc: `Морозиво "Пломбір" ДСТУ$вафельний стаканчик$70г`,
    //     disc: `35%`,
    //     priceO: `1385`,
    //     priceN: `885`
    // },
    // {
    //     pic: `46`,
    //     desc: `Мильні бульбашки$шт`,
    //     disc: `35%`,
    //     priceO: `890`,
    //     priceN: `590`
    // },
    // {
    //     pic: `14`,
    //     desc: `Деревне вугілля$2,5кг                         `,
    //     disc: `20%`,
    //     priceO: `5490`,
    //     priceN: `4490`
    // },
    // {
    //     pic: `39`,
    //     desc: `Дрова для розпалу$в'язка`,
    //     disc: `35%`,
    //     priceO: `2999`,
    //     priceN: `1999`
    // },
    // {
    //     pic: `5`,
    //     desc: `Набір одноразового посуду "ПлейДей"$6 персон`,
    //     disc: `25%`,
    //     priceO: `1650`,
    //     priceN: `1250`
    // },
    // {
    //     pic: `45`,
    //     desc: `Набір дитячий для піску$шт`,
    //     disc: `30%`,
    //     priceO: `3400`,
    //     priceN: `2400`
    // },
    // {
    //     pic: `4`,
    //     desc: `Решітка "Тевейжіа" Павер$для гриля$1шт`,
    //     disc: `20%`,
    //     priceO: `11500`,
    //     priceN: `8990`
    // }
    // ,
    // {
    //     pic: `26`,
    //     desc: `Кабачок запечений$100г`,
    //     disc: `40%`,
    //     priceO: `749`,
    //     priceN: `449`
    // },
    // {
    //     pic: `27`,
    //     desc: `Цвітна капуста в клярі$100г`,
    //     disc: `40%`,
    //     priceO: `799`,
    //     priceN: `479`
    // },
    // {
    //     pic: `25`,
    //     desc: `Салат "По-Мукачівськи"$100г`,
    //     disc: `40%`,
    //     priceO: `1299`,
    //     priceN: `779`
    // },
    // {
    //     pic: `24`,
    //     desc: `Картопля молода в сметанному соусі$100г`,
    //     disc: `40%`,
    //     priceO: `549`,
    //     priceN: `329`
    // },
    // {
    //     pic: `23`,
    //     desc: `Сало копчене$100г`,
    //     disc: `25%`,
    //     priceO: `1199`,
    //     priceN: `900`
    // },
    // {
    //     pic: `33`,
    //     desc: `Фарш асорті$(свинно-яловичий) охолоджений$100г `,
    //     disc: `15%`,
    //     priceO: `999`,
    //     priceN: `850`
    // },
    // {
    //     pic: `42`,
    //     desc: `Крило курчат бройлерів охолоджене$100г`,
    //     disc: `XIT`,
    //     priceO: ``,
    //     priceN: `520`
    // },
    // {
    //     pic: `40`,
    //     desc: `Мариновані "Крильця медові"$курчат охолоджені$100г `,
    //     disc: `20%`,
    //     priceO: `890`,
    //     priceN: `720`
    // },
    // {
    //     pic: `41`,
    //     desc: `Крила курячі запечені$100г`,
    //     disc: `40%`,
    //     priceO: `1599`,
    //     priceN: `999`
    // }

]