let dataVid = '23.12'
let dataDo = '09.01';
let base = [
    //  {size:"rozd", pic:'', desc: ` `, disc: " " priceO: " ", priceN: " "},
    //  {pic: '14', desc:`Корейка свинна$100г`, disc:'20%' priceO:'139', priceN:'112'},

    // {pic:"36", desc:`Торт "Карамельна забава"$100г`,	disc:'30%',	priceO:'2000',	priceN:'1499'},
    // {pic:"37", desc:`Торт "Богема"$100г`,	disc:'25%',	priceO:'1800',	priceN:'1349'},
    // {pic:"35", desc:`Торт "Вишнева фантазія"$100г`,	disc:'20%',	priceO:'1700',	priceN:'1359'},
    // {pic:"33", desc:`Слойка "GRAND FOOD" з полуницею$100г`,	disc:'25%',	priceO:'1300',	priceN:'990'},
    // {pic:"19", desc:`Багет$400г`,	disc:'20%',	priceO:'1400',	priceN:'1090'},
    // {pic:"16", desc:`Батон "Нарізний" подовий$300г`,	disc:'25%',	priceO:'1400',	priceN:'1090'},
    // {pic:"13b", desc:`Стегенце куряче охолоджене$100г`,	disc:'15%',	priceO:'979',	priceN:'839'},
    // {pic:"11", desc:`Стейк свинний охолоджений$100г`,	disc:'15%',	priceO:'1499',	priceN:'1239'},
    // {pic:"17", desc:`Крила курячі запечені$100г`,	disc:'20%',	priceO:'1999',	priceN:'1499'},
    // {pic:"34", desc:`Салат "Морква по корейськи"$450г`,	disc:'20%',	priceO:'2490',	priceN:'1990'},
    // {pic:"9", desc:`Апельсин$100г`,	disc:'XIT',	priceO:'',	priceN:''},
    // {pic:"21", desc:`Hапій "Кока-кола"$2л`,	disc:'XIT',	priceO:'',	priceN:'2450'},

// {pic:"1", desc:`Ікра "Сахалінская" лососева зерниста$140г`,	disc:'25%',	priceO:'9890',	priceN:'7290'},
// {pic:"7", desc:`Сьомга "Флотилія" філе шматок$130г`,	disc:'35%',	priceO:'11200',	priceN:'7450'},
// {pic:"15", desc:`Креветки "Полар стар" очищені$200г`,	disc:'35%',	priceO:'11200',	priceN:'7200'},
// {pic:"20", desc:`Крабові палочки "Економ"$200г`,	disc:'20%',	priceO:'2350',	priceN:'1850'},
// {pic:"18", desc:`Ковбаса "Магурська" ТМ"Світ мяса"$100г`,	disc:'25%',	priceO:'1350',	priceN:'1050'},
// {pic:"10", desc:`Сир ТМ"Охтирка"$"Російський" та "Голандський"$100г`,	disc:'15%',	priceO:'1650',	priceN:'1390'},
// {pic:"6", desc:`Сметана "Президент" 20%$325г`,	disc:'25%',	priceO:'4390',	priceN:'3390'},
// {pic:"12", desc:`Масло "Гайсинське" солодковершкове селянське 72,5%$200г`,	disc:'15%',	priceO:'3850',	priceN:'3190'},
// {pic:"3", desc:`Кукурудза "Все Світ" цукрова$425г`,	disc:'25%',	priceO:'1950',	priceN:'1490'},
// {pic:"24", desc:`Гірчиця "Верес"$130г`,	disc:'30%',	priceO:'1300',	priceN:'900'},
// {pic:"25", desc:`Хрін "Верес"$130г`,	disc:'30%',	priceO:'1400',	priceN:'1000'},
// {pic:"23", desc:`Майонез "Чумак" апетитний 550мл$+$кетчуп$250г`,	disc:'30%',	priceO:'6490',	priceN:'4490'},


{pic:"28", desc:`Бісквіт "Корона" Барні з шоколадом$150г`,	disc:'35%',	priceO:'4550',	priceN:'2990'},
{pic:"26", desc:`Печиво "Орео"$95г`,	disc:'25%',	priceO:'2200',	priceN:'1700'},
{pic:"14", desc:`Цукерки "Рошен" в асортименті$154г`,	disc:'25%',	priceO:'7200',	priceN:'5500'},
{pic:"32", desc:`Г-ка "Держава"$0,5л`,	disc:'15%',	priceO:'11900',	priceN:'9990'},
{pic:"31", desc:`Г-ка "Грін Дей"$0,5л`, 	disc:'XIT',	priceO:'8990',	priceN:''},
{pic:"30", desc:`Вермут "Мартіні"$0,5л`,	disc:'20%',	priceO:'17900',	priceN:'14500'},
{pic:"29", desc:`Вино ігристе "Зіцаріні" Ламбруско біле напівсолодке$0,75л`,	disc:'30%',	priceO:'14990',	priceN:'10900'},
{pic:"27", desc:`Шампанське "Болград"$0,75л`,	disc:'XIT',	priceO:'',	priceN:'10900'},
{pic:"2",  desc:`Вино "Вілла Крім" Мускат рожеве$0,75л`,	disc:'25%',	priceO:'7700',	priceN:'5900'},
{pic:"22", desc:`Серветки "Рута"  новорічні$20шт`,	disc:'20%',	priceO:'2590',	priceN:'2090'},
{pic:"4",  desc:`Фольга "ФрекенБок" алюмінієва універсальна$10м`,	disc:'30%',	priceO:'4900',	priceN:'3490'},
{pic:"5",  desc:`Пергамент "ФрекенБок" для випікання$5м`,	disc:'30%',	priceO:'3300',	priceN:'2300'},


]