let dataVid='10.11'
let dataDo ='31.11';
let base = [
    
    {
        pic:"35",
        desc:'Йогурт "Селянський" в асортим. 2,5% 400мл плівка',
        disc: "20%",
        priceO: "1794",
        priceN: "1394",        
        size: "1"
    },
    {
        pic:"0",
        desc:'Кефір "Ферма" 2.5% 900г пляшка',
        disc: "20%",
        priceO: "2754",
        priceN: "2254",
        size: "1"
    },
    {
        pic:"0",
        desc:'Сир "Російський" 50%, кг "Калинка"',
        disc: "30%",
        priceO: "5700",
        priceN: "10700",
        size: "1"
    },
    {
        pic:"13",
        desc:'Масло "Ружин Молоко" селянс.73% 180г',
        disc: "15%",
        priceO: "3249",
        priceN: "2749",
        size: "1"
    },
    {
        pic:"31",
        desc:'Трубочки д"молока в асортим.30г',
        disc: "20%",
        priceO: "1500",
        priceN: "1199",
        size: "1"
    },
    {
        pic:"33",
        desc:'Сирок "Малюк-ам" глаз.55г',
        disc: "25%",
        priceO: "1220",
        priceN: "920",
        size: "1"
    },
    {
        pic:"0",
        desc:'Сардельки "Бородинські" кг,"Бащинський"',
        disc: "25%",
        priceO: "7944",
        priceN: "5800",
        size: "1"
    },
    {
        pic:"0",
        desc:'Ковбаса "Боярська" вар.1г (целофан), кг "Світ мяса"',
        disc: "15%",
        priceO: "6099",
        priceN: "5299",
        size: "1"
    },
    {
        pic:"0",
        desc:'Ковбаса  Салямі Банкетна н"к ,кг  Глобино',
        disc: "30%",
        priceO: "2500",
        priceN: "8900",
        size: "1"
    },
    {
        pic:"0",
        desc:`Ковбаса "М'ясна з шинкою"1с ,кг "Глобино"                   `,
        disc: "30%",
        priceO: "2599",
        priceN: "8900",
        size: "1"
    },
    {
        pic:"15",
        desc:'Пиво "Туборг Грін" ж"б 0.5л',
        disc: "30%",
        priceO: "1964",
        priceN: "1364",
        size: "1"
    },
    {
        pic:"16",
        desc:'Пиво "Полтава" Ячмінний колос 0,5л',
        disc: "30%",
        priceO: "1799",
        priceN: "1299",
        size: "1"
    },
    {
        pic:"20",
        desc:'Вода мінер."Шаянська" 1,5л "Заповітна"',
        disc: "25%",
        priceO: "1149",
        priceN: "849",
        size: "1"
    },
    {
        pic:"17",
        desc:'Hапій "Фанта-шоката" пет 0.5л',
        disc: "30%",
        priceO: "1349",
        priceN: "949",
        size: "1"
    },
    {
        pic:"14",
        desc:'Паштет "Пріват" 105г',
        disc: "20%",
        priceO: "1654",
        priceN: "1349",
        size: "1"
    },
    {
        pic:"32",
        desc:'Шоколад "Міленіум"  пористий 100г',
        disc: "35%",
        priceO: "1999",
        priceN: "1299",
        size: "1"
    },
    {
        pic:"19",
        desc:'Чай "Ловаре" в пакетиках 1,5г*24шт в асорт.',
        disc: "25%",
        priceO: "4299",
        priceN: "3299",
        size: "1"
    },
    {
        pic:"41",
        desc:'Крупа "Хатинка" гречана ,кг',
        disc: "25%",
        priceO: "1649",
        priceN: "1249",
        size: "1"
    },
    {
        pic:"18",
        desc:'Майонез "Чумак" апетитний 350г',
        disc: "25%",
        priceO: "1844",
        priceN: "1344",
        size: "1"
    },
    {
        pic:"29",
        desc:'Квасоля "Екоол" смачна т"с с"б 460г',
        disc: "25%",
        priceO: "1599",
        priceN: "1199",
        size: "1"
    },
    {
        pic:"39",
        desc:'Лимони',
        disc: "XIT",
        priceO: " ",
        priceN: " ",
        size: "1"
    },
    {
        pic:"38",
        desc:'Хурма',
        disc: "XIT",
        priceO: " ",
        priceN: " ",
        size: "1"
    },
    {
        pic:"37",
        desc:'Ківі',
        disc: "XIT",
        priceO: " ",
        priceN: " ",
        size: "1"
    },
    {
        pic:"0",
        desc:'Кілька "Балтійська" пряного посолу, кг',
        disc: "20%",
        priceO: "5200",
        priceN: "4200",
        size: "1"
    },
    {
        pic:"36",
        desc:'Суміш "Лімо" Весняна, кг',
        disc: "25%",
        priceO: "6564",
        priceN: "4864",
        size: "1"
    },
    {
        pic:"42",
        desc:'Зефір "Біло-рожевий", кг "Родина"',
        disc: "20%",
        priceO: "5794",
        priceN: "4499",
        size: "1"
    },
    {
        pic:"22",
        desc:'Бальзам кінський д"тіла "Лорін" в асортим.500мл',
        disc: "15%",
        priceO: "5699",
        priceN: "4799",
        size: "1"
    },
    {
        pic:"21",
        desc:'Губки кухонні "Гаряча господарочка" 5шт',
        disc: "25%",
        priceO: "1487",
        priceN: "1087",
        size: "1"
    },
    {
        pic:"23",
        desc:'Серветки "Гаряча господарочка" віскозні 30х36"3шт',
        disc: "25%",
        priceO: "1487",
        priceN: "1087",
        size: "1"
    },
    {
        pic:"34",
        desc:'Пакети д"сміття "Гаряча господарочка" 50*60"35л"30шт',
        disc: "25%",
        priceO: "1579",
        priceN: "1179",
        size: "1"
    },
    {
        pic:"24",
        desc:'Печиво "Біскотті" Кіфлики пісочні 1,6кг',
        disc: "20%",
        priceO: "8469",
        priceN: "6699",
        size: "1"
    },
    {
        pic:"9",
        desc:'Торт "Венера",кг',
        disc: "30%"	,
        priceO: "3499",
        priceN: "9499",
        size: "1"
    },
    {
        pic:"10",
        desc:'Рулет"Творожний",кг',
        disc: "25%"	,
        priceO: "10499",
        priceN: "7899",
        size: "1"
    },
    {
        pic:"25",
        desc:'Тістечко"Кокосове",шт',
        disc: "30%",
        priceO: "1599",
        priceN: "1099",
        size: "1"
    },
    {
        pic:"30",
        desc:'Пиріг "Домашній з творогом", 500г',
        disc: "25%",
        priceO: "3999",
        priceN: "2999",
        size: "1"
    },
    {
        pic:"27",
        desc:'Пиріг "Домашній з яблуком", 500г',
        disc: "30%",
        priceO: "2999",
        priceN: "1999",
        size: "1"
    },
    {
        pic:"28a",
        desc:'Булочка "З висівками" 100г',
        disc: "40%",
        priceO: "499",
        priceN: "299",
        size: "1"
    },
    {
        pic:"26",
        desc:'Булочка "Творожно-вишнева" 100г',
        disc: "25%",
        priceO: "649",
        priceN: "499",
        size: "1"
    },
    {
        pic:"40",
        desc:'Круасан"GRAND FOOD"з шоколадною начинкою 100г',
        disc: "25%",
        priceO: "1099",
        priceN: "799",
        size: "1"
    },
    {
        pic:"8",
        desc:'Лангош "GRAND FOOD" 250г',
        disc: "20%",
        priceO: "2499",
        priceN: "1999",
        size: "1"
    },
    {
        pic:"2",
        desc:'Салат "Буряк маринований з хріном", кг',
        disc: "40%",
        priceO: "5999",
        priceN: "3499",
        size: "1"
    },
    {
        pic:"5",
        desc:'Ковбаса свинна запечена кг',
        disc: "40%"	,
        priceO: "21499",
        priceN: "12899",
        size: "1"
    },
    {
        pic:"3",
        desc:'Салат "По Мукачівськи", кг',
        disc: "40%"	,
        priceO: "11499",
        priceN: "6999",
        size: "1"
    },
    {
        pic:"1",
        desc:'Хек смажений, кг',
        disc: "40%"	,
        priceO: "14999",
        priceN: "8999",
        size: "1"
    },
    {
        pic:"4",
        desc:'Крило куряче гриль, кг',
        disc: "25%"	,
        priceO: "12999",
        priceN: "9999",
        size: "1"
    },
    {
        pic:"11",
        desc:'Лопатка свинна охолоджена, кг',
        disc: "20%"	,
        priceO: "13999",
        priceN: "10999",
        size: "1"
    },
    {
        pic:"12",
        desc:'Фарш асорті (свинно-яловичий) охолоджений, кг',
        disc: "15%",
        priceO: "9999",
        priceN: "8499",
        size: "1"
    },
    {
        pic:"6",
        desc:'Ковбаса "Пікниця" свинна сирокопчена, кг',
        disc: "20%"	,
        priceO: "15999",
        priceN: "12499",
        size: "1"
    },
    {
        pic:"7",
        desc:'Ковбаса свинна охолоджена, кг',
        disc: "25%"	,
        priceO: "12400",
        priceN: "9499",
        size: "1"
    }    

]