let dataVid = '31.10'
let dataDo = '20.11';
let base = [
    //  {size:"rozd", pic:"0", desc: ` `, disc: " " priceO: " ", priceN: " "},  
    //  {pic: '14', desc:`Корейка свинна$100г`, disc:'20%' priceO:'1390', priceN:'1120'},

    {pic:"9", desc:`Торт "Баунті"$100г`, disc:'40%',	priceO:'1600',	priceN:'950'},
    {pic:"31", desc:`Торт "Вечірній"$100г`, disc:'40%',	priceO:'1950',	priceN:'1170'},
    {pic:"30", desc:`Тістечко "Мелодія"$100г`, disc:'40%',	priceO:'1600',	priceN:'950'},
    {pic:"28", desc:`Круасан шоколадний "GRAND FOOD"$з заварним кремом$100г`, disc:'45%',	priceO:'1600',	priceN:'850'},

    {pic:"29", desc:`Слойка "GRAND FOOD"$з творогом та родзинками$100г`, disc:'45%',	priceO:'1200',	priceN:'650'},
    {pic:"37", desc:`Булочка "Тріо"$120г`, disc:'35%',	priceO:'900',	priceN:'600'},
    {pic:"32", desc:`Пиріжки з квашеною капустою$150г`, disc:'35%',	priceO:'1000',	priceN:'650'},
    {pic:"33", desc:`Булочка "Макова"$120г`, disc:'35%',	priceO:'600',	priceN:'400'},

    {pic:"34", desc:`Хліб "Кукурудзяний" подовий$450г`, disc:'35%',	priceO:'1900',	priceN:'1200'},
    {pic:"17", desc:`Гамбургер "GRAND FOOD"$280г`, disc:'30%',	priceO:'2400',	priceN:'1700'},
    {pic:"15", desc:`Вареники з солоним сиром$100г`, disc:'35%',	priceO:'999',	priceN:'650'},
    {pic:"7", desc:`Сало "По-Українськи"$з чорним перцем$100г`, disc:'20%',	priceO:'999',	priceN:'800'},

    {pic:"16", desc:`Фарш асорті (свинно-яловичий) охолоджений$100 г`, disc:'25%',	priceO:'11990',	priceN:'899'},
    {pic:"38", desc:`Шинка свинна охолоджена$100г`, disc:'20%',	priceO:'11990',	priceN:'999'},
    {pic:"21", desc:`Ковбаса "Пікниця" сирокопчена$100г`, disc:'45%',	priceO:'17990',	priceN:'999'},
    {pic:"14", desc:`Крило куряче охолоджене$100г`, disc:'20%',	priceO:'5990',	priceN:'480'},

    {pic:"8", desc:`Філе стегна курчат бройлерів охолоджене$100г`, disc:'25%',	priceO:'9390',	priceN:'690'},
    {pic:"22", desc:`Гомілка індича охолоджена$100г`, disc:'20%',	priceO:'5990',	priceN:'480'},

    {size:"rozd", pic:"0", desc: ` `, disc: " ", priceO: " ", priceN: " "},

    {pic:"10", desc:`Диня Пекучка`, disc:'XIT',	priceO:'',	priceN:''},
    {pic:"11", desc:`Груша домашня`, disc:'XIT',	priceO:'',	priceN:''},
    {pic:"18", desc:`Яблука`, disc:'XIT',	priceO:'',	priceN:''},
    {pic:"2", desc:`Квасоля "Всесвіт" в соусі$500г`, disc:'20%',	priceO:'1950',	priceN:'1550'},

    {pic:"23", desc:`Кефір "Біла Лінія" 2.5%$840г`, disc:'25%',	priceO:'2790',	priceN:'2190'},
    {pic:"13", desc:`Йогурт "Фанні"$в асортименті$400мл`, disc:'25%',	priceO:'1490',	priceN:'1090'},
    {pic:"35", desc:`Масло "Добрі товари" 73%$100г`, disc:'20%',	priceO:'1100',	priceN:'880'},
    {pic:"24", desc:`Сирний продукт "Руський" TM"Тульчин"$170г`, disc:'20%',	priceO:'3300',	priceN:'2690'},

    {pic:"4", desc:`Ковбаса "Рубана" TM"Світ мяса"$100г`, disc:'25%',	priceO:'1290',	priceN:'990'},
    {pic:"5", desc:`Ковбаса "Студенська"варена TM"Добрі товари"$100г`, disc:'30%',	priceO:'690',	priceN:'490'},
    {pic:"6", desc:`Сосиски "Філейні" ТМ"Бащинський"$100г`, disc:'30%',	priceO:'1250',	priceN:'900'},
    {pic:"20", desc:`Сосиски "Ход дог" TM"Світ мяса"$100г`, disc:'30%',	priceO:'770',	priceN:'549'},

    {pic:"19", desc:`Хек тушка 300-500 свіжеморожений$100г`, disc:'35%',	priceO:'899',	priceN:'599'},
    {pic:"25", desc:`Рибні палички ТМ"Вічі"$100г`, disc:'20%',	priceO:'869',	priceN:'699'},
    {pic:"1", desc:`Hапій "Швепс"$в асортименті$1л`, disc:'20%',	priceO:'2100',	priceN:'1690'},
    {pic:"36", desc:`Мін.вода "Шаянська" Заповітна$1,5л`, disc:'25%',	priceO:'1250',	priceN:'950'},

    {pic:"26", desc:`Цукерки  "Відмежатко" з горіхом ТМ"Конті"$100г`, disc:'35%',	priceO:'890',	priceN:'590'},
    {pic:"27", desc:`Батончик "Конті" Брауні$в асортименті$35г`, disc:'35%',	priceO:'850',	priceN:'550'},
    {pic:"3", desc:`Шоколад "Рошен"$нач.з печивом,вафлею$115г`, disc:'25%',	priceO:'2300',	priceN:'1750'},    
    {pic:"0", desc:`Шоколадний десерт "Чоколада"$екстаза горіх$400г`, disc:'20%',	priceO:'3500',	priceN:'2800'},

    {pic:"0", desc:`Макарони "Прополіс"$в асортимент$500г`, disc:'20%',	priceO:'1700',	priceN:'1350'},
]