let dataVid = '23.04'
let dataDo = '07.05';
let base = [
    //  {size:"rozd", pic:'0', desc: ` `, disc: " " priceO: " ", priceN: " "},
    //  {pic: '14', desc:`Корейка свинна$100г`, disc:'20%' priceO:'1390', priceN:'1120'},

    {pic: '31', desc: `Торт "Снікерс"$100г`, disc:'20%', priceN:'1049', priceO:'1300'},
    {pic: '27', desc: `Торт "Баунті"$100г`, disc:'20%', priceN:'1299', priceO:'1600'},
    {pic: '28', desc: `Торт"Весна"$100г`, disc:'35%', priceN:'1100', priceO:'1650'},
    {pic: '50', desc: `Торт"Богема"$100г`, disc:'20%', priceN:'1349', priceO:'1700'},
    {pic: '35', desc: `Круасан "GRAND FOOD" з пломбіром$100г`, disc:'35%', priceN:'790', priceO:'1200'},
    {pic: '33', desc: `Слойка "GRAND FOOD" з творогом та родзинками$100г`, disc:'40%', priceN:'790', priceO:'1300'},
    {pic: '34', desc: `Паска$400г`, disc:'25%', priceN:'4000', priceO:'5490'},
    {pic: '30', desc: `Хлібець "Заварний"$400г`, disc:'30%', priceN:'1290', priceO:'1799'},
    {pic: '26', desc: `Булочка "З вишнями$ 100г`, disc:'30%', priceN:'800', priceO:'1200'},
    
    {pic: '42', desc:`Багет "GRAND FOOD"$в асортименті$230г`, disc:'25%', priceO:'2500', priceN:'1900'},
    {pic: '41', desc:`Курятина запечена$в асортименті$100г `, disc:'25%', priceO:'1299', priceN:'999'},
    
    {pic: '44', desc:`Голубці "По Закарпатськи"$100г`, disc:'40%', priceO:'990', priceN:'599'},
    {pic: '48', desc:`Стегенце куряче охолоджене$100г`, disc:'10%', priceO:'899', priceN:'799'},
    {pic: '46', desc:`Гомілка індича охолоджена$100г`, disc:'10%', priceO:'739', priceN:'669'},
    {pic: '47', desc:`Стегно куряче "Авіньйон"$100г`, disc:'15%', priceO:'1099', priceN:'939'},
    {pic: '49', desc:`Шашлик "Класичний" свинний з шовдиря$100г`, disc:'10%', priceO:'1449', priceN:'1299'},
    {pic: '40', desc:`Фарш асорті(свинно-яловичий) охолоджений$100г`, disc:'10%', priceO:'1199', priceN:'1079'},
    {pic: '45', desc:`Бекон свинний копчений$100г`, disc:'20%', priceO:'1499', priceN:'1199'},
    {pic: '43', desc:`Смалець$500г`, disc:'30%', priceO:'3290', priceN:'2290'},
    {pic: '29', desc: `Тісто "GRAND FOOD" листкове прісне$500г`, disc:'20%', priceN:'2390', priceO:'3000'},

    {size:"rozd", pic:'0', desc: ` `, disc: " ", priceO: " ", priceN: " "},

    {pic: '5', desc: `Творог "Ружин" 18%$100г`, disc:'15%', priceO:'669', priceN: '579'},
    {pic: '3', desc: `Сир "Королівський" (Польща)$100г`, disc:'10%', priceO:'2149', priceN: '1940'},
    {pic: '17', desc: `Сир "Млекома" маскарпоне$250г`, disc:'25%', priceO:'6900', priceN: '5350'},
    {pic: '7', desc: `Сметана "Президент" 20%$325г`, disc:'20%', priceO:'4150', priceN: '3390'},

    {pic: '16', desc: `Масло "Екстра" 82% TM"Фалва"$200г`, disc:'30%', priceO:'2700', priceN: '1950'},
    {pic: '24', desc: `Сир плавлений "Ферма"$в асортименті$90г`, disc:'20%', priceO:'1590', priceN: '1290'},
    {pic: '11', desc: `Окорок "Святковий" ТМ"Світ мяса"$100г`, disc:'25%', priceO:'1690', priceN: '1299'},
    {pic: '23', desc: `Ковбаса "Живецька" рублена$600г`, disc:'25%', priceO:'12900', priceN: '9900'},

    {pic: '15', desc: `Ковбаса "Фірмова з телятини" варена$505г,"Тульчин`, disc:'20%', priceO:'4990', priceN: '3990'},
    {pic: '36', desc: `Лосось "Флагман"$130г`, disc:'40%', priceO:'12990', priceN: '7990'},
    {pic: '1', desc: `Яйця "Ясенсвіт"$10шт`, disc:'20%', priceO:'4150', priceN: '3290'},
    {pic: '12', desc: `Майонез "Чумак" апетитний$550мл`, disc:'25%', priceO:'4200', priceN: '3190'},
    
    {pic: '18', desc: `Гриби "Все Світ" шампіньйони$480мл`, disc:'20%', priceO:'4200', priceN: '3390'},
    {pic: '19', desc: `Хрін "Все Світ" 170мл$Гірчиця "Еко Світ" 180мл`, disc:'20%', priceO:'1290', priceN: '1050'},
    {pic: '2', desc: `Мінеральна вода "Маргіт" Лужанська-7$1.5л`, disc:'25%', priceO:'1290', priceN: '990'},
    {pic: '20', desc: `Hапій "Кока-кола", "Фанта" та "Спрайт"$2л`, disc:'XIT', priceO:'', priceN: '2450'},
    
    {pic: '21', desc: `Пиво "Спраглий монах"$0.550л`, disc:'30%', priceO:'2550', priceN: '1750'},
    {pic: '22', desc: `Настоянка "Бехеровка" 38%$0,5л`, disc:'25%', priceO:'25900', priceN: '19900'},
    {pic: '9', desc: `Коньяк "Закарпатський"$0.5л `, disc:'20%', priceO:'18990', priceN: '15690'},
    {pic: '25', desc: `Горілка "Держава"$0,5л`, disc:'XIT', priceO:'', priceN: '9900'},

    {pic: '8', desc: `Шоколад "Мілка"$в асортименті$100г`, disc:'25%', priceO:'2800', priceN: '2190'},
    {pic: '37', desc: `Цукерки "Мілленіум" Елеганс асорті молочні$143г`, disc:'25%', priceO:'6700', priceN: '4990'},
    {pic: '10', desc: `Чіпси "Люкс"$в асортименті$133г`, disc:'30%', priceO:'3300', priceN: '2400'},
    {pic: '13', desc: `Лаваш "Діжо"$в асортименті$250г`, disc:'25%', priceO:'3750', priceN: '2850'},

]