let dataVid = '03.06'
let dataDo = '20.06';
let base = [

{pic: '26', desc: `Торт "Творожний"$100u`,	disc: "40%",	priceO: "1400",	priceN: "840"},
{pic: '8', desc: `Торт"Наполеон"$100г`,	disc: "40%",	priceO: "1200",	priceN: "720"},
{pic: '27', desc: `Торт "Павлова"$100г`,	disc: "40%",	priceO: "2000",	priceN: "1190"},
{pic: '15', desc: `Пиріг Яблучний$100г`,	disc: "30%",	priceO: "1000",	priceN: "699"},
{pic: '25', desc: `Пиріжок з яблуком$100г`,	disc: "40%",	priceO: "700",	priceN: "400"},
{pic: '14', desc: `Сосиска "GRAND FOOD"$"Гриль" в слоєному тісті$110г`,	disc: "30%",	priceO: "1400",	priceN: "990"},
{pic: '24', desc: `Паніні "GRAND FOOD"$в асортименті$230г`,	disc: "20%",	priceO: "2500",	priceN: "1900"},
{pic: '28', desc: `Хліб "Запашний"$житньо-пшеничний подовий$600г`,	disc: "30%",	priceO: "2000",	priceN: "1400"},
{pic: '23', desc: `Гурка$100г`,	disc: "30%",	priceO: "1090",	priceN: "770"},
{pic: '10', desc: `Шашлик свинний охолоджений$100г`,	disc: "30%",	priceO: "1399",	priceN: "9900"},
{pic: '11', desc: `Корейка свинна охолоджена$100u`,	disc: "20%",	priceO: "1550",	priceN: "1250"},
{pic: '16', desc: `Філе куряче охолоджене$100г`,	disc: "25%",	priceO: "999",	priceN: "740"},
{pic: '20', desc: `Курча "Гриль"$100г`,	disc: "25%",	priceO: "1299",	priceN: "990"},
{pic: '21b', desc: `Капуста квашена білокачанна з морквою або буряком$100г`,	disc: "60%",	priceO: "250",	priceN: "99"},
//{pic: '21', desc: `Капуста квашена білокачанна з буряком$100г`,	disc: "60%",	priceO: "250",	priceN: "99"},
{pic: '22', desc: `Смалець$500г`,	disc: "35%",	priceO: "3000",	priceN: "1900"},
{pic: '17', desc: `Капуста молода, кг`,	disc: "XIT",	priceO: "",	priceN: " "}, 
{pic: '19', desc: `Буряк молодий, кг`,	disc: "XIT",	priceO: "",	priceN: " "},
{pic: '18', desc: `Огірки, кг`,	disc: "XIT",	priceO: "",	priceN: " "},
{pic: '1', desc: `Морозиво "Справжній Пломбір"$ваф.стак. TM"Ласка"$70г`,	disc: "35%",	priceO: "1400",	priceN: "950"},
{pic: '29', desc: `Сир "Бринза" Болгарська 30%$фасована ТМ"НАК"$100г`,	disc: "25%",	priceO: "1550",	priceN: "1150"},
{pic: '6', desc: `Йогурт "Млековіта" 2,5%$в асортименті$350г`,	disc: "25%",	priceO: "2500",	priceN: "1890"},
{pic: '3', desc: `Hапій Живчик Яблуко$2л`,	disc: "30%",	priceO: "2600",	priceN: "1890"},
{pic: '5', desc: `Пиво "Олд Прага" світле$0,5л`,	disc: "35%",	priceO: "2800",	priceN: "1900"},
{pic: '7', desc: `Сухарики "Маретті"$в асортименті$70г`,	disc: "25%",	priceO: "2000",	priceN: "1500"},
{pic: '4', desc: `Мінеральна вода "Моршинська"$в асортименті$1.5л`,	disc: "25%",	priceO: "1550",	priceN: "1150"},
{pic: '30', desc: `Ковбаски "Шашличні" TM "Світ мяса"$100г`,	disc: "20%",	priceO: "1590",	priceN: "1250"},
{pic: '9', desc: `Соус "Торчин" Папрік,Тартар$250г`,	disc: "25%",	priceO: "2200",	priceN: "1690"},
{pic: '12', desc: `Набір посуду "Гаряча господарочка"$одноразовий на 6 персон`,	disc: "25%",	priceO: "1700",	priceN: "1300"},
{pic: '31', desc: `Шампур з деревяною ручкою$1шт`,	disc: "30%",	priceO: "1300",	priceN: "900"},
{pic: '2', desc: `Вугілля "MEDZIO ANGLIS" деревне$2,5кг`,	disc: "25%",	priceO: "5900",	priceN: "4500"}
  
]