let dataVid = '17.05'
let dataDo = '31.05';
let base = [{
        pic: `16`,
        desc: `Торт "Творожно-кавовий"$100г	`,
        disc: `30%`,
        priceO: `1299`,
        priceN: `899`
    },
    {
        pic: `18`,
        desc: `Тістечко "Картошка"$75г`,
        disc: `40%`,
        priceO: `799`,
        priceN: `479`
    },
    {
        pic: `21`,
        desc: `Круасан "GRAND FOOD"$з повидлом$100г`,
        disc: `40%`,
        priceO: `999`,
        priceN: `599`
    },
    {
        pic: `14`,
        desc: `Косичка$"З творогом та родзинками"$130г`,
        disc: `40%`,
        priceO: `999`,
        priceN: `599`
    },
    {
        pic: `17`,
        desc: `Булочка "До гамбургера"$120г`,
        disc: `40%`,
        priceO: `599`,
        priceN: `359`
    },
    {
        pic: `22`,
        desc: `Сосиска "GRAND FOOD"$гриль в слоєному тісті$110г`,
        disc: `40%`,
        priceO: `1299`,
        priceN: `799`
    },
    {
        pic: `9`,
        desc: `Різотто$100г                                                 	`,
        disc: `40%`,
        priceO: `599`,
        priceN: `349`
    },
    {
        pic: `12`,
        desc: `Четвертина куряча запечена,$100г                               	`,
        disc: `35%`,
        priceO: `1499`,
        priceN: `999`
    },
    {
        pic: `11`,
        desc: `Курча гриль$100г                                             	`,
        disc: `25%`,
        priceO: `1299`,
        priceN: `999`
    },
    {
        pic: `20`,
        desc: `Гамбургер "GRAND FOOD"$280г                                 	`,
        disc: `35%`,
        priceO: `2399`,
        priceN: `1549`
    },
    {
        pic: `24`,
        desc: `Ковбаски "Єгерські"$ТМ"Родина"$100г`,
        disc: `20%`,
        priceO: `990`,
        priceN: `799`
    },
    {
        pic: `27`,
        desc: `Сир "Сулугуні"$косичка копчена ТМ"Бімол"$100г`,
        disc: `20%`,
        priceO: `1590`,
        priceN: `1299`
    },
    {
        pic: `5`,
        desc: `Йогурт Данон "Растішка"$в асортименті$115г`,
        disc: `25%`,
        priceO: `919`,
        priceN: `675`
    },
    {
        pic: `1`,
        desc: `Морозиво "Каштан"$ескімо шоколад$70г`,
        disc: `30%`,
        priceO: `1399`,
        priceN: `990`
    },
    {
        pic: `3`,
        desc: `Бісквіт Барні$шоколад-горіх, полуниця-ваніль$30г`,
        disc: `35%`,
        priceO: `899`,
        priceN: `599`
    },
    {
        pic: `6`,
        desc: `Приправа "Любисток"$в асортименті$30г`,
        disc: `25%`,
        priceO: `700`,
        priceN: `525`
    },
    {
        pic: `23`,
        desc: `Сухарики "Снеккін"$в асортименті$70г	`,
        disc: `30%`,
        priceO: `699`,
        priceN: `499`
    },
    {
        pic: `25`,
        desc: `Насіння "Херсонське елітне"$соняшника смажене$150г`,
        disc: `20%`,
        priceO: `1550`,
        priceN: `1249`
    },
    {
        pic: `19`,
        desc: `Кетчуп Чумак$Лагідний та Шашличний$270г`,
        disc: `30%`,
        priceO: `1449`,
        priceN: `1049`
    },
    {
        pic: `26`,
        desc: `Пиво "Туборг Грін"$0,5л`,
        disc: `25%`,
        priceO: `2214`,
        priceN: `1699`
    },
    {
        pic: `4`,
        desc: `Пиво "Крушовіце" 10%$0.5л                               	`,
        disc: `20%`,
        priceO: `2499`,
        priceN: `1999`
    },
    {
        pic: `15`,
        desc: `Hапій "Біола" Бріз$в асортименті$2л`,
        disc: `25%`,
        priceO: `1400`,
        priceN: `1075`
    },
    {
        pic: `13`,
        desc: `Сало обрізне$100г                                            	`,
        disc: `XIT`,
        priceO: ``,
        priceN: `349`
    },
    {
        pic: `10`,
        desc: `Голова свинна$100г	`,
        disc: `XIT`,
        priceO: ``,
        priceN: `249`
    },
    {
        pic: `2`,
        desc: `Рідина для розпалювання "Ледокоол"$250мл`,
        disc: `30%`,
        priceO: `2390`,
        priceN: `1690`
    },
    {
        pic: `7`,
        desc: `Деревне вугілля$2,5кг                                       	`,
        disc: `20%`,
        priceO: `5490`,
        priceN: `4490`
    },
    {
        pic: `8`,
        desc: `Набір одноразового посуду$"Гаряча господарочка"$10персон`,
        disc: `25%`,
        priceO: `2584`,
        priceN: `1984`
    }
]