let dataVid = '23.04'
let dataDo = '07.05';
let base = [
    //  {size:"rozd", pic:'0', desc: ` `, disc: " " priceO: " ", priceN: " "},
    //  {pic: '14', desc:`Корейка свинна$100г`, disc:'20%' priceO:'1390', priceN:'1120'},

    {pic: '31', desc: `Торт "Снікерс"$100г`, disc:'20%', priceN:'1049', priceO:'1300'},
    {pic: '27', desc: `Торт "Баунті"$100г`, disc:'20%', priceN:'1299', priceO:'1600'},
    {pic: '28', desc: `Торт"Весна"$100г`, disc:'35%', priceN:'1100', priceO:'1650'},
    {pic: '0', desc: `Торт"Богема"$100г`, disc:'20%', priceN:'1349', priceO:'1700'},
    {pic: '35', desc: `Круасан "GRAND FOOD" з пломбіром$100г`, disc:'35%', priceN:'790', priceO:'1200'},
    {pic: '33', desc: `Слойка "GRAND FOOD" з творогом та родзинками$100г`, disc:'40%', priceN:'790', priceO:'1300'},
    {pic: '29', desc: `Тісто "GRAND FOOD" листкове прісне$500г`, disc:'20%', priceN:'2390', priceO:'3000'},
    {pic: '34', desc: `Паска$400г`, disc:'25%', priceN:'4000', priceO:'5490'},
    {pic: '30', desc: `Хлібець "Заварний"$400г`, disc:'30%', priceN:'1290', priceO:'1799'},
    {pic: '26', desc: `Булочка "З вишнями$ 100г`, disc:'30%', priceN:'800', priceO:'1200'},

    {size:"rozd", pic:'0', desc: ` `, disc: " ", priceO: " ", priceN: " "},

    {pic: '5', desc: `Творог "Ружин" 18%$100г`, disc:'15%', priceO:'669', priceN: '579'},
    {pic: '3', desc: `Сир "Королівський" (Польща)$100г`, disc:'10%', priceO:'2149', priceN: '1940'},
    {pic: '17', desc: `Сир "Млекома" маскарпоне$250г`, disc:'25%', priceO:'6900', priceN: '5350'},
    {pic: '7', desc: `Сметана "Президент" 20%$325г`, disc:'20%', priceO:'4150', priceN: '3390'},

    {pic: '16', desc: `Масло "Екстра" 82% TM"Фалва"$200г`, disc:'30%', priceO:'2700', priceN: '1950'},
    {pic: '24', desc: `Сир плавлений "Ферма"$в асортименті$90г`, disc:'20%', priceO:'1590', priceN: '1290'},
    {pic: '11', desc: `Окорок "Святковий" ТМ"Світ мяса"$100г`, disc:'25%', priceO:'1690', priceN: '1299'},
    {pic: '23', desc: `Ковбаса "Живецька" рублена$600г`, disc:'25%', priceO:'12900', priceN: '9900'},

    {pic: '15', desc: `Ковбаса "Фірмова з телятини" варена$505г,"Тульчин`, disc:'20%', priceO:'4990', priceN: '3990'},
    {pic: '36', desc: `Лосось "Флагман"$130г`, disc:'40%', priceO:'12990', priceN: '7990'},
    {pic: '1', desc: `Яйця "Ясенсвіт"$10шт`, disc:'20%', priceO:'4150', priceN: '3290'},
    {pic: '12', desc: `Майонез "Чумак" апетитний$550мл`, disc:'25%', priceO:'4200', priceN: '3190'},
    
    {pic: '18', desc: `Гриби "Все Світ" шампіньйони$480мл`, disc:'20%', priceO:'4200', priceN: '3390'},
    {pic: '19', desc: `Хрін "Все Світ" 170мл$Гірчиця "Еко Світ" 180мл`, disc:'20%', priceO:'1290', priceN: '1050'},
    {pic: '2', desc: `Мінеральна вода "Маргіт" Лужанська-7$1.5л`, disc:'25%', priceO:'1290', priceN: '990'},
    {pic: '20', desc: `Hапій "Кока-кола", "Фанта" та "Спрайт"$2л`, disc:'XIT', priceO:'', priceN: '2450'},
    
    {pic: '21', desc: `Пиво "Спраглий  монах"$0.550л`, disc:'30%', priceO:'2550', priceN: '1750'},
    {pic: '22', desc: `Настоянка "Бехеровка" 38%$0,5л`, disc:'25%', priceO:'25900', priceN: '19900'},
    {pic: '9', desc: `Коньяк "Закарпатський"$0.5л `, disc:'20%', priceO:'18990', priceN: '15690'},
    {pic: '25', desc: `Горілка "Держава"$0,5л`, disc:'XIT', priceO:'', priceN: '9900'},

    {pic: '8', desc: `Шоколад "Мілка"$в асортименті$100г`, disc:'25%', priceO:'2800', priceN: '2190'},
    {pic: '0', desc: `Цукерки "Мілленіум" Елеганс асорті молочні$143г`, disc:'0%', priceO:'5790', priceN: '000'},
    {pic: '10', desc: `Чіпси "Люкс"$в асортименті$133г`, disc:'30%', priceO:'3300', priceN: '2400'},
    {pic: '13', desc: `Лаваш "Діжо"$в асортименті$250г`, disc:'25%', priceO:'3750', priceN: '2850'},



    // {pic: '13', desc:`Кефір "Ферма" 2,5%$840г`,disc:'25%', priceO:'3250', priceN:'2490'},
    // {pic: '10', desc:`Йогурт "Дольче" в асортименті$280г`,disc:'30%', priceO:'2600', priceN:'1850'},
    // {pic: '30', desc:`Десерт "Машенька" сирковий 5%$140г`,	disc:'25%', priceO:'2490', priceN:'1890'},
    // {pic: '28', desc:`Сардельки "Царські"$ТМ"Добрі товари"$100г`, disc:'30%', priceO:'1100', priceN:'770'},
    // {pic: '9', desc:`Ковбаса "Галицька"$ТМ"Світ мяса"$100г`,	disc:'25%', priceO:'1170', priceN:'890'},
    // {pic: '14', desc:`Скумбрія морожена$100г`,	disc:'25%', priceO:'949', priceN:'749'},
    // {pic: '8', desc:`Ікра "Веладіс" тріски$100г`,disc:'30%', priceO:'2590', priceN:'1890'},
    // {pic: '12', desc:`Hапій "Пепсі"$2л`,disc:'XIT', priceO:'2500', priceN:'2190'},
    // {pic: '34', desc:`Вода мінеральна "Карпатська джерельна"$1.5л`,disc:'40%', priceO:'1290', priceN:'790'},
    // {pic: '11', desc:`Пиво "ППБ" Свіжий розлив"$0,65л`, 	disc:'25%', priceO:'1990', priceN:'1490'},
    // {pic: '3a', desc:`Суміш "Весняна Семикомпонента"$ТМ "Ласка"$100г`,	disc:'30%', priceO:'499', priceN:'359'},
    // {pic: '31', desc:`Пельмені "Смаком" домашні свинина$800г`,disc:'30%', priceO:'6750', priceN:'4750'},
    // {pic: '6', desc:`Печиво "Рошен" До кави$185г`,disc:'35%', priceO:'1250', priceN:'850'},
    // {pic: '32', desc:`Чіпси "Лейз"$в асортименті$133г`,disc:'30%', priceO:'3490', priceN:'2490'},
    // {pic: '33', desc:`Сік "Садочок"$в асортименті$0,95л`,disc:'35%', priceO:'2650', priceN:'1690'},
    // {pic: '7', desc:`Чай "Три Слона" чорний$2г*25пак`,	disc:'25%', priceO:'1900', priceN:'1450'},
    // {pic: '35', desc:`Какао-напій" "Несквік"$200гр`,	disc:'25%', priceO:'4200', priceN:'3090'},
    // {pic: '29', desc:`Вафлі "З Халвою"$ТМ "Бондей$100г`,	disc:'30%', priceO:'890', priceN:'640'},
    // {pic: '15', desc:`Грейпфрут`,disc:'XIT', priceO:'', priceN:''},
    // {pic: '40', desc:`Лимон`,disc:'XIT', priceO:'', priceN:''},


]