let dataVid = '15.10'
let dataDo = '05.11';
let base = [

    
    {
        pic: "18",
        desc: `Торт "Вишнева фантазія"$100г`, disc: "40%", priceO :"1500", priceN: "900"
    },
    {
        pic: "22",
        desc: `Торт "Карамельна забава"$100г`, disc: "40%", priceO :"1900", priceN: "1150"
    },
    {
        pic: "17",
        desc: `Круасан "GRAND FOOD"$з пломбіром$100г`, disc: "50%", priceO :"1100", priceN: "550"
    },
    {
        pic: "21",
        desc: `Булочка"Равлик"$100г`, disc: "45%", priceO :"700", priceN: "400"
    },
    {
        pic: "2",
        desc: `Пиріжки з картоплею та грибами$150г`, disc: "50%", priceO :"1000", priceN: "500"
    },
    {
        pic: "3",
        desc: `Пиріжки з квашеною капустою$150г`, disc: "50%", priceO :"1000", priceN: "500"
    },   
    {
        pic: "20", 
        desc: `Хот-дог "GRAND FOOD"$180г`, disc: "50%", priceO :"1900", priceN: "1100"
    },
    {
        pic: "7",
        desc: `Котлети відбивні з філе курки$100г`, disc: "50%", priceO :"2000", priceN: "1200"
    },
    {
        pic: "8",  
        desc: `Котлета  відбивна з телятини$100г`, disc: "50%", priceO :"2000", priceN: "1200"
    },
    {
        pic: "6",
        desc: `Четвертина куряча запечена$100г`, disc: "50%", priceO :"1500", priceN: "970"
    },
    {
        pic: "9",
        desc: `Корейка свинна охолоджена$100г`, disc: "20%", priceO :"1590", priceN: "1300"
    },
    {
        pic: "10",
        desc: `Крила курячі охолоджені$100г`, disc: "20%", priceO :"640", priceN: "520"
    },
{
    pic: "16",
    desc: `Сосиски "Справжні"$ТМ "Тульчин"$100г`, disc: "35%", priceO :"880", priceN: "590"
},
{
    pic: "25",
    desc: `Ковбаса "Мисливська"$TM "Глобино"$100г`, disc: "25%", priceO :"1250", priceN: "950"
},
{
    pic: "19",
    desc: `Сир "Російський"$TM "Любар"$100г`, disc: "25%", priceO :"1400", priceN: "1050"
},
{
    pic: "30",
    desc: `Сир плавлений "Лактіма"$тостовий в асортименті$130г`, disc: "20%", priceO :"2300", priceN: "1800"
},
{
    pic: "24",
    desc: `Десерт сирковий "Фанні" вершковий$150г`, disc: "25%", priceO :"1600", priceN: "1200"
},
{
    pic: "23",
    desc: `Кефір "Ферма" 2,5%$900г`, disc: "15%", priceO :"3000", priceN: "2500"
},
{
    pic: "11",
    desc: `Напій "Лимонадово"$в асортименті$1,42л`, disc: "35%", priceO :"1200", priceN: "800"
},
{
    pic: "1",
    desc: `Мінеральна вода "Шаянська" Заповітна газована та негазована$1,5л`, disc: "25%", priceO :"1300", priceN: "1000"
},
{
    pic: "12",
    desc: `Пиво "ППБ" Свіжий розлив$0,65л`, disc: "20%", priceO :"1800", priceN: "1400"
},
{
    pic: "13",
    desc: `Печиво "Рошен" Есмеральда$в асортименті$170г`, disc: "25%", priceO :"2200", priceN: "1600"
},
{
    pic: "4",
    desc: `Цукерки "Труфальє"$TM "АВК"$140г`, disc: "15%", priceO :"6200", priceN: "5200"
},
{
    pic: "26",
    desc: `Чай "Ловаре" пірамідка$15шт*2г + чайна ложечка`, disc: "25%", priceO :"4400", priceN: "3400"
},
{
    pic: "15",
    desc: `Крупа "Сонцядар"$рис №1 круглий$900г`, disc: "25%", priceO :"3100", priceN: "2400"
},
{
    pic: "14",
    desc: `Сардина "Легенда моря"$в олії$240г`, disc: "25%", priceO :"2200", priceN: "1700"
},
{
    pic: "27a",
    desc: `Салака "Нептун"$пряного посолу$100г`, disc: "25%", priceO :"550", priceN: "420"
},
{
    pic: "5",
    desc: `Рушники кухонні "Боні"$TM "Перфекc" 2-шарові 2 шт.$упаковка`, disc: "20%", priceO :"2800", priceN: "2200"
},
{
    pic: "28",
    desc: `Свічка-лампадка$мала скляна`, disc: "XIT", priceO :"", priceN: "600"
},
{
    pic: "29",
    desc: `Свічка-лампадка$велика скляна`, disc: "XIT", priceO :"", priceN: "1500"
}


]