let base = [
    
{
    size: "2",
    desc: 'Кавун',
    pic: "47",
    priceO:" ",
    priceN:" ",
    disc: 'XIT'
}
,{
    size: "2",
    desc: 'Огірки',
    pic: "48",
    priceO:" ",
    priceN:" ",
    disc: 'XIT'
}
,{
    size: "2",
    desc: 'Цибуля',
    pic: "49",
    priceO:" ",
    priceN:" ",
    disc: 'XIT'
}
,{
    size: "1",
    desc: 'Стейк з ребром$свинний охолоджений$1кг',
    pic:"27",
    priceO:"12499",
    priceN: "10999",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Ребра "Барбекю"$свинні охолоджені$1кг',
    pic:"25",
    priceO:"12999",
    priceN: "10499",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Стейк "Барбекю"$свинний охолоджений$1кг',
    pic:"28",
    priceO:"14999",
    priceN: "11499",
    disc: "25%"
}
,{
    size: "1",
    desc: 'Ребра свинні$охолодженні$1кг',
    pic:"23",
    priceO:"10999",
    priceN: "9999",
    disc: "XIT"
}
,{
    size: "1",
    desc: 'Гомілка "Наша Ряба"$курчат бройл. охолодж.$1кг',
    pic:"24",
    priceO:"5649",
    priceN: "4999",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Фарш свинний$охолоджений$1кг',
    pic:"19",
    priceO:"8999",
    priceN: "7799",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Сир "Канів"$в асортименті$100г',
    pic:"26",
    priceO:"1889",
    priceN: "1509",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Сирочок "Фруктовий" 5%$в асортименті$100г',
    pic:"14",
    priceO:"999",
    priceN: "777",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Сік дитячий "Агуша"$в асортименті$0,2л',
    pic:"2",
    priceO:"999",
    priceN: "749",
    disc: "25%"
}
,{
    size: "1",
    desc: 'Молоко "Слов"яночка" 2,5%$тверда упаковка$1л',
    pic:"13",
    priceO:"2597",
    priceN: "1999",
    disc: "25%"
}
,{
    size: "1",
    desc: 'Сир "Звенигора"$200г',
    pic:"45",
    priceO:"4499",
    priceN: "3599",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Сир плавл "Звенигора"$в асортименті$90г',
    pic:"32",
    priceO:"1597",
    priceN: "1097",
    disc: "30%"
}
,{
    size: "1",
    desc: 'Масло "Українські корівки"$73% солодкове селянське$180г',
    pic:"31",
    priceO:"1899",
    priceN: "1599",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Ковбаса "Банкетна"$в/к н/к "Європродукт"$1шт',
    pic:"33",
    priceO:"4297",
    priceN: "3197",
    disc: "25%"
}
,{
    size: "1",
    desc: 'Сосиски "На пару"$(Бащинський)$1кг',
    pic:"41",
    priceO:"7069",
    priceN: "4994",
    disc: "30%"
}
,{
    size: "1",
    desc: 'Ковбаса "Салямі" варена в/г$порційна "Глобино"$1шт(????)',
    pic:"17",
    priceO:"6599",
    priceN: "5599",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Напій "Лимонадово"$в асортименті$1,42л',
    pic:"7",
    priceO:"899",
    priceN: "699",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Вода мінеральна$"Лужанська-7" (Маргіт)$1.5л',
    pic:"5",
    priceO:"964",
    priceN: "800",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Пиво "Полтава"$Ризьке світле$0,5л',
    pic:"11",
    priceO:"1544",
    priceN: "1244",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Пиво "ППБ"$Свіжий розлив$0,65л',
    pic:"9",
    priceO:"1399",
    priceN: "1199",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Коньяк "Закарпатський"$* * * *$0.5л',
    pic:"10",
    priceO:"15549",
    priceN: "13249",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Майонез "Щедро";$Преміум д/п$350г',
    pic:"3",
    priceO:"2154",
    priceN: "1699",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Крабові палочки "Економ"$200г',
    pic:"18",
    priceO:"1654",
    priceN: "1299",
    disc: "20%"
}
,{
    size: "1",
    desc: "Кукурудза (Green Eko'ol)$425г",
    pic:"1",
    priceO:"1649",
    priceN: "1349",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Какао "Нестле" Hесквік$200г',
    pic:"6",
    priceO:"3649",
    priceN: "2649",
    disc: "30%"
}
,{
    size: "1",
    desc: 'Шоколад "Рошен" з нугою$90г',
    pic:"4",
    priceO:"1484",
    priceN: "1299",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Вафлі "Світоч" Артек$в асортименті$80г',
    pic:"44",
    priceO:"754",
    priceN: "499",
    disc: "35%"
}
,{
    size: "1",
    desc: 'Морозиво "Каштан"$ескімо ваніль (Три ведмеді)$70г',
    pic:"43",
    priceO:"1234",
    priceN: "750",
    disc: "40%"
}
,{
    size: "1",
    desc: 'Скумбрія х/к в/у$"Вомонд"$100г',
    pic:"16",
    priceO:"1499",
    priceN: "1249",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Засіб для миття скла$"Голд Дроп" спирт$750мл',
    pic:"12",
    priceO:"30",
    priceN: "2549",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Фольга "Фрекен Бок"$(Макс)$10м',
    pic:"8",
    priceO:"3674",
    priceN: "2974",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Зошити 18 аркушів$в асортиментіш$1шт',
    pic:"kz1",
    priceO:"349",
    priceN: "275",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Ручка шарикова автомат$в асортименті$?? 1шт ??',
    pic:"kr",
    priceO:"299",
    priceN: "235",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Олівці 12 кольорів$1 упаковка',
    pic:"ko",
    priceO:"1699",
    priceN: "1445",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Фломастери 12 кольорів$1 упаковка',
    pic:"kf",
    priceO:"1624",
    priceN: "1365",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Торт "Іриска"$100г',
    pic:"37",
    priceO:"1349",
    priceN: "799",
    disc: "40%"
}
,{
    size: "1",
    desc: 'Шітемені "Уральські Гори"$100г',
    pic:"35",
    priceO:"1499",
    priceN: "880",
    disc: "40%"
}
,{
    size: "1",
    desc: 'Торт "Наполеон"$100г',
    pic:"34",
    priceO:"999",
    priceN: "599",
    disc: "40%"
}
,{
    size: "1",
    desc: 'Рулет "Сльоза"$100г',
    pic:"36",
    priceO:"1399",
    priceN: "850",
    disc: "40%"
}
,{
    size: "1",
    desc: 'Плетенка "Асорті"$100г',
    pic:"46",
    priceO:"699",
    priceN: "389",
    disc: "45%"
}
,{
    size: "1",
    desc: 'Хліб подовий$"Пшеничний Солодовий"$600г',
    pic:"38",
    priceO:"1599",
    priceN: "1199",
    disc: "25%"
}
,{
    size: "1",
    desc: 'Булочка "Міні Багет"$130г',
    pic:"39",
    priceO:"499",
    priceN: "279",
    disc: "45%"
}
,{
    size: "1",
    desc: 'Сосиска$"Гриль в слоєному тісті"$110г',
    pic:"40",
    priceO:"1299",
    priceN: "714",
    disc: "45%"
}
,{
    size: "1",
    desc: 'Тісто листкове$500г',
    pic:"30",
    priceO:"2499",
    priceN: "1799",
    disc: "30%"
}
,{
    size: "1",
    desc: 'Крученики$100г',
    pic:"42",
    priceO:"899",
    priceN: "549",
    disc: "40%"
}
,{
    size: "1",
    desc: 'Помідори "По Італійськи"$100г',
    pic:"22",
    priceO:"1499",
    priceN: "599",
    disc: "60%"
}
,{
    size: "1",
    desc: 'Печінка смажена з цибулею$100г',
    pic:"21",
    priceO:"999",
    priceN: "549",
    disc: "45%"
}
,{
    size: "1",
    desc: 'Гомілка куряча запечена$"Наша Ряба"$100г',
    pic:"20",
    priceO:"1599",
    priceN: "889",
    disc: "45%"
}
,{
    size: "3",
    desc: 'Багет "GRAND FOOD" в асортименті 230г',
    pic:"baner",
    priceO:"2299",
    priceN: "1499",
    disc: "35%"
}
]