let base = [
    
{
    size: "2",
    desc: 'Кавун',
    pic: "47",
    priceO:" ",
    priceN: " ",
    disc: 'XIT'
}
,{
    size: "2",
    desc: 'Огірки',
    pic: "48",
    priceO:" ",
    priceN: " ",
    disc: 'XIT'
}
,{
    size: "2",
    desc: 'Цибуля',
    pic: "49",
    priceO:" ",
    priceN: " ",
    disc: 'XIT'
}
,{
    size: "1",
    desc: 'Помідори "По Італійськи"$1кг',
    pic:"22",
    priceO:"14999",
    priceN: "59,99",
    disc: "60%"
}
,{
    size: "1",
    desc: 'Печінка смажена з цибулею$1кг',
    pic:"21",
    priceO:"9999",
    priceN: "54,99",
    disc: "45%"
}
,{
    size: "1",
    desc: 'Гомілка куряча запечена$"Наша Ряба"$1кг',
    pic:"20",
    priceO:"15999",
    priceN: "88,99",
    disc: "45%"
}
,{
    size: "1",
    desc: 'Стейк з ребром$свинний охолоджений$1кг',
    pic:"27",
    priceO:"12499",
    priceN: "109,99",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Ребра "Барбекю"$свинні охолоджені$1кг',
    pic:"25",
    priceO:"12999",
    priceN: "104,99",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Стейк "Барбекю"$свинний охолоджений$1кг',
    pic:"28",
    priceO:"14999",
    priceN: "114,99",
    disc: "25%"
}
,{
    size: "1",
    desc: 'Ребра свинні$охолодженні$1кг',
    pic:"23",
    priceO:"10999",
    priceN: "99,99",
    disc: "XIT"
}
,{
    size: "1",
    desc: 'Гомілка "Наша Ряба"$курчат бройл. охолодж.$1кг',
    pic:"24",
    priceO:"5649",
    priceN: "49,99",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Фарш свинний$охолоджений$1кг',
    pic:"19",
    priceO:"8999",
    priceN: "77,99",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Сир "Канів"$в асортименті$1кг',
    pic:"26",
    priceO:"18899",
    priceN: "150,99",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Сирочок "Фруктовий" 5%$в асортименті$100г',
    pic:"14",
    priceO:"999",
    priceN: "7,77",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Сік дитячий "Агуша"$в асортименті$0,2л',
    pic:"2",
    priceO:"999",
    priceN: "7,49",
    disc: "25%"
}
,{
    size: "1",
    desc: 'Молоко "Слов"яночка" 2,5%$тверда упаковка$1л',
    pic:"13",
    priceO:"2597",
    priceN: "19,99",
    disc: "25%"
}
,{
    size: "1",
    desc: 'Сир "Звенигора"$200г',
    pic:"45",
    priceO:"4499",
    priceN: "35,99",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Сир плавл "Звенигора"$в асортименті$90г',
    pic:"32",
    priceO:"1597",
    priceN: "10,97",
    disc: "30%"
}
,{
    size: "1",
    desc: 'Масло "Українські корівки"$73% солодкове селянське$180г',
    pic:"31",
    priceO:"1899",
    priceN: "15,99",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Ковбаса "Банкетна"$в/к н/к "Європродукт"$1шт',
    pic:"33",
    priceO:"4297",
    priceN: "31,97",
    disc: "25%"
}
,{
    size: "1",
    desc: 'Сосиски "На пару"$(Бащинський)$1кг',
    pic:"41",
    priceO:"7069",
    priceN: "49,94",
    disc: "30%"
}
,{
    size: "1",
    desc: 'Ковбаса "Салямі" варена в/г$порційна "Глобино"$1шт(????)',
    pic:"17",
    priceO:"6599",
    priceN: "55,99",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Напій "Лимонадово"$в асортименті$1,42л',
    pic:"7",
    priceO:"899",
    priceN: "6,99",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Вода мінеральна$"Лужанська-7" (Маргіт)$1.5л',
    pic:"5",
    priceO:"964",
    priceN: "8,00",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Пиво "Полтава"$Ризьке світле$0,5л',
    pic:"11",
    priceO:"1544",
    priceN: "12,44",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Пиво "ППБ"$Свіжий розлив$0,65л',
    pic:"9",
    priceO:"1399",
    priceN: "11,99",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Коньяк "Закарпатський"$* * * *$0.5л',
    pic:"10",
    priceO:"15549",
    priceN: "132,49",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Майонез "Щедро";$Преміум д/п$350г',
    pic:"3",
    priceO:"2154",
    priceN: "16,99",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Крабові палочки "Економ"$200г',
    pic:"18",
    priceO:"1654",
    priceN: "12,99",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Кукурудза$?? ключ? ??$?? обєм? вага? ??',
    pic:"1",
    priceO:"1649",
    priceN: "13,49",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Какао "Нестле" Hесквік$200г',
    pic:"6",
    priceO:"3649",
    priceN: "26,49",
    disc: "30%"
}
,{
    size: "1",
    desc: 'Шоколад "Рошен" з нугою$90г',
    pic:"4",
    priceO:"1484",
    priceN: "12,99",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Вафлі "Світоч" Артек$в асортименті$80г',
    pic:"44",
    priceO:"754",
    priceN: "4,99",
    disc: "35%"
}
,{
    size: "1",
    desc: 'Морозиво "Каштан"$ескімо ваніль (Три ведмеді)$70г',
    pic:"43",
    priceO:"1234",
    priceN: "7,50",
    disc: "40%"
}
,{
    size: "1",
    desc: 'Скумбрія х/к в/у$"Вомонд"$1кг',
    pic:"16",
    priceO:"14999",
    priceN: "124,99",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Засіб для миття скла$"Голд Дроп" спирт$750мл',
    pic:"12",
    priceO:"30",
    priceN: "25,49",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Фольга "Фрекен Бок"$(Макс)$10м',
    pic:"8",
    priceO:"3674",
    priceN: "29,74",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Зошити 18 аркушів$в асортименті',
    pic:"kz1",
    priceO:"349",
    priceN: "2,75",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Ручка шарикова автомат$в асортименті',
    pic:"kr",
    priceO:"299",
    priceN: "2,35",
    disc: "20%"
}
,{
    size: "1",
    desc: 'Олівці 12 кольорів$1шт',
    pic:"ko",
    priceO:"1699",
    priceN: "14,45",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Фломайстери 12 кольорів$1шт',
    pic:"kf",
    priceO:"1624",
    priceN: "13,65",
    disc: "15%"
}
,{
    size: "1",
    desc: 'Торт "Іриска"$1кг',
    pic:"37",
    priceO:"13499",
    priceN: "79,99",
    disc: "40%"
}
,{
    size: "1",
    desc: 'Шітемені "Уральські Гори"$1кг',
    pic:"35",
    priceO:"14999",
    priceN: "88,00",
    disc: "40%"
}
,{
    size: "1",
    desc: 'Торт "Наполеон"$1кг',
    pic:"34",
    priceO:"9999",
    priceN: "59,99",
    disc: "40%"
}
,{
    size: "1",
    desc: 'Рулет "Сльоза"$1кг',
    pic:"36",
    priceO:"13999",
    priceN: "85,00",
    disc: "40%"
}
,{
    size: "1",
    desc: 'Плетенка "Асорті"$100г',
    pic:"46",
    priceO:"699",
    priceN: "3,89",
    disc: "45%"
}
,{
    size: "1",
    desc: 'Хліб подовий$"Пшеничний Солодовий"$600г',
    pic:"38",
    priceO:"1599",
    priceN: "11,99",
    disc: "25%"
}
,{
    size: "1",
    desc: 'Булочка "Міні Багет"$130г',
    pic:"39",
    priceO:"499",
    priceN: "2,79",
    disc: "45%"
}
,{
    size: "1",
    desc: 'Сосиска$"Гриль в слоєному тісті"$110г',
    pic:"40",
    priceO:"1299",
    priceN: "7,14",
    disc: "45%"
}
,{
    size: "1",
    desc: 'Тісто листкове$500г',
    pic:"30",
    priceO:"2499",
    priceN: "17,99",
    disc: "30%"
}
,{
    size: "1",
    desc: 'Крученики$1кг',
    pic:"42",
    priceO:"8999",
    priceN: "54,99",
    disc: "40%"
}
,{
    size: "3",
    desc: 'Багет "GRAND FOOD" в асортименті 230г',
    pic:"baner",
    priceO:"2299",
    priceN: "14,99",
    disc: "35%"
}
]