let dataVid='21.12'
let dataDo = '10.01';
let base = [

// ,
{
    pic: "18",
    desc: `Креветки "Полар Стар"$очищені$200г                    	`,
    disc: "25%",
    priceO: "9899",
    priceN: "7399",
    sf: "3",
    size: "1"
},
{
    pic: "21",
    desc: `Крабові палочки$"Eконом"$200г                                 	`,
    disc: "25%",
    priceO: "1774",
    priceN: "1374",
    sf: "2",
    size: "1"
},
{
    pic: "57",
    desc: `Сьомга "Флотилія" філе$в асортименті$130г              	`,
    disc: "25%",
    priceO: "11579",
    priceN: "8399",
    sf: "5",
    size: "1"
},
{
    pic: "39",
    desc: `Оселедець "Океан"$в олії$450г                               	`,
    disc: "25%",
    priceO: "5374",
    priceN: "3950",
    sf: "8",
    size: "1"
},
{
    pic: "56",
    desc: `Мандарин`,
    disc: "XIT",
    priceO: " ",
    priceN: " ",
    sf: "7",
    size: "1"
},
{
    pic: "55",
    desc: `Апельсин`,
    disc: "XIT",
    priceO: " ",
    priceN: " ",
    sf: "9",
    size: "1"
},
{
    pic: "54",
    desc: `Сир Королівський$100г`,
    disc: "20%",
    priceO: "2129",
    priceN: "1750",
    sf: "2",
    size: "1"
},
{
    pic: "53",
    desc: `Сир "Російський"$TM"Скарби Прикарпаття"$100г`,
    disc: "25%",
    priceO: "1260",
    priceN: "960",
    sf: "7",
    size: "1"
},
{
    pic: "30",
    desc: `Сир плавлений$"Ферма" 55%$90г`,
    disc: "20%",
    priceO: "1449",
    priceN: "1149",
    sf: "8",
    size: "1"
},
{
    pic: "29",
    desc: `Сир плавлений$"Весела корівка"$90г`,
    disc: "30%",
    priceO: "1749",
    priceN: "1249",
    sf: "9",
    size: "1"
},
{
    pic: "28",
    desc: `Масло "Срібне"$солодковершкове 73%$200г`,
    disc: "20%",
    priceO: "2200",
    priceN: "1799",
    sf: "1",
    size: "1"
},
{
    pic: "52",
    desc: `Сир кисломолочний$"Ружин-молоко"18%$100г`,
    disc: "15%",
    priceO: "529",
    priceN: "460",
    sf: "2",
    size: "1"
},
{
    pic: "34",
    desc: `Ковбаса "Олів'є"$варена ТМ"Глобино"$500г`,
    disc: "20%",
    priceO: "4200",
    priceN: "3350",
    sf: "9",
    size: "1"
},
{
    pic: "35",
    desc: `Ковбаса "Баварська"$ТМ "Глобино"$100г`,
    disc: "25%",
    priceO: "1670",
    priceN: "1290",
    sf: "1",
    size: "1"
},
{
    pic: "36",
    desc: `Ковбаса "Золотиста"$ТМ "Світ мяса"$100г`,
    disc: "15%",
    priceO: "1899",
    priceN: "1539",
    sf: "2",
    size: "1"
},
{
    pic: "20",
    desc: `Майонез "Кухар Рішельє"$олівє 50%$360г`,
    disc: "30%",
    priceO: "1724",
    priceN: "1224",
    sf: "2",
    size: "1"
},
{
    pic: "19",
    desc: `Кукурудза "Греен Екоол"$цукрова з цілих зерен$425г`,
    disc: "35%",
    priceO: "2099",
    priceN: "1399",
    sf: "8",
    size: "1"
},
{
    pic: "49",
    desc: `Горошок "ЕкоСвіт"$зелений$425г`,
    disc: "40%",
    priceO: "1499",
    priceN: "949",
    sf: "7",
    size: "1"
},
{
    pic: "48",
    desc: `Гриби шампіньйони$"Щедрий фермер" мариновані$480мл`,
    disc: "20%",
    priceO: "4900",
    priceN: "3890",
    sf: "9",
    size: "1"
},
{
    pic: "16",
    desc: `Гірчиця "Торчин"$в асортименті$140г      	`,
    disc: "25%",
    priceO: "1199",
    priceN: "899",
    sf: "7",
    size: "1"
}
,
{
    pic: "50",
    desc: `Чай "Ахмад"$Класичний Чорний$25 х 2г`,
    disc: "25%",
    priceO: "2699",
    priceN: "1999",
    sf: "5",
    size: "1"
},
{
    pic: "26",
    desc: `Печиво "Орео"$з подвійною начинкою$170г`,
    disc: "25%",
    priceO: "4499",
    priceN: "3399",
    sf: "2",
    size: "1"
},
{
    pic: "27",
    desc: `Цукерки "Тоффіфе"$125г`,
    disc: "20%",
    priceO: "6789",
    priceN: "5290",
    sf: "3",
    size: "1"
},
{
    pic: "51",
    desc: `Шоколад "Мілка"$в асортименті$100г`,
    disc: "15%",
    priceO: "2699",
    priceN: "2300",
    sf: "4",
    size: "1"
},
{
    pic: "23",
    desc: `Горілка "Абсолют"$0,5л`,
    disc: "20%",
    priceO: "23500",
    priceN: "18500",
    sf: "5",
    size: "1"
},
{
    pic: "15",
    desc: `Горілка "Гранд Резерв"$Унгвар 40%$0,5л`,
    disc: "XIT",
    priceO: " ",
    priceN: "8940",
    sf: "2",
    size: "1"
},
{
    pic: "9",
    desc: `Коньяк "Закарпатський" 4*$0.5л`,
    disc: "15%",
    priceO: "17394",
    priceN: "14994",
    sf: "4",
    size: "1"
},
{
    pic: "22",
    desc: `Віскі "Джеймсон"$ірландський$0,5л`,
    disc: "20%",
    priceO: "44299",
    priceN: "35900",
    sf: "7",
    size: "1"
},
{
    pic: "14",
    desc: `Віскі "Джім Бім"$бурбон$0,5л`,
    disc: "20%",
    priceO: "44999",
    priceN: "34900",
    sf: "8",
    size: "1"
},
{
    pic: "10",
    desc: `Вино "Вілла Крім"$Мускат рожеве$0,75л`,
    disc: "20%",
    priceO: "6069",
    priceN: "4990",
    sf: "3",
    size: "1"
},
{
    pic: "11",
    desc: `Шампанське "Аір Київ"$в асортименті$0,75л         	`,
    disc: "30%",
    priceO: "8900",
    priceN: "6400",
    sf: "1",
    size: "1"
},
{
    pic: "13",
    desc: `Пиво "ППБ"$Свіжий розлив$0,65л`,
    disc: "20%",
    priceO: "1599",
    priceN: "1299",
    sf: "4",
    size: "1"
},
{
    pic: "59",
    desc: `Пиво "Гамбрінус" оригінал$0,5л`,
    disc: "20%",
    priceO: "2499",
    priceN: "1999",
    sf: "3",
    size: "1"
},
{
    pic: "12",
    desc: `Напій "Лимонадово"$в асортименті$1,42л`,
    disc: "35%",
    priceO: "1170",
    priceN: "770",
    sf: "1",
    size: "1"
},
{
    pic: "7",
    desc: `Мінеральна вода$Лужанська-7 ТМ"Маргіт"$1,5л`,
    disc: "20%",
    priceO: "999",
    priceN: "800",
    sf: "2",
    size: "1"
},
{
    pic: "17",
    desc: `Нектар "Садочок" персик, мультивіт., виногр.-яблуч.$0,95л                    	`,
    disc: "20%",
    priceO: "2399",
    priceN: "1949",
    sf: "5",
    size: "1"
},
{
    pic: "38",
    desc: `Серветки "Прок"$Новорічні 18шт$упаковка`,
    disc: "20%",
    priceO: "1699",
    priceN: "1399",
    sf: "2",
    size: "1"
},
{
    pic: "24",
    desc: `Рукав для запікання$TM "Прок"`,
    disc: "20%",
    priceO: "1499",
    priceN: "1199",
    sf: "3",
    size: "1"
},
{
    pic: "61",
    desc: `Фольга "Макс"$ТМ "Фрекен Бок" 10м`,
    disc: "30%",
    priceO: "3784",
    priceN: "2684",
    sf: "4",
    size: "1"
},
{
    pic: "25",
    desc: `Пергамент для випікання$ТМ "Фрекен Бок" 5м`,
    disc: "30%",
    priceO: "2454",
    priceN: "1700",
    sf: "5",
    size: "1"
}



,
{
    pic: "5",
    desc: `Корейка свинна охолоджена$100г`,
    disc: "XIT",
    priceO: "1499",
    priceN: "1349",
    sf: "4",
    size: "1"
},
{
    pic: "1",
    desc: `Шашлик "По-селянськи" свинний$100г`,
    disc: "XIT",
    priceO: "1500",
    priceN: "1249",
    sf: "5",
    size: "1"
},
{
    pic: "6",
    desc: `Фарш свинний охолоджений$100г`,
    disc: "25%",
    priceO: "1049",
    priceN: "799",
    sf: "8",
    size: "1"
},
{
    pic: "3",
    desc: `Четвертина куряча$запечена$100г`,
    disc: "40%",
    priceO: "1499",
    priceN: "899",
    sf: "9",
    size: "1"
},
{
    pic: "2",
    desc: `Четвертина куряча охолоджена$100г`,
    disc: "XIT",
    priceO: "519",
    priceN: "469",
    sf: "5",
    size: "1"
},
{
    pic: "4",
    desc: `Салат "Увертюра"$100г`,
    disc: "40%",
    priceO: "1599",
    priceN: "949",
    sf: "2",
    size: "1"
},
{
    pic: "40",
    desc: `Салат "Морква по-корейськи",$"Буряк маринований з хріном$100г`,
    disc: "45%",
    priceO: "649",
    priceN: "349",
    sf: "1",
    size: "1"
},
{
    pic: "46",
    desc: `Салат "Морква по-корейськи",$"Буряк маринований з хріном"$450г та 500г`,
    disc: "45%",
    priceO: "3599",
    priceN: "2000",
    sf: "2",
    size: "1"
},
{
    pic: "47",
    desc: `Паніні "GRAND FOOD"$в асортименті$200г`,
    disc: "35%",
    priceO: "2399",
    priceN: "1599",
    sf: "8",
    size: "1"
}

]

