let dataVid = '16.11'
let dataDo = '06.12';
let base = [
      
    {
      pic: '60', desc: `Багет$400г`,	disc: '35%',	priceO: '1200',	priceN: '790'},
    {
      pic: '0', desc: `Хлібець "На живій зквасці" житній 300г (новинка)`,	disc: '20%',	priceO: '1200',	priceN: '990'},
    {
      pic: '12', desc: `Хлібець "На живій зквасці"$бездріжджовий вищий гатунок$500г`,	disc: '20%',	priceO: '1700',	priceN: '1390'},
    {
      pic: '56', desc: `Булочка "Творожно-вишнева"$100г`,	disc: '40%',	priceO: '900',	priceN: '550'},
    {
      pic: '62', desc: `Круасн шоколадний "GRAND FOOD" з заварним кремом 100г`,	disc: '50%',	priceO: '1600',	priceN: '790'},
    {
      pic: '57', desc: `Слойка "GRAND FOOD"$зі сливою та горіхом$110г`,	disc: '45%',	priceO: '1400',	priceN: '790'},
    {
      pic: '5', desc: `Тісто "GRAND FOOD" листкове в асортименті$500г`,	disc: '25%',	priceO: '3000',	priceN: '2250'},
    {
      pic: '2', desc: `Торт "Королівський"$100г`,	disc: '40%',	priceO: '1300',	priceN: '799'},
    {
      pic: '3', desc: `Торт "Горіхова насолода"$100г`,	disc: '40%',	priceO: '1400',	priceN: '799'},
    {
      pic: '4', desc: `Торт "Лимонно-Маковий"$100г`,	disc: '40%',	priceO: '1400',	priceN: '799'},
    {
      pic: '6', desc: `Круасан "GRAND FOOD"$в асортименті$200г`,	disc: '40%',	priceO: '2500',	priceN: '1490'},
    {
      pic: '53', desc: `Рулет з ковбасою$100г`,	disc: '35%',	priceO: '2600',	priceN: '1690'},
    {
      pic: '54', desc: `Рулет з омлетом$100г`,	disc: '35%',	priceO: '2600',	priceN: '1690'},
    {
      pic: '55', desc: `Рулет Царський$100г`,	disc: '35%',	priceO: '2600',	priceN: '1690'},
    {
      pic: '63', desc: `Салат "Увертюра" пісний, кг`,	disc: '40%',	priceO: '14500',	priceN: '8900'},
    {
      pic: '8', desc: `Салат "Буряк маринований з хріном"$500г`,	disc: '35%',	priceO: '3000',	priceN: '1900'},
    {
      pic: '7', desc: `Салат "Морква по корейськи"$450г`,	disc: '30%',	priceO: '2500',	priceN: '1700'},
    {
      pic: '16', desc: `Курча Гриль$100г`,	disc: '25%',	priceO: '1300',	priceN: '990'},
    {
      pic: '28', desc: `Філе куряче охолоджене$100г`, disc: 'XIT',	priceO: '1030',	priceN: '890'},
    {
      pic: '13', desc: `Шинка свинна охолоджена$100г`,	disc: '15%',	priceO: '1250',	priceN: '990'},
    {
      pic: '17', desc: `Фарш свинний охолоджений$100г`,	disc: '15%',	priceO: '1070',	priceN: '890'},
    {
      pic: '11', desc: `Шашлик в маринаді "Арізона"$свинний з ошийка$100г`,	disc: '20%',	priceO: '1900',	priceN: '1520'},
    {
      pic: '29', desc: `Гомілка куряча охолоджена$100г`,	disc: 'XIT',	priceO: '540',	priceN: '480'},
    {
      pic: '43', desc: `Креветки "Полар Стар" очищені$200г`,	disc: '45%',	priceO: '10600',	priceN: '6000'},
    {
      pic: '42', desc: `Ікра "Сахалінская" лососева зерниста$140г`,	disc: '25%',	priceO: '10000',	priceN: '7700'},
    {
      pic: '51', desc: `Сьомга "Флотилія" філе шматок$в асортименті$130г`,	disc: '0%',	priceO: '10100',	priceN: '000'},
    {
      pic: '1', desc: `Оселедець "Океан" в олії$450г`,	disc: '10%',	priceO: '5000',	priceN: '3900'},
    {
      pic: '23', desc: `Крабові палочки Єконом$200г`,	disc: '25%',	priceO: '2200',	priceN: '1700'},
    {
      pic: '40', desc: `Сир плавлений "Ферма"$в асортименті$90г`,	disc: '20%',	priceO: '1600',	priceN: '1300'},
    {
      pic: '41', desc: `Сир плавлений "Дружба"$90г`,	disc: '25%',	priceO: '400',	priceN: '300'},
    {
      pic: '61', desc: `Сир кисломолочний "Ружин-молоко" 18%$100г`,	disc: '15%',	priceO: '580',	priceN: '500'},
    {
      pic: '25', desc: `Сир "Королівський"$100г`,	disc: '15%',	priceO: '2050',	priceN: '1790'},
    {
      pic: '15', desc: `Сир "Голландський", "Російський" TM"Охтирка"$100г`,	disc: '20%',	priceO: '1380',	priceN: '1080'},
    {
      pic: '24', desc: `Сметана "Презедент" 20%$350г`,	disc: '25%',	priceO: '3700',	priceN: '2700'},
    {
      pic: '14', desc: `Масло "Вершкова долина"$200г`,	disc: '0%',	priceO: '2600',	priceN: '000'},
    {
      pic: '9', desc: `Яйця Домашній смак$ ТМ "Ясенсвіт"$10шт`,	disc: '15%',	priceO: '2800',	priceN: '2400'},
    {
      pic: '59', desc: `Ковбаса "Олів’є" варена$ТМ "Глобино"/$500г`,	disc: '25%',	priceO: '4300',	priceN: '3300'},
    {
      pic: '39', desc: `Ковбаса "Магурська"$ТМ "Світ мяса"$100г`,	disc: '0%',	priceO: '1190',	priceN: '000'},
    {
      pic: '52', desc: `Шинка "Домашня" TM"Родина"$100г`,	disc: '15%',	priceO: '1700',	priceN: '1420'},
    {
      pic: '49', desc: `Hапій "Кока-кола"$2л`,	disc: '20%',	priceO: '3300',	priceN: '2600'},
    {
      pic: '50', desc: `Сік "Драгун" смак 100%$3л`,	disc: '15%',	priceO: '9400',	priceN: '7900'},
    {
      pic: '21', desc: `Hапій "Пепсі"$2л`,	disc: '20%',	priceO: '3300',	priceN: '2600'},
    {
      pic: '45', desc: `Пиво "Кроненбург" Бланк$0.46л`,	disc: '25%',	priceO: '3000',	priceN: '2200'},
    {
      pic: '22', desc: `Пиво "ППБ" Закарпатське$0.5л `,	disc: '25%',	priceO: '1600',	priceN: '1200'},
    {
      pic: '19', desc: `Вино "Вілла Крім" Мускат рожеве$0,75л`,	disc: '20%',	priceO: '7000',	priceN: '5500'},
    {
      pic: '18', desc: `Коньяк "Закарпатський" 4*$0.5л `,	disc: '15%',	priceO: '17500',	priceN: '15000'},
    {
      pic: '46', desc: `Горілка "Грін Дей" органік$0,5л `,	disc: '0%',	priceO: '9000',	priceN: '000'},
    {
      pic: '48', desc: `Віскі "Джемесон" ірландський$0,5л `,	disc: '30%',	priceO: '49900',	priceN: '35000'},
    {
      pic: '44', desc: `Віскі "Балентайнс"$0,5л `,	disc: '30%',	priceO: '43300',	priceN: '29500'},
    {
      pic: '47', desc: `Шампанське "КЗШВ" Советовское$0,75л `,	disc: 'XIT',	priceO: '000',	priceN: '000'},
    {
      pic: '58', desc: `Майонез "Чумак" справжній 72%$350г`,	disc: '25%',	priceO: '2600',	priceN: '1900'},
    {
      pic: '38', desc: `Асорті овочеве "Ямар"$(морква, горошок,кукурудза)$470г`,	disc: '20%',	priceO: '3800',	priceN: '3000'},
    {
      pic: '20', desc: `Кукурудза "Екоол" цукрова$340г`,	disc: '20%',	priceO: '1900',	priceN: '1500'},
    {
      pic: '37', desc: `Шампіньйони "Бел Густо"$314мл`,	disc: '0%',	priceO: '3000',	priceN: '000'},
    {
      pic: '30', desc: `Цукерки "Тоффіфе"$125г`,	disc: '30%',	priceO: '7200',	priceN: '5200'},
    {
      pic: '33', desc: `Гірчиця та Хрін "Верес"$в асортименті$130г`,	disc: '0%',	priceO: '1100',	priceN: '000'},
    {
      pic: '34', desc: `Серветки "Кіт Домовіт" новорічні$в асортименті$18шт`,	disc: '25%',	priceO: '2300',	priceN: '1700'},
    {
      pic: '35', desc: `Пергамент "ФрекенБок"$5м`,	disc: '30%',	priceO: '2800',	priceN: '1900'},
    {
      pic: '36', desc: `Фольга "Кіт Домовіт"$алюмінієва$10м  `,	disc: '0%',	priceO: '3300',	priceN: '000'},
    {
      pic: '32', desc: `Бісквіт шоколадний Барні Фан Сендвіч з начинкою$180г`,	disc: '0%',	priceO: '000',	priceN: '000'},
    {
      pic: '0', desc: `Мінеральна вода "Маргіт" Лужанська-7, 1,5л `,	disc: '0%',	priceO: '1100',	priceN: '000'},
    {
      pic: '31', desc: `Шоколад "Мілка"$в асортименті$100г`,	disc: '0%',	priceO: '000',	priceN: '000'},
    {
      pic: '10', desc: `Сухарики крутони ТМ"Герчак"$в аортименті$100г`,	disc: '0%',	priceO: '1200',	priceN: '000'},
    {
      pic: '27', desc: `Мандарин`,	disc: 'XIT',	priceO: '',	priceN: ''},
    {
      pic: '26', desc: `Апельсин`,	disc: 'XIT',	priceO: '',	priceN: ''},
    
  
    
]