document.addEventListener("DOMContentLoaded", go);

let db = [     	

    {atr:0, name: `Випічка Прісна сирно-м'ясна`},
    {atr:'30021', name:	`Булочка "Апетитна" 100г`,                                     	img:'45'},
    {atr:'42239', name:	`Булочка "З кетчупом та сиром" 80г`,                           	img:'43'},
    {atr:'24792', name:	`Булочка "Сирна Палочка" 90г`,                                 	img:'46'},
    {atr:'42277', name:	`Котлета "Домашня" в тісті 100г`,                              	img:'48'},
    {atr:'17869', name:	`Міні багет "По домашньому" 200г`,                             	img:'44'},
    {atr:'70509', name:	`Печиво "Соленики", 200г`,                                     	img:'69'},
    {atr:'20735', name:	`Пиріжки з картоплею та грибами 150г`,                          img:'179'},
    {atr:'20413', name:	`Пиріжки з квашеною капустою 150г`,                             img:'183'},
    {atr:'21255', name:	`Погачі "Слоєні зі шкварками ,кг`,                             	img:'70'},
    {atr:'864', name:	`Сосиска в тісті 100г`,                                        	img:'53'},
    {atr:'61671', name:	`Чіабата 100г`,                                                	img:'42'},

    {atr:0, name: `Хліб`},
    {atr:'21977', name:	`Хлібець "Бородіно" 400г`,                                      img:'180'},
    {atr:'29961', name:	`Хлібець "Житній з насінням соняшника" 350г`,                   img:'175'},
    {atr:'29671', name:	`Хлібець "Житній" з насінням гарбуза 350г`,        	            img:'171'},
    {atr:'16291', name:	`Хлібець "Житній" з тмином 350г`,                               img:'182'},
    {atr:'29250', name:	`Хлібець "Заварний" 400г`,                                     	img:'161'},
    {atr:'54453', name:	`Хлібець "Кукурудзяний" 400г`,                                  img:'172'},
    {atr:'2163', name:	`Хлібець "Пшеничний"  400г`,                                   	img:'2'},
    {atr:'42275', name:	`Хлібець "Пшеничний" 300г`,                          	        img:'1'},
    {atr:'25142', name:	`Хлібець житній на живій заквасці 300г`,                        img:'159'},

    {atr:0, name: `Кнедлі,Гомбовці`},
    {atr:'47903', name:	`Гомбовці "До посту"з повидлом,100г`,                          	img:'60'},
    {atr:'47902', name:	`Кнедлі "До посту" 250г`,                                      	img:'71'},            
            
    {atr:0, name: `Прісна`},
    {atr:'18721', name:	`Багет 250г`,                                                  	img:'23'},
    {atr:'24916', name:	`Багет 400г`,                                                  	img:'24'},
    {atr:'909', name:	`Батон "Сезамовий", 200г`,                                     	img:'17'},
    {atr:'2348', name:	`Булочка " З маком" 120г`,                                     	img:'9'},
    {atr:'24753', name:	`Булочка "До бульйону" 50г`,                           	        img:'178'},
    {atr:'18743', name:	`Булочка "До гамбургера" 120г`,                                	img:'16'},
    {atr:'57532', name:	`Булочка "До хот-дога з конжутом" 90 г`,                img:'0'},
    {atr:'69191', name:	`Булочка "До хот-дога" 90 г`,                           img:'0'},
    {atr:'907', name:	`Булочка "З сезамом" 80г`,                                     	img:'16'},
    {atr:'33526', name:	`Булочка "Кавове зерно" 30г`,                                  	img:'12'},
    {atr:'3000', name:	`Булочка "Міні Багет" 130г`,                                   	img:'14'},
    {atr:'46720', name:	`Заготовка для піци 150г`,                                     	img:'13'},
    {atr:'3388', name:	`Міні батон сезамовий 150г`,                                   	img:'18'},
    {atr:'16324', name:	`Паличка з тмином 80г`,                                        	img:'47'},
    {atr:'42252', name:	`Плетенка з сезамом 350г`,                                     	img:'15'},
    {atr:'24756', name:	`Булочка "Пампушки з часником " 225г`,                         	img:'10'},
    {atr:'15709', name:	`Рогалик прісний 100г`,                                        	img:'11'},
    {atr:'16951', name:	`Рогалик прісний з повидлом 120г`,                             	img:'8'},
    {atr:'864', name:	`Сосиска в тісті 100г`,                                        	img:'53'},
    {atr:'61671', name:	`Чіабата 100г`,                                                 img:'42'},

    {atr:0, name: `Хліб подовий`},
    {atr:'17051', name:	`Хліб "Пшеничний"  600г`,                                                               img:'6'},
    {atr:'	Хлiб', name:`Пшенично солодовий 600г`,                                                              img: '0'},
    {atr:'18192', name:	`Хлібець "Кукурудзяний" подовий    450г`,      	                                        img:'154'},
    {atr:'55124', name:	`Батон  бездріжджовий  на італійській заквасці житньо пшеничний 500г`,                  img:'155'},
    {atr:'33368', name:	`Хліб "Пшенично- солодовий "600 г`,                                                     img:'156'},
    {atr:'65938', name:	`Хліб Бездріжджовий Гречаний  подовий 400 г`,                                           img:'157'},
    {atr:'74991', name:	`Хліб на живій заквасці бездріжджовий подовий вищого гатунок 500 г`,                    img:'185'},
    {atr:'63900', name:	`Батон бездріжджовий на італійській заквасці вищого гатунку подовий 400г`,              img:'158'},
    {atr:'24752', name:	`Батон "Нарізний" подовий 300г`,                                                        img:'19'},
    {atr:'15102', name:	`Хлібeць"Святковий"житній подовий  500г`,                                               img:'188'},
    {atr:'33369', name:	`Хліб"Сонечко"подовий 600г`,                                                            img:'187'},
    {atr:'33348', name:	`Батон "Угорський"подовий 700г`,                                                        img:'189'},
            
    {atr:0, name: `Випічка Здобна`},
    {atr:'24798', name:	`Булка "Виставочна" 250г`,                              img:'0'},
    {atr:'42253', name:	`Булка "Калач з маком" 350г`,                                  	img:'4'},
    {atr:'24796', name:	`Булка"Макова ромашка" 430г`,                                  	img:'38'},
    {atr:'24755', name:	`Булочка "Ватрушка з творогом" 120г`,                          	img:'5'},
    {atr:'2747', name:	`Булочка "Дорожна" 100г`,                                      	img:'6'},
    {atr:'1713', name:	`Булочка "З вишнями" 100г`,                                    	img:'33'},
    {atr:'56032', name:	`Булочка "З сливою" 90г`,                                      	img:'29'},
    {atr:'7308', name:	`Булочка "Кавова" 90г`,                                        	img:'64'},
    {atr:'33356', name:	`Булочка "Конверт з творогом"100г`,                            	img:'26'},
    {atr:'17871', name:	`Булочка "Конверт з яблуками" 110г`,                           	img:'25'},
    {atr:'860', name:	`Булочка "Плюшка" 100г`,                                       	img:'35'},
    {atr:'15133', name:	`Булочка "Равлик" 100г`,                                       	img:'32'},
    {atr:'46258', name:	`Булочка "Сніжок" 80г`,                                        	img:'65'},
    {atr:'1568', name:	`Булочка "Тріо" 120г`,                                         	img:'37'},
    {atr:'1035', name:	`Булочка "Українська" 100г`,                                   	img:'28'},
    {atr:'1004', name:	`Булочка "Шоколадно-кокосова" 80г`,                            	img:'63'},
    {atr:'3726', name:`Коровай "Весільний", кг`,                                        img:'169'},
    {atr:'35957', name:`Перець Весільний, кг`,                                  img:'0'},
    {atr:'35889', name:	`Пиріг "Домашній з творогом" 500г`,                           	img:'39'},
    {atr:'42240', name:	`Пиріг "Домашній з вишнями" 500г`,                             	img:'40'},
    {atr:'36177', name:	`Пиріг "Домашній з персиком" 500г`,                             img:'184'},
    {atr:'36302', name:	`Пиріг "Домашній з полуницею" 500г`,                    img:'0'},
    {atr:'33112', name:	`Пиріг "З заварним кремом" 300г`,                              	img:'34'},
    {atr:'24757', name:	`Пиріжок "З маком" 90г`,                                       	img:'41'},
    {atr:'2487', name:	`Пиріжок з яблуком 100г`,                                      	img:'30'},
    {atr:'59096', name:	`Плетенка "Асорті" 100г`,                                     	img:'36'},
    {atr:'33113', name:	`Рулетик"З заварним кремом" 90г`,                              	img:'27'},
    {atr:'61038', name:	`Булочка"Насолода"130г`,                                        img:'175'},
    {atr:'74837', name:	`Булочка"Творожно-вишнева"100г`,                       img:'0'},
    {atr:'1568', name:	`Булочка"Тріо"120г`,                                   img:'0'},
    {atr:'1004', name:	`Булочка"Шоколадно-кокосова" 80г`,                     img:'0'},
    {atr:'30269', name:	`Косичка"З творогом та родзинками"130г`,                        img:'181'},
            
    {atr:0, name: `Круасани`},
    {atr:'14743', name:	`Круасан "GRAND FOOD"з заварним кремом 100г`,                              	img:'118'},
    {atr:'3251', name:	`Круасан"GRAND FOOD"з повидлом 100г`,                                     	img:'116'},
    {atr:'18005', name:	`Круасан "GRAND FOOD"з шинкою і сиром 100г`,                               	img:'7'},
    {atr:'47563', name:	`Круасан "GRAND FOOD" з шоколадною начинкою 100г`,                          img:'117'},
    {atr:'3250', name:	`Круасан"GRAND FOOD" зі згущеним молоком 100г`,                             img:'177'},
    {atr:'60778', name:	`Круасан шоколадний "GRAND FOOD" з заварним кремом 100г`,        img:'0'},
    {atr:'50675', name:	`Круасан"GRAND FOOD"з пломбіром 100г`,                                      img:'186'},
    {atr:'724', name:	`Круасан "GRAND FOOD" 130г`,                                                img:'116'},

    {atr:0, name: `Слойка`},
    {atr:'722', name:	`Слойка"GRAND FOOD" полуницею" 100г`,                                   	img:'164'},
    {atr:'71892', name:	`Слойка "GRAND FOOD" з сливою та горіхом 110г`,                             img:'167'},
    {atr:'19273', name:	`Слойка"GRAND FOOD" з вишнею 100г`,                                        	img:'119'},
    {atr:'19649', name:	`Слойка"GRAND FOOD" з заварним кремом 90г`,                                 img:'168'},
    {atr:'36189', name:	`Слойка"GRAND FOOD" з персиком 100г`,                                       img:'170'},
    {atr:'16788', name:	`Слойка"GRAND FOOD" з смородиною 100г`,                                    	img:'126'},
    {atr:'723', name:	`Слойка "GRAND FOOD"з творогом та родзинками 100г`,                         img:'173'},
    {atr:'703', name:	`Слойка"GRAND FOOD" з маком 100г`,                                          img:'176'},
    {atr:'16788', name:	`Слойка"GRAND FOOD" з смородиною  100г`,                                	img:'126'},

    {atr:0, name: `Сосиска палочки снеки`},
    {atr:'63994', name:	`Снек"GRAND FOOD" з грибами та сиром 140г`,                                	img:'50'},
    {atr:'30854', name:	`Снек"GRAND FOOD" з шинкою та сиром 140г`,                                 	img:'49'},
    {atr:'48934', name:	`Сосиска "В слойоному тісті" 100г`,                                     	img:'51'},
    {atr:'71883', name:	`Сосиска "Гриль" 110г`,                            	                        img:'52'},
    {atr:'18005', name:	`Круасан "GRAND FOOD"з шинкою і сиром 100г`,                               	img:'7'},
    {atr:'70511', name:	`Палочки"GRAND FOOD" слоєні з конжутом 200г`,                                img:'113'},
    {atr:'70510', name:	`Палочки"GRAND FOOD" слоєні з кмином 200г`,                                	img:'112'},
    {atr:'70512', name:	`Палочки"GRAND FOOD" слоєні з цукром 200г`,                          img:'0'},
            
    {atr:0, name: `Тісто Листкове`},
    {atr:'63968', name:	`Тісто  листкове-дріжджове, 500г`,                                         	img:'20'},
    {atr:'70513', name:	`Тісто листкове прісне 500г`,                                              	img:'21'},
    

]

function go(){
        
    var wrapper = document.querySelector('.wrapper');
    var inner = `<div class="a4">`;
    for (let index = 0, j =0; index < db.length; index++, j++) {
        if (db[index].atr==0){
            inner +=`<h2>${db[index].name}</h2>`
        }
        else {
            inner +=`
            <div class="item">
                <span class="item__art">${db[index].atr}</span>
                <img class="item__img" src="jpg/${getImgName(db[index].img)}.jpg">
                <span class="item__name">${db[index].name}</span>
            </div>
        `
        }       
    }    
    wrapper.innerHTML = inner+`</div>`;

    function getImgName(imgName) {
        console.log ();
        if (imgName.length == 1) {return ("00"+imgName)}
        else if (imgName.length == 2) {return ("0"+imgName)}
        else {return imgName}
    }
    }
