
// ===================== #1.1 ======================================
// Пользователь вводит год рождения в input. Пользователь может ввести год
// рождения в двух форматах: 1988 или 02 (имеется ввиду 2002). Программа должна
// вывести количество лет которое исполнилось пользователю.


var yearBirth = prompt('Введіть ваш рік народження');
var CurrentYear = new Date().getFullYear();
var howOld;

var answr = function(howOld) {
	alert('Вам ' + howOld +', і це прекрасно!')};

var wrongAnswr = function() {
	alert('Ти заблуділся мальчік!')};

	 if (yearBirth > 2017) { wrongAnswr() }
else if (yearBirth > 1900) { answr(2017 - yearBirth) }
else if (yearBirth > 17)   { answr(CurrentYear - 1900 - yearBirth ) }
else if (yearBirth < 17)   { answr(CurrentYear - 2000 - yearBirth ) }
else {wrongAnswr()}



// // ===================== #1.2 ======================================
// ​// Пользователь вводит 2 числа. Найти и вывести максимальное из данных двух
// // чисел. Учтите вариант равенства чисел.

// var num1 = prompt('Введіть перше число');
// var num2 = prompt('Введіть друге число');

// 	if (isNaN(num1 || num2)) { alert('Ведіть числа, а не букви!')}
// 	else if (num1 === num2) { alert('Введені числа рівні')}
// 	else if (num1 > num2) { alert('Перше число ' + num1 + ' є більшим')}
// 	else { alert('Друге число ' + num2 + ' є більшим')}





// // ===================== #1.3 ======================================
// // В первом подъезде номера квартир от 1 до 20, во втором от 21 до 64, в
// // третьем от 65 до 80. Пользователь вводит номер квартиры, необходимо указать в каком
// //она подъезде.

// var flat = prompt('Введіть номер квартитри');

// if ( isNaN(flat) || flat <= 0 || flat >= 81 ) { alert('"Ти заблуділся мальчік!"') }
// 	else if (flat <= 20) { alert('Квартира № ' + flat + ' знаходиться в першому підїзді')  }
// 	else if (flat <= 64) { alert('Квартира № ' + flat + ' знаходиться в другому підїзді')  }
// 					else { alert('Квартира № ' + flat + ' знаходиться в третьому підїзді') };





// // ===================== #1.4 ======================================
// ​// Два поля ввода: Логин и пароль. Есть 3 пользователя:
// // ivan -> 333
// // ssss-> 666
// // gibs ->0000
// // Если введен правильный логин и пароль вывести “Добро пожаловать”, в противном
// // случае - вывести “ошибка”.


// var login = prompt('Введіть логін:');

// if (login == 'ivan' || login == 'ssss' || login == 'gibs') {	
// 	var pass = prompt('Введіть пароль:')	
// 	if ((login=='ivan' && pass=='333') || (login=='ssss' && pass=='666') || (login=='gibs' || pass=='0000'))
// 		{alert('Welcome '+ login)}
// 	else {alert('"Ти заблуділся мальчік! (не той пароль)"')}
// }
// else {alert('"Ти заблуділся мальчік! ( не той логін)"')}





// // ===================== #1.5 ======================================
// // Пользователь вводит 3 числа. Найти и вывести максимальное из данных трех
// // чисел

// var num1 = prompt('Введіть перше число');
// var num2 = prompt('Введіть друге число');
// var num3 = prompt('Введіть третє число');

// if (isNaN(num1) || isNaN(num2) || isNaN(num3)) { alert('Введіть три числа (без букв)')}
// 	else if (num1 > num2) { 
// 		 if (num1 > num3) {alert( num1 + ' є більшим числом')}
// 			else { alert( num3 + ' є більшим числом')}
// 	}
// 	else if (num2 > num1) { 
// 		 if (num2 > num3) {alert( num2 + ' є більшим числом')}
// 			else { alert( num3 + ' є більшим числом')}
// 	}

