document.addEventListener("DOMContentLoaded", go);

let a4;
let currentPage = 0;
let touchstartX = 0
let touchendX = 0

document.addEventListener('keydown', function(e) {
    e = e || window.event
    if(e.code=='ArrowRight' || e.code=='ArrowDown') {
        currentPage ++;
        switchPage()
    }
    if(e.code=='ArrowLeft' || e.code=='ArrowUp') {
        currentPage --;
        switchPage()
    }
    
})
    
function checkDirection() {
  if (touchendX < touchstartX-200)  {
    currentPage --
}
  if (touchendX > touchstartX+200)  {
    currentPage ++
}
    console.log(touchendX - touchstartX)
  switchPage()
}

document.addEventListener('touchstart', e => {
  touchstartX = e.changedTouches[0].screenX
})

document.addEventListener('touchend', e => {
  touchendX = e.changedTouches[0].screenX
  checkDirection()
})

function switchPage() {
    if(currentPage >= pages) {
        currentPage = 0
    }
    if(currentPage<0) {
        currentPage = pages-1
    }

    a4.innerHTML = printPage(db[currentPage])
}

function printPage(page) {
    let inner = `<div class="menuList ${currentPage === 0 ? '' : ('menuList--'+(currentPage+1))}">`;
    for (let index = 0; index < page.length; index++) {
        // console.log(page[index].name)
        if (page[index].name === "logo") {
            inner += `
                <div class="block block--logo">
                    <img class="logo" src="picanteria-logo-light.svg" alt="logo">
                </div>
            `
        }
        else if (page[index].name === "title") {
            inner += `
                <div class="block block--title ${page[index].class ? page[index].class : ''}
                ">
                    <h3>${page[index].title}</h3>
                </div>
            `
        }
        else
        inner += `
            <div class="block">
                <div class="desc">
                    <h4 class="name">${page[index].name}</h4>
                    <p class="ing">${page[index].ing}</p>
                </div>
                <div class="priceBlock">
                    <p class="price">${page[index].price}</p>
                    <p class="grn">грн</p>
                </div>
            </div>
        `        
    }
    inner += `  
        </div>`
        //+` <div class="footer">
        //     <p>Lorem, ipsum dolor.</p>
        //     <p>+38097 9929 999 <br> ipsum dolor.</p>
        //     <p>Lorem ipsum dolor sit.</p>
        // </div>
        // `
    return inner
}

let db =[
    [
        {name:`logo`},

        {name:`title`, title:`Піца`, class:'pizza'},
        {name:`Піца «4 сири»`, ing:`моцарела, сир пармезан, сир дорблю, сир твердий, вершкова основа. 500г`, price:`185/435`},
        {name:`Піца «4 сезони»`, ing:`моцарела, печериці, кукурудза, шинка, салямі, томатна основа. 590г`, price:`195/430`},
        {name:`Піца «Шварценегер»`, ing:`моцарела, мисливські ковбаски, домашня ковбаса, квасоля,  печериці, цибуля, томатна основа. 650г`, price:`220/490`},
        {name:`Піца «Picanteria»`, ing:`моцарела, пепероні, бекон, печериці, томатна основа. 550г`,  price:`209/470`},
        {name:`Піца «Гавайська»`, ing:`моцарела, куряче філе, кукурудза, ананас, вершкова основа. 590г`, price:`199/440`},
        {name:`Піца «Гушошна»`, ing:`моцарела, салямі, бекон, шинка, куряче філе, томат, томатна основа. 650г`, price:`230/500`},
        {name:`Піца «Капрічіоза»`, ing:`моцарела , шинка, печериці, салямі, томат, томатна основа. 590г`, price:`205/430`},
        {name:`Піца «Маргарита»`, ing:`моцарела, томат, томатна основа. 510г`, price:`150/370`},
        {name:`Піца «Ніжна»`, ing:`моцарела, сир твердий, куряче філе, кукурудза, соус вершковий. 550г`, price:`195/435`},
        {name:`Піца «Пепероні»`, ing:`пепероні, сир моцарела, томатна основа. 500г`, price:`195/430`},
        {name:`Піца «Салямі»`, ing:`салямі, сир моцарела , томатна основа. 500г`, price:`195/430`},
        {name:`Піца "Bambino"`, ing:`Моцарела, шинка, кукурудза. 590г`, price:`195/425`},
        {name:`Піца «Фрішка»`, ing:`картопля фрі, бекон, сир моцарела, томатна основа. 590г`, price:`199/420`},
        {name:`Піца «До пива»`, ing:`моцарела, часникова основа. 450г`, price:`150/370`},
        {name:`Піца «Цезар»`, ing:`куряче філе, томат, мікс салатів, сир моцарела, сир пармезан, томатна основа. 600г`, price:`220/470`},
        {name:`Піца "Курка піканте"`, ing:`моцарела, томатна основа, куряче філе, кукурудза, солодкий соус чилі. 570г`, price:`199/419`},
        {name:`Піца «Дон Карлеоне»`, ing:`моцарела, сир дорблю, пепероні, томатна основа. 520г`, price:`210/475`},
        {name:`Піца "Прошуто Фунгі"`, ing:`моцарела, печериці, прошуто, томатна основа. 500г`, price:`230/490`},
        {name:`Піца «Песто»`, ing:`моцарела, бекон, шинка, болгарський перець, томатна основа, соус песто. 620г`, price:`220/490`},
        {name:`Піца «Кон пере»`, ing:`моцарела, сир дорблю, груша, волоський горіх, вершкова основа. 530г`, price:`195/420`},
        {name:`Піца «Закарпатська»`, ing:`моцарела, шовдарь копчений, ковбаса копчена, маринований огірок, цибуля, томатна основа. 650г`, price:`245/505`},
        {name:`Піца «Файна»`, ing:`вершкова основа, моцарела, бекон, куряче філе, сир чедар, зелена цибуля. 600г`, price:`210/480`},
        {name:`Піца «Вегетеріанська»`, ing:`томатна основа, моцарела, мікс салату, томати чері, пармезан. 600г`, price:`185/415`},

        {name:`title`, title:`Бортик піци`, class:'pizza2' },
        {name:`Сирний бортик `, ing:` `, price:`39/70`},
        {name:`Кунжутний бортик`, ing:` `, price:`25/45`},
        {name:`М'ясний бортик`, ing:` `, price:`39/80`},

        {name:`title`, title:`Соуси`},
        {name:`Кетчуп`, ing:`50г`, price:`20`},
        {name:`Соус часниковий`, ing:`50г`, price:`20`},
        {name:`Соус сирний`, ing:`50г`, price:`20`},
        {name:`Соус «Цезар»`, ing:`50г`, price:`20`},
        {name:`Соус «Тартар»`, ing:`50г`, price:`20`},
        {name:`Соус кисло-солодкий`, ing:`50г`, price:`20`},
        {name:`Соус солодкий чилі`, ing:`50г`, price:`20`},
        {name:`Соус манго-чилі`, ing:`50г`, price:`20`},
    
    ],

    // ========================= 2 ===================================

    [
        {name:`logo`},

        {name:`title`, title:`Лаваш`},
        {name:`Лаваш з куркою та овочами`, ing:`соус часниковий, капуста білокачанна, овочі (огірки, томати), куряче філе, сир твердий. 300г`, price:`149`},
        {name:`Лаваш з сиром`, ing:`сир селянський або твердий (на вибір), зелень. 300г`, price:`120`},
        {name:`Лаваш «Цезар»`, ing:`соус Цезар, сир твердий, яйце, капуста білокачанна, томати, куряче філе. 300г`, price:`149`},
        {name:`Лаваш Закарпатський`, ing:`копченина, цибуля смажена, огірки мариновані. 300г`, price:`155`},
        {name:`Лаваш Овочевий мікс`, ing:`соус часниковий, сир твердий, болгарський перець, капуста білокачанна, томати, огірок. 300г`, price:`135`},
        {name:`Лаваш грибний`, ing:`соус часниковий, сир, смаженні печериці, зелень. 300г`, price:`149`},
        {name:`Лаваш з яловичиною`, ing:`соус часниковий, сир , капуста, томати, яловичина , зелень. 300г`, price:`169`},
    
        {name:`title`, title:`Салати`},
        {name:`Капрезе`, ing:`сир моцарела, томати, орегано. 300г`, price:`149`},
        {name:`Прошуто`, ing:`мікс салатів, прошуто, томати чері, авокадо. 250г`, price:`185`},
        {name:`Грецький`, ing:`томати, сир фета, перець, маслини, огірки. 250г`, price:`149`},
        {name:`Цезар`, ing:`куряче філе, пармезан, томати , салат. 250г`, price:`155`},
        {name:`Ніжність`, ing:`куряче філе, сир твердий, кукурудза, салат. 250г`, price:`155`},
        {name:`Cалат з капусти традиційний`, ing:`150г`, price:`55`},
        {name:`Салат з яловичиною`, ing:`яловичина, мікс салатів, томати чері, кунжут. 300г`, price:`179`},
        {name:`Салат з лососем та яйцем-пашот`, ing:`Мікс салатів, томати чері, лосось, яйце-пашот, соус песто. 250г`, price:`209`},
        {name:`Салат з беконом і грушею`, ing:`Рукола, перець болгарський, томати чері, груша, бекон, сир пармезан.. 300г`, price:`169`},
        {name:`Салат авторський`, ing:`Перець болгарський, томати, огірок, квасоля, шпинат, сир фета. 300г`, price:`175`},
        {name:`Салат з креветками і авокадо`, ing:`Мікс салатів, томати чері, авокадо, креветки, салатна заправка. 270г`, price:`220`},

        {name:`title`, title:`Закуски`},
        {name:`Сирна тарілка`, ing:`сир твердий, дорблю, камамбер, брі, мед, горіхи. 350г`, price:`339`},
        {name:`М’ясна тарілка`, ing:`шовдарь копчений, салямі, пепероні, чорізо, бастурма. 320г`, price:`310`},
        {name:`Закарпатська тарілка`, ing:`шовдарь копчений, сало копчене, ковбаса домашня копчена, помазанка зі шкварок, тости. 400г`, price:`350`},
        {name:`Брускети з лососем`, ing:`лосось власного посолу, сир філадельфія, каперси`, price:`189`},
        {name:`Брускети з в'яленими томатами`, ing:`авокадо, в'ялені томати, крем-сир`, price:`125`},
        {name:`Брускети з креветками`, ing:`Песто власного виробництва, мікс салату, сир Філадельфія та креветка`, price:`189`},
        {name:`Брускети з прошуто`, ing:`прошуто, груша, соус песто (власного виробництва)`, price:`175`},
        {name:`Помазанка закарпатська`, ing:`шкварки, хліб,  маринований огірок. 120г`, price:`69`},
        {name:`Помазанка часникова`, ing:`сир плавлений, яйце, часниковий соус, хліб. 120г`, price:`69`},
        {name:`Чорізо`, ing:`100г`, price:`80`},
        {name:`Бастурма`, ing:`70г`, price:`70`},
        {name:`Арахіс`, ing:`100г`, price:`40`},
        {name:`Сир сулугуні косичка`, ing:`120г`, price:`60`},
    ],

    // ========================= 3 ===================================

    [
        {name:`logo`},

        {name:`title`, title:`Снiданки `},
        {name:`Американський сніданок`, ing:`яєшня, сосиски, квасоля, картопля, бекон, тости, свіжі овочі`, price:`149`},
        {name:`Італійський сніданок`, ing:`омлет, мікс салату, прошуто, заправка песто (власного виробництва), томатна сальса, тости`, price:`145`},
        {name:`Сніданок Picanteria`, ing:`мікс салату, сир філадельфія, червона риба, тости, яйце пашот`, price:`195`},
        {name:`Каша вівсяна`, ing:`вівсяна каша, вершкове масло, мигдалеві пластівці, топінг`, price:`85`},
        {name:`Омлет`, ing:`яєшня, тости, вершкове масло, швейцарський сир, шинка, свіжі овочі`, price:`110`},
        {name:`Ратота`, ing:`тости, картопля, смажена цибуля з домашньою ковбасою, омлет, мариновані огірки`, price:`135`},
        {name:`Чілі боб`, ing:`цибуля, кукурудза, червона квасоля, фарш зі свинини, гостра приправа від шефа`, price:`160`},
        {name:`Сирники`, ing:`200г`, price:`130`},
        {name:`Тост з лососем і авокадо`, ing:`250г`, price:`145`},
        {name:`Тост з яйцем`, ing:`250г`, price:`99`},
        
        {name:`title`, title:`Супи`},
        {name:`Бульйон курячий з локшиною`, ing:`300г`, price:`75`},
        {name:`Солянка`, ing:`350г`, price:`105`},
        {name:`Окрошка`, ing:`350г`, price:`90`},
        {name:`Грибна юшка`, ing:`350г`, price:`95`},
        {name:`Крем-суп з печерицями`, ing:`300г`, price:`110`},
        {name:`Лагман`, ing:`350г`, price:`110`},

        {name:`title`, title:`Млинці`},
        {name:`Млинці з м’ясною начинкою`, ing:`250г`, price:`129`},
        {name:`Млинці банан-Nutella`, ing:`250г`, price:`99`},
        {name:`Млинці з сиром`, ing:`250г`, price:`99`},
        {name:`Млинці солодкі`, ing:`Начинка: згущене молоко або варення (в асортименті). 250г`, price:`75`},
        {name:`Млинці з грибами`, ing:`250г`, price:`125`},
        {name:`Млинці лосось-філадельфія`, ing:`250г`, price:`169`},
    
        {name:`title`, title:`Паста`},
        {name:`Спагетті карбонара`, ing:`250г`, price:`155`},
        {name:`Паста болоньєзе`, ing:`250г`, price:`149`},
        {name:`Паста з куркою та грибами`, ing:`250г`, price:`149`},
        {name:`Паста з креветками`, ing:`Паста, креветки, вершковий соус, сир пармезан. 250г`, price:`230`},
        {name:`Локшина по-азіатськи`, ing:`Локшина, курка, стручкова квасоля, морква, перець болгарський. 250г`, price:`165`},
        {name:`Удон з овочами, грибами під соусом теріякі`, ing:``, price:`165`},
    ],

    // ========================= 4 ===================================

    [
        {name:`title`, title:`Кавова карта`},
        {name:`Еспресо`, ing:`36мл`, price:`30`},
        {name:`Еспресо Зеро`, ing:`36мл`, price:`30`},
        {name:`Еспресо тонік`, ing:`еспресо, тонік. 250мл`, price:`40`},
        {name:`Дабл еспресо`, ing:`72мл`, price:`50`},
        {name:`Американо`, ing:`86мл`, price:`30`},
        {name:`Мокко`, ing:`дабл еспресо, чорний шоколад, молоко. 280мл`, price:`65`},
        {name:`Раф кава`, ing:`еспресо, вершки, молоко, ванільний цукор. 250мл`, price:`55`},
        {name:`Капучино`, ing:`250мл`, price:`45`},
        {name:`Лате макіато`, ing:`340мл`, price:`55`},
        {name:`Бананове лате`, ing:`340мл`, price:`80`},
        {name:`Глясе`, ing:`100мл`, price:`50`},
        {name:`Флет Уайт`, ing:`подвійний еспресо з молоком. 250мл`, price:`60`},
        {name:`Баунті`, ing:`лате, кокосовий сироп, кокосова стружка. 340мл`, price:`65`},
        {name:`Бамбл`, ing:`еспресо, апельсиновий сік. 200мл`, price:`50`},
        {name:`Матча`, ing:``, price:`40`},
        {name:`Сироп`, ing:`25г`, price:`10`},
        {name:`Рослинне молоко`, ing:`Кокосове, мигдалеве, бананове`, price: `20`},

        {name:`title`, title:`Какао / шоколад`},
        {name:`Гарячий шоколад білий / чорний`, ing:`150мл`, price:`59`},
        {name:`Какао`, ing:`250мл`, price:`45`},
        {name:`молочний коктейль`, ing:`Молоко, пломбір, сироп.250мл`, price:`79`},
        
        {name:`title`, title:`Чай медово-фруктовий`},
        {name:`Імбир та лемонграс`, ing:`250мл`, price:`35`},
        {name:`Малина та мята`, ing:`250мл`, price:`35`},
        {name:`Чорна смородина`, ing:`250мл`, price:`35`},
        {name:`Обліпиха та імбир`, ing:`250мл`, price:`35`},
        {name:`Ягідний мікс`, ing:`250мл`, price:`35`},
        {name:`Журавлина та імбир`, ing:`250мл`, price:`35`},
        {name:`Апельсин та мята`, ing:`250мл`, price:`35`},

        {name:`title`, title:`Чай`},
        {name:`Зелений чай з імбиром`, ing:`600мл`, price:`65`},
        {name:`Йога-чай з корицею і лакрицею`, ing:`600мл`, price:`65`},
        {name:`Лавандовий чай`, ing:`600мл`, price:`65`},
        {name:`Фруктовий чай Барвиста долина`, ing:`600мл`, price:`65`},
        {name:`Чай Альпійський луг`, ing:`600мл`, price:`65`},
        {name:`Чай Пу-ер Ванільний`, ing:`600мл`, price:`65`},
        {name:`Чай Ройбуш кардамон з лаймом`, ing:`600мл`, price:`65`},
        {name:`Чай Соу-сеп зелений`, ing:`600мл`, price:`65`},
        {name:`Чай Соу-сеп чорний`, ing:`600мл`, price:`65`},
        {name:`Чорний чай Гордість Цейлону`, ing:`600мл`, price:`65`},
        {name:`Чорний чай Манговий рай`, ing:`600мл`, price:`65`},
        {name:`Чорний чай Маракеш`, ing:`600мл`, price:`65`},

    ],

    // ========================= 5 ===================================

    [
        {name:`logo`},

        {name:`title`, title:`Бургер меню`, class:'burger'},
        {name:`Чізбургер класичний`, ing:`Котлета яловича, сир чеддер, салат, томат, цибуля, огірки мариновані, бекон, соус`, price:`225/299`},
        {name:`Дабл Оклахома`, ing:`Котлети, цибуля смажена, сир Чеддер`, price:`299/375`},
        {name:`Цомббургер`, ing:`Куряче бедро, салат, соус, огірок маринований, цибуля смажена, сир чедер`, price:`199/285`},
        {name:`Креветос`, ing:`Булочка бріош, салат, томат, ріпчаста цибуля, креветки, соус`, price:`285/355`},

        {name:`title`, title:`Стейк меню`},
        {name:`Рібай`, ing:`100г`, price:`149`},
        {name:`Стейк зі свинини`, ing:`100г`, price:`89`},
        {name:`Стейк курячий`, ing:`100г`, price:`79`},
        {name:`Стейк з лосося`, ing:`100г`, price:`199`},
        
        {name:`title`, title:`Фрі`},
        {name:`Стріпси курячі`, ing:`100г`, price:`75`},
        {name:`Крильця в медовому соусі`, ing:`5шт`, price:`129`},
        // {name:`Курячі ніжки`, ing:`100г`, price:`65`},
        {name:`Смажені креветки у клярі`, ing:`100г`, price:`165`},
        {name:`Домашня ковбаса (власного копчення)`, ing:`100г`, price:`99`},
        {name:`Відбивна куряча`, ing:`100г`, price:`65`},
        {name:`Картопля фрі`, ing:`150г`, price:`64`},
        {name:`Сирні палички`, ing:`150г`, price:`129`},
        {name:`Сирні кульки "Філадельфія"`, ing:`150г`, price:`129`},
        {name:`Картопля по селянськи`, ing:`150г`, price:`75`},
        {name:`Картопля по креольськи`, ing:`150г`, price:`75`},
        {name:`Картопля по закарпатськи`, ing:`150г`, price:`110`},
        {name:`Гірос`, ing:`картопля фрі, курка, овочі, сир, соус. 350г`, price:`149`},
        {name:`Цибулеві кільця`, ing:`соус на вибір. 200г`, price:`89`},
        {name:`Кільця кальмарів`, ing:`100г`, price:`99`},

    ],

    // ========================= 6 ===================================

    [
        {name:`logo`},

        {name:`title`, title:`Безалкогольні напої`},
        {name:`Сік натуральний в асортименті`, ing:`0.3л/1л`, price:`30/85`},
        {name:`Сік березовий натуральний`, ing:`0.3л/1л`, price:`25/70`},
        {name:`Ситро`, ing:`0.3л/0.5л`, price:`25/30`},
        {name:`Лимонад`, ing:`475мл`, price:`50`},
        {name:`Мохіто`, ing:`475мл`, price:`60`},
        {name:`Пінаколада`, ing:`350мл`, price:`85`},
        {name:`Coca-Cola, Fanta, Sprite`, ing:`0.5л`, price:`30`},
        {name:`Pepsi`, ing:`0.33л`, price:`25`},
        {name:`Pepsi`, ing:`0.5л`, price:`30`},
        {name:`Вода негазована`, ing:`0.5л`, price:`20`},
        {name:`Вода газована (скло)`, ing:`0.5л`, price:`30`},
        {name:`Тонік Schweppes`, ing:`330мл`, price:`25`},
        {name:`Сік дитячий з трубочкою в асортименті`, ing:`0.2л`, price:`20`},
        {name:`Дитяче шампанське`, ing:`0.75л`, price:`120`},

        {name:`title`, title:`Пиво розливне`, class:'beer'},
        {name:`Carlsberg`, ing:``, price:`35/45`},
        {name:`Kronenbourg`, ing:``, price:`45/55`},
        {name:`Heming Lager 11 світле`, ing:``, price:`40/50`},
        {name:`Dunkel темне фільтроване`, ing:``, price:`45/55`},
        // {name:`Пиво Kozel`, ing:`ж/б 0.5л`, price:`45`},
        // {name:`Пиво Budwar`, ing:`ж/б 0.5л`, price:`47`},
        // {name:`Пиво Budwiser`, ing:`ж/б 0.5л`, price:`50`},
        // {name:`Пиво Krusovice`, ing:`ж/б 0.5л 10%`, price:`45`},
        // {name:`Пиво Krusovice`, ing:`ж/б 0.5л темне`, price:`50`},
        // {name:`Пиво Staropramen`, ing:`ж/б 0.5л`, price:`45`},

        {name:`title`, title:`Вино`, class:'wine'},
        {name:`Вино Карлот`, ing:`червоне сухе, 0.75л`, price:'365/80'},
        {name:`Вино Мерло`, ing:`червоне сухе, 0.75л`, price:'365/85'},
        {name:`Вино Chizay Chersegi`, ing:`біле сухе, 0.75л`, price:'245/69'},
        {name:`Вино Chizay GewurzTraminer`, ing:`біле сухе, 0.75л`, price:'250/69'},
        {name:`Вино Chizay Moscato`, ing:`біле напівсолодке, 0.75л`, price:'250/69'},
        {name:`Вино ігристе Chizay`, ing:`напівсолодке біле, 0.75л`, price:'260/75'},
        {name:`Вино Chizay Brut`, ing:`ігристе біле, 0.75л`, price:'260/75'},
        {name:`Вино Chizay Pinot Noir`, ing:`червоне напівсолодке, 0.75л`, price:'250/69'},
        {name:`Вино Chizay Rose з грейпфрутом`, ing:`рожеве напівсолодке, 0.75л`, price:'250/69'},
        // {name:`Вино Нове кохання`, ing:`червоне, 0.75л`, price:'285/65'},
        {name:`Напій "Prosecco"`, ing:`0.75л`, price:'340/75'},

    ]
]


let pages = db.length;

function go(){
    a4 = document.querySelector('.a4');
    a4.innerHTML = printPage(db[0])
}