let base = {
    h1: 'Багети',
    p1: [
        {pic: '1',
        desc: `<strong>Багет «GRAND FOOD» з стейком 230г</strong><br> (Булочка "Міні Багет", стейк курячий, огірок, салатний листок, соус)`
        },
        {pic: '2',
        desc: `<strong>Багет «GRAND FOOD» з ковбасою 230г</strong><br> (Булочка "Міні Багет", ковбаса копчена, сир твердий, капуста білокачанна, салатний листок, соус)`
        },
        {pic: '3',
        desc: `<strong>Багет «GRAND FOOD» з шашликом 230г</strong><br> (Булочка "Міні Багет", шашлик курячий, капуста білокачанна, салатний листок, соус)`
        },
        {pic: '4',
        desc: `<strong>Багет «GRAND FOOD» з шинкою 230г</strong><br> (Булочка "Міні Багет", шинка копчена, сир твердий, капуста білокачанна, салатний листок, соус)`
        },
        {pic: '5',
        desc: `<strong>Багет «GRAND FOOD» з відбивною 230г</strong><br> (Булочка "Міні Багет", стейк з філе курки, огірки, салатний листок, соус)`
        },
        {pic: '6',
        desc: `<strong>Багет «GRAND FOOD» Гурман 230г</strong><br> (Булочка "Міні Багет", шинка копчена, ковбаса копчена, ковбаска варена, сир твердий, салат "Морква по-корейськи", салатний листок, соус)`
        },
        {pic: '7',
        desc: `<strong>Багет «GRAND FOOD» з філе курки 230г</strong><br> (Булочка "Міні Багет", філе куряче варене, огірки, салатний листок, соус)`
        },
        {pic: '8',
        desc: `<strong>Багет «GRAND FOOD» з підкопченим філе курки 230г</strong><br> (Булочка "Міні Багет", Філе підкопчене, огірки, салатний листок, соус)`
        },
    ],
    h2: ['Бургери', 'Паніні'],
    p2: [
        {pic: '9',
        desc: `<strong>Гамбургер «GRAND FOOD» 230г</strong><br>( Булочка "До гамбургера", котлета "Гамбургер", огірки, салатний листок, соус)`
        },
        {pic: '10',
        desc: `<strong>Чізбургер «GRAND FOOD» 300г</strong><br>( Булочка "До гамбургера", котлета "Гамбургер", сир твердий, огірки, салатний листок, соус)`
        },
        {pic: '11',
        desc: `<strong>Бургер «GRAND FOOD» з відбивною 220г</strong><br>(Булочка "До гамбургера", котлета відбивна з філе курки, огірки, салатний листок, соус)`
        },
        {pic: '12',
        desc: `<strong>Бургер «GRAND FOOD» маковий з шинкою 220г</strong><br>(Булочка " З маком", шинка копчена, сир твердий, помідори, салатний листок, соус)`
        },
        {pic: '13',
        desc: `<strong>Паніні «GRAND FOOD» з шинкою 200г</strong><br>(Чіабата, шинка копчена, сир твердий, капуста білокачанна, салатний листок, соус)`
        },
        {pic: '14',
        desc: `<strong>Паніні «GRAND FOOD» Гурман 200г</strong><br>(Чіабата, шинка копчена, ковбаса копчена, ковбаска варена, сир твердий, салат "Морква по-корейськи", салатний листок, соус)`
        },
        {pic: '15',
        desc: `<strong>Паніні «GRAND FOOD» з філе курки 200г</strong><br>(Чіабата, філе куряче варене, огірки, салатний листок, соус`
        },
        {pic: '16',
        desc: `<strong>Паніні «GRAND FOOD» з відбивною 200г</strong><br>(Чіабата, котлета відбивна з філе курки, огірки, салатний листок, соус)`
        },
    ],
    h3: ['М’ясні круасани', 'Хот-доги', 'Сосиски в тісті'],
    p3: [
        {pic: '17',
        desc: `<strong>Круасан «GRAND FOOD» Гурман 200г</strong><p>(Булочка "Круасан", шинка копчена, ковбаса копчена, ковбаска варена, сир твердий, соус)`
        },
        {pic: '18',
        desc: `<strong>Круасан «GRAND FOOD» з шинкою 200г</strong><p>(Булочка "Круасан", шинка копчена, сир твердий, соус)`
        },
        {pic: '19',
        desc: `<strong>Круасан «GRAND FOOD» з ковбасою 200г</strong><p>(Булочка "Круасан", ковбаса копчена, сир твердий, соус)`
        },

        {pic: '20',
        desc: `<strong>Хот-дог «GRAND FOOD» Апетитний 180г</strong><p>(Булочка "До хот-дога", ковбаска варена, сир твердий, капуста білокачанна, соус)`
        },
        {pic: '21',
        desc: `<strong>Хот-дог «GRAND FOOD» Класичний 180г</strong><p>(Булочка "До хот-дога з кунжутом", сосиска варена, капуста білокачанна, соус)`
        },
        {pic: '22',
        desc: `<strong>Хот-дог «GRAND FOOD» Гриль 180г</strong><p>(Булочка "Міні Багет", сосиска гриль, капуста білокачанна, соус)`
        },

        {pic: '23',
        desc: `<strong>Сосиска в тісті 100г</strong>`
        },
        {pic: '24',
        desc: `<strong>Сосиска гриль в слоєному тісті 110г</strong>`
        },
        {pic: '25',
        desc: `<strong>Домашня котлета в тісті 100г</strong>`
        },
    ],
    h4: 'Солодкі круасани та слойки',
    p4: [
        {pic: '26',
        desc: `<strong>Круасан шоколадний з заварним кремом 100г</strong>`
        },
        {pic: '27',
        desc: `<strong>Круасан з заварним кремом 100г</strong>`
        },
        {pic: '28',
        desc: `<strong>Круасан зі згущеним молоком 100г</strong>`
        },
        {pic: '29',
        desc: `<strong>Круасан з шоколадною начинкою 100г</strong>`
        },
        {pic: '30',
        desc: `<strong>Круасан з повидлом 100г</strong>`
        },

        {pic: '31',
        desc: `<strong>Слойка з вишнею 100г</strong>`
        },
        {pic: '32',
        desc: `<strong>Слойка з заварним кремом 100г</strong>`
        },
        {pic: '33',
        desc: `<strong>Слойка з полуницею 100г</strong>`
        },
        {pic: '34',
        desc: `<strong>Слойка з сливою та горіхами 100г</strong>`
        },
        {pic: '35',
        desc: `<strong>Слойка з маком 100г</strong>`
        },
    ]
}