let base = {
    h1: 'Багети',
    p1: [
        {pic: '1',
        desc: `<strong>Багет «GRAND FOOD» з стейком 230г</strong><br> (Булочка "Міні Багет", стейк курячий, огірок, соус)`
        },
        {pic: '2',
        desc: `<strong>Багет «GRAND FOOD» з ковбасою 230г</strong><br> (Булочка "Міні Багет", ковбаса копчена, сир твердий, капуста білокачанна, соус)`
        },
        {pic: '3',
        desc: `<strong>Багет «GRAND FOOD» з шашликом 230г</strong><br> (Булочка "Міні Багет", шашлик курячий, капуста білокачанна, соус)`
        },
        {pic: '4',
        desc: `<strong>Багет «GRAND FOOD» з шинкою 230г</strong><br> (Булочка "Міні Багет", шинка копчена, сир твердий, капуста білокачанна, соус)`
        },
        {pic: '5',
        desc: `<strong>Багет «GRAND FOOD» з відбивною 230г</strong><br> (Булочка "Міні Багет", стейк з філе курки, огірки, соус)`
        },
        {pic: '6',
        desc: `<strong>Багет «GRAND FOOD» Гурман 230г</strong><br> (Булочка "Міні Багет", шинка копчена, ковбаса копчена, ковбаска варена, сир твердий, салат "Морква по-корейськи", соус)`
        },
        {pic: '7',
        desc: `<strong>Багет «GRAND FOOD» з філе курки 230г</strong><br> (Булочка "Міні Багет", філе куряче варене, огірки, соус)`
        },
        {pic: '8',
        desc: `<strong>Багет «GRAND FOOD» з підкопченим філе курки 230г</strong><br> (Булочка "Міні Багет", Філе підкопчене, огірки, соус)`
        },
    ],
    h2: ['Бургери', 'Паніні'],
    p2: [
        {pic: '9',
        desc: `<strong>Гамбургер «GRAND FOOD» 230г</strong><br>( Булочка "До гамбургера", котлета "Гамбургер", огірки, соус)`
        },
        {pic: '10',
        desc: `<strong>Чізбургер «GRAND FOOD» 300г</strong><br>( Булочка "До гамбургера", котлета "Гамбургер", сир твердий, огірки, соус)`
        },
        {pic: '11',
        desc: `<strong>Бургер «GRAND FOOD» з відбивною 220г</strong><br>(Булочка "До гамбургера", котлета відбивна з філе курки, огірки, соус)`
        },
        {pic: '12',
        desc: `<strong>Бургер «GRAND FOOD» маковий з шинкою 220г</strong><br>(Булочка " З маком", шинка копчена, сир твердий, помідори, соус)`
        },
        {pic: '13',
        desc: `<strong>Паніні «GRAND FOOD» з шинкою 200г</strong><br>(Чіабата, шинка копчена, сир твердий, капуста білокачанна, соус)`
        },
        {pic: '14',
        desc: `<strong>Паніні «GRAND FOOD» Гурман 200г</strong><br>(Чіабата, шинка копчена, ковбаса копчена, ковбаска варена, сир твердий, салат "Морква по-корейськи", соус)`
        },
        {pic: '15',
        desc: `<strong>Паніні «GRAND FOOD» з філе курки 200г</strong><br>(Чіабата, філе куряче варене, огірки, соус`
        },
        {pic: '16',
        desc: `<strong>Паніні «GRAND FOOD» з відбивною 200г</strong><br>(Чіабата, котлета відбивна з філе курки, огірки, соус)`
        },
    ],
    h3: ['М’ясні круасани', 'Хот-доги', 'Сосиски в тісті'],
    p3: [
        {pic: '17',
        desc: `<strong>Круасан «GRAND FOOD» Гурман 200г</strong><p>(Булочка "Круасан", шинка копчена, ковбаса копчена, ковбаска варена, сир твердий, соус)`
        },
        {pic: '18',
        desc: `<strong>Круасан «GRAND FOOD» з шинкою 200г</strong><p>(Булочка "Круасан", шинка копчена, сир твердий, соус)`
        },
        {pic: '19',
        desc: `<strong>Круасан «GRAND FOOD» з ковбасою 200г</strong><p>(Булочка "Круасан", ковбаса копчена, сир твердий, соус)`
        },

        {pic: '20',
        desc: `<strong>Хот-дог «GRAND FOOD» Апетитний 180г</strong><p>(Булочка "До хот-дога", ковбаска варена, сир твердий, капуста білокачанна, соус)`
        },
        {pic: '21',
        desc: `<strong>Хот-дог «GRAND FOOD» Класичний 180г</strong><p>(Булочка "До хот-дога з кунжутом", сосиска варена, капуста білокачанна, соус)`
        },
        {pic: '22',
        desc: `<strong>Хот-дог «GRAND FOOD» Гриль 180г</strong><p>(Булочка "Міні Багет", сосиска гриль, капуста білокачанна, соус)`
        },

        {pic: '23',
        desc: `<strong>Сосиска в тісті 100г</strong>`
        },
        {pic: '24',
        desc: `<strong>Сосиска в слоєному тісті 110г</strong>`
        },
        {pic: '25',
        desc: `<strong>Домашня котлета в тісті 100г</strong>`
        },
    ],
    h4: 'Солодкі круасани та слойки',
    p4: [
        {pic: '26',
        desc: `<strong>Круасан шоколадний з заварним кремом 100г</strong>`
        },
        {pic: '27',
        desc: `<strong>Круасан з заварним кремом 100г</strong>`
        },
        {pic: '28',
        desc: `<strong>Круасан зі згущеним молоком 100г</strong>`
        },
        {pic: '29',
        desc: `<strong>Круасан з шоколадною начинкою 100г</strong>`
        },
        {pic: '30',
        desc: `<strong>Круасан з повидлом 100г</strong>`
        },

        {pic: '31',
        desc: `<strong>Слойка з вишнею 100г</strong>`
        },
        {pic: '32',
        desc: `<strong>Слойка з заварним кремом 100г</strong>`
        },
        {pic: '33',
        desc: `<strong>Слойка з полуницею 100г</strong>`
        },
        {pic: '34',
        desc: `<strong>Слойка з сливою та горіхами 100г</strong>`
        },
        {pic: '35',
        desc: `<strong>Слойка з маком 100г</strong>`
        },
    ],
    h5: ['Солодкі булочки', 'Солені булочки'],
    p5: [
        {pic: '36',
        desc: `<strong>Булочка «Ватрушка з творогом» 120г</strong>`
        },
        {pic: '37',
        desc: `<strong>Пирідок «З маком» 90г</strong>`
        },
        {pic: '38',
        desc: `<strong>Булочка «Макова Ромашка» 430г</strong>`
        },
        {pic: '39',
        desc: `<strong>Булочка «Кавова» 90г</strong>`
        },
        {pic: '40',
        desc: `<strong>Плетенка «Асорті» 100г</strong>`
        },
        {pic: '41',
        desc: `<strong>Булочка «Шоколадно-Кокосова» 80г</strong>`
        },

        {pic: '42',
        desc: `<strong>Булочка «Паличка сирна» 90г</strong>`
        },
        {pic: '43',
        desc: `<strong>Булочка «З кетчупом і сиром» 80г</strong>`
        },
        {pic: '44',
        desc: `<strong>Міні багет «По Домашньому» 200г</strong>`
        },
        {pic: '45',
        desc: `<strong>Булочка «Апетитна» 100г</strong>`
        },
        {pic: '46',
        desc: `<strong>Булочка з часником 225г</strong>`
        },
        {pic: '47',
        desc: `<strong>Палички слоєні з кунжутом 200г</strong>`
        },
    ],
    h6: 'Хліб та хлібобулочні вироби',
    p6: [
        {pic: '48',
        desc: `<strong>Хліб «Пшеничний» різаний 600г</strong>`
        },
        {pic: '49',
        desc: `<strong>Батон «Нарізний» подовий 300г</strong>`
        },
        {pic: '50',
        desc: `<strong>Хлібець «Пшеничний» різаний 400г</strong>`
        },
        {pic: '52',
        desc: `<strong>Хлібець житній на живій заквасці 300г</strong>`
        },
        {pic: '51',
        desc: `<strong>Батон «Бездріжджовий на Італійській заквасці» вищого гатунку 400г</strong>`
        },
        {pic: '53',
        desc: `<strong>Батон «Бездріжджовий на Італійській заквасці» житньо-пшеничний 500г</strong>`
        },

        {pic: '54',
        desc: `<strong>Булочка «Міні Багет» 130г</strong>`
        },
        {pic: '55',
        desc: `<strong>Булочка «до хот-дога» 90г</strong>`
        },
        {pic: '56',
        desc: `<strong>Булочка «Гамбургер» 120г</strong>`
        },
        {pic: '57',
        desc: `<strong>Булочка «З сезамом» 80г</strong>`
        },
        {pic: '58',
        desc: `<strong>Багет 400г</strong>`
        },
        {pic: '60',
        desc: `<strong>Рогалик прісний з повидлом 120г</strong>`
        },
        {pic: '61',
        desc: `<strong>Рогалик прісний 100г</strong>`
        },
        {pic: '59',
        desc: `<strong>Корж для піцци 300г</strong>`
        },
        {pic: '62',
        desc: `<strong>Кнедлі «Пісні» 250г</strong>`
        },
        {pic: '63',
        desc: `<strong>Гомбовці з повидлом 100г</strong>`
        },
    ]
}