let base = {
    p1: [
        {pic: '1', desc: `<strong>Багет «GRAND FOOD» з стейком 230г</strong><br> (Булочка "Міні Багет", стейк курячий, огірок, салатний листок, соус)`
        },
        {pic: '2', desc: `<strong>Багет «GRAND FOOD» з ковбасою 230г</strong><br> (Булочка "Міні Багет", ковбаса копчена, сир твердий, капуста білокачанна, салатний листок, соус)`
        },
        {pic: '3', desc: `<strong>Багет «GRAND FOOD» з шашликом 230г</strong><br> (Булочка "Міні Багет", шашлик курячий, капуста білокачанна, салатний листок, соус)`
        },
        {pic: '4', desc: `<strong>Багет «GRAND FOOD» з шинкою 230г</strong><br> (Булочка "Міні Багет", шинка копчена, сир твердий, капуста білокачанна, салатний листок, соус)`
        },
        {pic: '5', desc: `<strong>Багет «GRAND FOOD» з відбивною 230г</strong><br> (Булочка "Міні Багет", стейк з філе курки, огірки, салатний листок, соус)`
        },
        {pic: '6', desc: `<strong>Багет «GRAND FOOD» Гурман 230г</strong><br> (Булочка "Міні Багет", шинка копчена, ковбаса копчена, ковбаска варена, сир твердий, салат "Морква по-корейськи", салатний листок, соус)`
        },
        {pic: '7', desc: `<strong>Багет «GRAND FOOD» з філе курки 230г</strong><br> (Булочка "Міні Багет", філе куряче варене, огірки, салатний листок, соус)`
        },
        {pic: '8', desc: `<strong>Багет «GRAND FOOD» з підкопченим філе курки 230г</strong><br> (Булочка "Міні Багет", Філе підкопчене, огірки, салатний листок, соус)`
        },
    ]
}